 GA2016C:PROC OPTIONS(MAIN)(IEU001,JWB001) OPTIONS(FETCHABLE) REORDER;        
 /********************************************************************/        
 /* GA2016C                                                          */        
 /*                                                                  */        
 /*                                                                  */        
 /*         DEVIS AUTO INTERNET ETHIAS / MY ETHIAS / AFFINITY        */        
 /*                                                                  */        
 /*               CARACTERISTIQUES DE LA VOITURE                     */        
 /*               =================================                  */        
 /*               SCENARIO 12 : SOUSCRIPTION PAGE 4                  */        
 /*               =================================                  */        
 /*                                                                  */        
 /********************************************************************/        
 /* EURO=YES AUTHOR=TDMKIP/KIPS C.       INTERV= KIPS C.      .......*/        
 /*                                                                  */        
 /********************************************************************/        
 /*  -------------------------------                                 */        
 /*  -  M O D I F I C A T I O N S  -                                 */        
 /*------------------------------------------------------------------*/        
 /* TDMKIP ! 27/08/03 ! CREATION DU PROGRAMME                        */        
 /* TDMKIP ! 18/04/05 ! ramener la version de prod                   */        
 /* TDMTHO ! 23/05/05 ! renommer LTQUALI en CDQUACO                  */        
 /* TDMTHO ! 28/04/06 ! Omnium partielle devient Mini Omnium         */        
 /* TDMTHO ! 20/02/08 ! Ajout fonctionnalit{ DOC1                    */        
 /* TDMTHO ! 10/08/08 ! Ajout ptr DSMB9 pour code barre DOC1         */        
 /* TDMCOU ! 05/11/08 ! ADAPTATION A LA TABLE 500                    */        
 /* TDMTHO ! 27/11/08 ! XA2N25 en FETCHABLE                          */        
 /* TDMKIP ! 29/01/10 ! Plus de messagerie A2BINT                    */        
 /* TDMKIP ! 03/06/10 ! Nouveaux tarifs auto WE096                   */        
 /* ...    ! ...      ! ...                                          */        
 /********************************************************************/        
         
         
 DCL ABS       BUILTIN;        
 DCL ADDR      BUILTIN;        
 DCL CEIL      BUILTIN;        
 DCL DATE      BUILTIN;        
 DCL DATETIME  BUILTIN;        
 DCL DIM       BUILTIN;        
 DCL FLOOR     BUILTIN;        
 DCL INDEX     BUILTIN;        
 DCL LENGTH    BUILTIN;        
 DCL LOW       BUILTIN;        
 DCL MAX       BUILTIN;        
 DCL MIN       BUILTIN;        
 DCL MOD       BUILTIN;        
 DCL NULL      BUILTIN;        
 DCL ONCODE    BUILTIN;        
 DCL ONLOC     BUILTIN;        
 DCL REPEAT    BUILTIN;        
 DCL STG       BUILTIN;        
 DCL SUBSTR    BUILTIN;        
 DCL TIME      BUILTIN;        
 DCL TRANSLATE BUILTIN;        
 DCL UNSPEC    BUILTIN;        
 DCL VERIFY    BUILTIN;        
 /* TDMOHL 03/05/2005 AJOUT DE ONSOURCE, PLIRETC ET PLIRETV */        
 DCL ONSOURCE  BUILTIN;        
 DCL PLIRETC   BUILTIN;        
 DCL PLIRETV   BUILTIN;        
         
 /* TDMSLE : 041103 */        
 DCL CENTER    BUILTIN;        
 DCL LEFT      BUILTIN;        
 DCL RIGHT     BUILTIN;        
 DCL TRIM      BUILTIN;        
 DCL UPPERCASE BUILTIN;        
 DCL PTRADD    BUILTIN;        
 /* TDMSLE FIN : 041103 */        
         
 /* TDMSLE : 041103 -                                         */        
 /*  MISE EN COMMENTAIRE CAR IL FAUT UTILISER 'TRIM' DE VAPLI */        
 /* DCL TRIM      EXT ENTRY RETURNS(CHAR(133) VAR BYVALUE);   */        
 /* DCL LTRIM     EXT ENTRY RETURNS(CHAR(133) VAR BYVALUE);   */        
 /* DCL RTRIM     EXT ENTRY RETURNS(CHAR(133) VAR BYVALUE);   */        
 /* TDMSLE FIN : 041103                                       */        
         
 /*--------------------------------------------------------- ATTRINIT */        
  /* Enterprise PL1*/        
 DCL ATTR1 CHAR(2) VALUE('00C8'X); ##############################        
 DCL ATTR2 CHAR(2) VALUE('00C9'X); ############################        
 DCL ATTR3 CHAR(2) VALUE('00F1'X); ###########################        
 DCL ATTR4 CHAR(2) VALUE('00F9'X); ##############################        
 DCL ATTR5 CHAR(2) VALUE('00E1'X); #######################        
 DCL ATTR6 CHAR(2) VALUE('00F0'X); #############################        
 DCL ATTR7 CHAR(2) VALUE('00F8'X); ################################        
 DCL ATTR8 CHAR(2) VALUE('00D9'X); ################################        
         
 DCL NUMERR_E CHAR(2) VALUE('C0D9'X); ################################        
 DCL ALPERR_E CHAR(2) VALUE('C0C9'X); ################################        
 DCL NUMCSR_E CHAR(2) VALUE('C0D1'X); ################################        
 DCL ALPCSR_E CHAR(2) VALUE('C0C1'X); ################################        
 DCL NUMDEP_E CHAR(2) VALUE('00D1'X); ################################        
 DCL ALPDEP_E CHAR(2) VALUE('00C1'X); ################################        
 DCL NODCSR_E CHAR(2) VALUE('C0C5'X); ################################        
 DCL NODDEP_E CHAR(2) VALUE('00C5'X); ################################        
 DCL NODPRT_E CHAR(2) VALUE('00E5'X); ################################        
         
 DCL HEX00 CHAR(1)   VALUE('00'X);        
 DCL HEX02 CHAR(1)   VALUE('02'X);   ################################        
 DCL HEXFF CHAR(1)   VALUE('FF'X);        
 DCL HEX3F CHAR(1)   VALUE('3F'X);        
 DCL HEX15 CHAR(1)   VALUE('15'X);  ##################        
 DCL HEX4A CHAR(1)   VALUE('4A'X);  ###################        
 DCL HEX403F CHAR(2) VALUE('403F'X);        
 DCL HEX40 CHAR(1)   VALUE('40'X);        
 DCL HEX4B CHAR(1)   VALUE('4B'X);        
 DCL SCA1  CHAR(2)   VALUE('0080'X); #########################        
 DCL SCA2  CHAR(2)   VALUE('00C0'X); ##################################        
 DCL SCA3  CHAR(2)   VALUE('00A0'X); ############################################        
 DCL SCA4  CHAR(2)   VALUE('0090'X); ############################        
 /*----------------------------------------------------- END ATTRINIT */        
 /* -------------------------------------------------------- ATTRIMOD */        
 /* exemples:   ZONE_A   CHAR(6)                                      */        
 /*  reverse:   ZONE_A = '  '!!REV_E;                                 */        
 /*  neutral:   ZONE_A = '  '!!NEU_E;                                 */        
 /*  rev+neu:   ZONE_A = '  '!!REV_E!!NEU_E;                          */        
 /* sans effet: ZONE_A = SEF_E;                                       */        
 /* ----------- 1 Commentaire = 1 ligne ---------------- JCC 09-12-02 */        
         
         
 DCL    SEF_E   CHAR(6)  STATIC INIT('');  ##########################        
        SEF_E  = LOW(LENGTH(SEF_E));        
 DCL    BLI_E   CHAR(2)  STATIC ,     #############################        
        REV_E   CHAR(2)  STATIC ,     #############################        
        UND_E   CHAR(2)  STATIC ;     #############################        
 UNSPEC(BLI_E) = '1100000111110001'B;        
 UNSPEC(REV_E) = '1100000111110010'B;        
 UNSPEC(UND_E) = '1100000111110100'B;        
 DCL    BLU_E   CHAR(2)  STATIC ,     #############################        
        RED_E   CHAR(2)  STATIC ,     #############################        
        PIN_E   CHAR(2)  STATIC ,     #############################        
        GRN_E   CHAR(2)  STATIC ,     #############################        
        TRQ_E   CHAR(2)  STATIC ,     #############################        
        YEL_E   CHAR(2)  STATIC ,     #############################        
        NEU_E   CHAR(2)  STATIC ;     #############################        
 UNSPEC(BLU_E) = '1100001011110001'B;        
 UNSPEC(RED_E) = '1100001011110010'B;        
 UNSPEC(PIN_E) = '1100001011110011'B;        
 UNSPEC(GRN_E) = '1100001011110100'B;        
 UNSPEC(TRQ_E) = '1100001011110101'B;        
 UNSPEC(YEL_E) = '1100001011110110'B;        
 UNSPEC(NEU_E) = '1100001011110111'B;        
 /*----------------------------------------------------- END ATTRIMOD */        
         
 /*---------------------------------------------------------- $DATTIM */        
 /*      Date & Heure ordinateur sous toutes les formes     */        
 /*     ------------------------------------------------    */        
 /*     ->     call $Dates_Times pour rafraichir      <-    */        
 /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - */        
 DCL $DATE_TIME          CHAR(17) INIT(''); #################################        
 DCL $DATE_MSK           CHAR(17);        
 DCL $DATE_HEURE         CHAR(18) INIT(''); #################################        
 DCL 1 $DATE_TIME_W BASED(ADDR($DATE_TIME)),        
      2 S    CHAR(1),        
      2 A    CHAR(1),        
      2 AA   CHAR(2),        
      2 MM   CHAR(2),        
      2 JJ   CHAR(2),        
      2 HH   CHAR(2),        
      2 MI   CHAR(2),        
      2 SS   CHAR(2),        
      2 CCC  CHAR(3);        
         
 DCL $DATE_AAAAMMJJ      CHAR(08);    ####################################        
 DCL #DATE_AAAAMMJJ      PIC'(08)9'        
      BASED(ADDR($DATE_AAAAMMJJ));        
 DCL $DATE_AAMMJJ        CHAR(06);    ####################################        
 DCL #DATE_AAMMJJ        PIC'(06)9'        
      BASED(ADDR($DATE_AAMMJJ));        
 DCL $DATE_SAAMMJJ       CHAR(07);    ####################################        
 DCL #DATE_SAAMMJJ       PIC'(07)9'        
      BASED(ADDR($DATE_SAAMMJJ));        
 DCL $DATE_JJMMAAAA      CHAR(08);    ####################################        
 DCL #DATE_JJMMAAAA      PIC'(08)9'        
      BASED(ADDR($DATE_JJMMAAAA));        
 DCL $DATE_JJMMAA        CHAR(06);    ####################################        
 DCL #DATE_JJMMAA        PIC'(06)9'        
      BASED(ADDR($DATE_JJMMAA));        
         
 DCL $DATE_AAAA          CHAR(04);    ####################################        
 DCL #DATE_AAAA          PIC'(04)9'        
      BASED(ADDR($DATE_AAAA));        
 DCL $DATE_AA            CHAR(02);    ####################################        
 DCL #DATE_AA            PIC'(02)9'        
      BASED(ADDR($DATE_AA));        
 DCL $DATE_S             CHAR(01);    ####################################        
 DCL #DATE_S             PIC'(01)9'        
      BASED(ADDR($DATE_S));        
 DCL $DATE_SAA           CHAR(03);    ####################################        
 DCL #DATE_SAA           PIC'(03)9'        
      BASED(ADDR($DATE_SAA));        
         
 DCL $DATE_MM            CHAR(02);    ####################################        
 DCL #DATE_MM            PIC'(02)9'        
      BASED(ADDR($DATE_MM));        
 DCL $DATE_JJ            CHAR(02);    ####################################        
 DCL #DATE_JJ            PIC'(02)9'        
      BASED(ADDR($DATE_JJ));        
         
 DCL $TIME_HHMMSSCCC     CHAR(09);    ####################################        
 DCL #TIME_HHMMSSCCC     PIC'(09)9'        
      BASED(ADDR($TIME_HHMMSSCCC));        
 DCL $TIME_HHMMSS        CHAR(06);    ####################################        
 DCL #TIME_HHMMSS        PIC'(06)9'        
      BASED(ADDR($TIME_HHMMSS));        
 DCL $TIME_HHMM          CHAR(04);    ####################################        
 DCL #TIME_HHMM          PIC'(04)9'        
      BASED(ADDR($TIME_HHMM));        
 DCL $TIME_HH            CHAR(02);    ####################################        
 DCL #TIME_HH            PIC'(02)9'        
      BASED(ADDR($TIME_HH));        
 DCL $TIME_MM            CHAR(02);    ####################################        
 DCL #TIME_MM            PIC'(02)9'        
      BASED(ADDR($TIME_MM));        
         
 DCL $DATE_JJ_MM_AAAA    CHAR(10);    ####################################        
 DCL $DATE#JJ#MM#AAAA    CHAR(10);    ####################################        
 DCL $DATE_JJ_MM_AA      CHAR(08);    ####################################        
         
 DCL $TIME_HH_MM_SS_CCC  CHAR(12);    ####################################        
 DCL $TIME_HH_MM_SS      CHAR(08);    ####################################        
 DCL $TIME#HH#MM#SS      CHAR(08);    ####################################        
 DCL $TIME_HH_MM         CHAR(05);    ####################################        
         
 DCL $TIME_STAMP         CHAR(26);    ###########################################        
 DCL $TIME_STAMP_PL1     CHAR(20);    ###########################################        
 /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - */        
 $DATE_MSK = 'ABCDEFGHIJKLMNOPQ';        
         
 CALL $DATES_TIMES;        
         
 $DATES_TIMES: PROC;        
 $DATE_TIME      = DATETIME();        
 $DATE_HEURE     = $DATE_TIME_W.JJ!!'/'!!$DATE_TIME_W.MM!!'/'!!        
                   $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                   ' - '!!$DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI;        
 $DATE_AAAAMMJJ     = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                      $DATE_TIME_W.MM!!$DATE_TIME_W.JJ;        
 $DATE_JJMMAAAA     = $DATE_TIME_W.JJ!!$DATE_TIME_W.MM!!$DATE_TIME_W.S!!        
                      $DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE_AAMMJJ       = $DATE_TIME_W.AA!!$DATE_TIME_W.MM!!$DATE_TIME_W.JJ;        
 $DATE_JJMMAA       = $DATE_TIME_W.JJ!!$DATE_TIME_W.MM!!$DATE_TIME_W.AA;        
 $DATE_SAAMMJJ      = $DATE_TIME_W.S!!$DATE_TIME_W.AA!!$DATE_TIME_W.MM!!        
                      $DATE_TIME_W.JJ;        
 $DATE_AAAA         = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE_AA           = $DATE_TIME_W.AA;        
 $DATE_S            = $DATE_TIME_W.S;        
 $DATE_SAA          = $DATE_TIME_W.S!!$DATE_TIME_W.AA;        
 $DATE_MM           = $DATE_TIME_W.MM;        
 $DATE_JJ           = $DATE_TIME_W.JJ;        
 $DATE_JJ_MM_AAAA   = $DATE_TIME_W.JJ!!'/'!!        
                      $DATE_TIME_W.MM!!'/'!!$DATE_TIME_W.S!!        
                      $DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE#JJ#MM#AAAA   = $DATE_TIME_W.JJ!!'.'!!        
                      $DATE_TIME_W.MM!!'.'!!$DATE_TIME_W.S!!        
                      $DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE_JJ_MM_AA     = $DATE_TIME_W.JJ!!'/'!!        
                      $DATE_TIME_W.MM!!'/'!!$DATE_TIME_W.AA;        
 $TIME_HHMMSSCCC    = $DATE_TIME_W.HH!!$DATE_TIME_W.MI!!        
                      $DATE_TIME_W.SS!!$DATE_TIME_W.CCC;        
 $TIME_HHMMSS       = $DATE_TIME_W.HH!!$DATE_TIME_W.MI!!        
                      $DATE_TIME_W.SS;        
 $TIME_HHMM         = $DATE_TIME_W.HH!!$DATE_TIME_W.MI;        
 $TIME_HH           = $DATE_TIME_W.HH;        
 $TIME_MM           = $DATE_TIME_W.MI;        
 $TIME_HH_MM_SS_CCC = $DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI!!':'!!        
                      $DATE_TIME_W.SS!!':'!!$DATE_TIME_W.CCC;        
 $TIME_HH_MM_SS     = $DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI!!':'!!        
                      $DATE_TIME_W.SS;        
 $TIME#HH#MM#SS     = $DATE_TIME_W.HH!!'.'!!$DATE_TIME_W.MI!!'.'!!        
                      $DATE_TIME_W.SS;        
 $TIME_HH_MM        = $DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI;        
 $TIME_STAMP        = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                      '-'!!$DATE_TIME_W.MM!!'-'!!$DATE_TIME_W.JJ!!'-'!!        
                      $DATE_TIME_W.HH!!'.'!!$DATE_TIME_W.MI!!'.'!!        
                      $DATE_TIME_W.SS!!'.'!!$DATE_TIME_W.CCC!!'000';        
 $TIME_STAMP_PL1    = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                      $DATE_TIME_W.MM!!$DATE_TIME_W.JJ!!        
                      $DATE_TIME_W.HH!!$DATE_TIME_W.MI!!        
                      $DATE_TIME_W.SS!!$DATE_TIME_W.CCC!!'000';        
 $END $DATES_TIMES;        
 /*------------------------------------------------------ END $DATTIM */        
         
 /********************************************        
 * DECLARATION DES PARAMETRES DE LA ROUTINE  *        
 ********************************************/        
 /*********************************************************************/        
 /*                                                                   */        
 /*         INTERFACE DE COMMUNICATION AVEC BEU001                    */        
 /*         ======================================                    */        
 /*                                                                   */        
 /* USAGE :                                                           */        
 /* CALL BEU001(IEU001,COUNT,FUNCT,DATAPCB,IOAREA,                    */        
 /*             SSA1, SSA2, SSA3, SSA4, SSA5, SSA6, SSA7);            */        
 /*********************************************************************/        
 /* MODE CONVERSION :                                                 */        
 /*                                                                   */        
 /* CALL BEU001(IEU001,THREE,'GCV',DATAPCB,IOAREA);                   */        
 /*                                                                   */        
 /*********************************************************************/        
 /*                                                                   */        
 /* PROCEDURE DE COMPILATION : TDMFOG.LIB.CNTL(FETCH)                 */        
 /* MODULE A TRANSFERER PAR L'EQUIPE SYSTEME : FEUT.T.LOAD(BEU001)    */        
 /*                                                                   */        
 /*********************************************************************/        
 /* DESCRIPTION DES MESSAGES D'ERREURS : CDRTPGM                      */        
 /* -----------------------------------                               */        
 /* DB : PROBLEME BASE DE DONNEES : VOIR LE PCB DATA                  */        
 /* 01 : COEFFICIENT DE CONVERSION EURO --> FB ERRONE                 */        
 /* 02 : PARAM. CODE DEVISE DIFFERENT DE 'F' ET 'E'                   */        
 /* 03 : PARAM. CODE PAGE DIFFERENT DE '500' ET '274'                 */        
 /* 04 : PARAM. CODE USAGE APPLICATION DIFF. DE : 3 = 3270            */        
 /*                                        P = HOST PRINTER           */        
 /*                                        L = LOCAL PRINTER          */        
 /*                                        Q = MQSERIES               */        
 /* 05 : CODE DEVISE MAL INSTALLE DANS LE DICTIONNAIRE                */        
 /* 06 : CODE PAGE MAL INSTALLE DANS LE DICTIONNAIRE                  */        
 /* 07 : CODE VERSION DE LA DB MAL INSTALLE DANS LE DICTIONNAIRE      */        
 /* 08 : DESCRIPTION FORME EXTERNE DU SEGMENT ABSENTE DU DICTIONNAIRE */        
 /* 09 : ERREUR BASE DE DONNEE SUR LA DB DICTIONNAIE                  */        
 /* 10 : LONGUEUR D'ATTRIBUT MODIFIEE POUR FORMAT TYPE : BF/BE/DE     */        
 /* 11 : LE FORMAT DE MONTANT DEVISE OU DATE  <> DZ/DF/BF             */        
 /* 12 : EN ISRT, REPL, LA DATE DOIT OBLIG. ETRE EXPRIMEE EN SAAMMJJ  */        
 /* 13 : FORMAT DE DONNEE NON RECONNU                                 */        
 /* 14 : LONGUEUR EN BYTE INADEQUATE POUR UN TYPE BF                  */        
 /* 15 : LONGUEUR TYPE BF <> 2/4                                      */        
 /* 16 : LONGUEUR TYPE DE/BE <> 4/8                                   */        
 /* 17 : EN ISRT, REPL, LA D. COMPLEM. DOIT ETRE EXPRIMEE EN SAAMMJJ  */        
 /* 18 : MONTANT AU FORMAT ZONED DECIMAL NON NUMERIQUE EN LECTURE     */        
 /* 19 : MONTANT AU FORMAT PACKED DECIMAL NON NUMERIQUE EN LECTURE    */        
 /* 20 : MONTANT AU FORMAT ZONED DECIMAL NON NUMERIQUE EN M A J       */        
 /* 21 : MONTANT AU FORMAT PACKED DECIMAL NON NUMERIQUE EN M A J      */        
 /* 22 : COUNT < 2 OU > 10                                            */        
 /* 23 : FONCTION NON IMPLEMENTEE CAR NON SPECIFIQUE A DL1            */        
 /* 24 : FONCTION INCONNUE                                            */        
 /* 25 : NOMBRE D'ATTRIBUTS DU SEGMENT DEPASSANT LE MAXIMUM AUTORISE  */        
 /* 26 : LONGUEUR DE RUBRIQUE MAL DEFINIE AU DICTIONNAIRE             */        
 /* 27 : COUNT PARAMETER > 7                                          */        
 /* 28 : PROTOCOLE EURO POSTPOSE JUSQU'A LA CONVERSION DE LA CAISSE   */        
 /* 29 : PARAMETRE SOCIETE NON RECONNU                                */        
 /* 30 : PROTOCOLE EURO INTERDIT CAR DB NON CONVERTIE A L'EURO        */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1     IEU001,        
 /*------------------------- I N P U T -------------------------------*/        
      2    PTR,                        #################################################################        
       3   METAPCB      PTR,           ####################################################        
       3   ALTPCB       PTR,           ####################################################        
      2    INPUT,                      ###############################################################        
       3   LTSCTRN      CHAR (4),      ###############################################        
       3   CDDVTRN      CHAR (3),      ###############################################        
       3   CDPGTRN      CHAR (3),      ###############################################        
       3   CDTYUSR      CHAR (1),      ###############################################        
       3   CDPGMID      CHAR (8),      ###############################################        
       3   CDDFSEG      CHAR (8),      ###############################################        
       3   LASTCALL     CHAR (30),     ##############################################        
       3   TBEGCOD(32)  BIT(1),        #################################################        
                                       /*--!  BIT 1: MAJ EURO         */        
                                       /*--!    AUTORISEE AVANT PIVOT */        
                                       /*--!  BIT 2: NE PAS CONVERTIR */        
                                       /*--!  BIT 3: MAJ BEF          */        
                                       /*--!    AUTORISEE APRES PIVOT */        
       3   TBDISPO(128),        
        4  DBDNAME      CHAR(8),       ################################################        
        4  DBSTATE      CHAR(1),       ################################################        
                                       /*--! 0 : UPDATABLE            */        
                                       /*--! 1 : READ ONLY (NU)       */        
                                       /*--! 2 : NO ACCESS (NA)       */        
       3   FILLER       CHAR(200),     ##############################################        
         
 /*------------------------ O U T P U T ------------------------------*/        
      2    OUTPUT,                     ##############################################################        
       3   CDRTPGM      CHAR (6),      ###############################################        
       3   LTRTPGM      CHAR (60),     ##############################################        
       3   DBPTR        PTR,           ####################################################        
       3   LASTDLI      CHAR (10);     ##############################################        
         
 /*------------------- REDEFINITIONS DE IEU001 -----------------------*/        
 DCL 1     IEU001_R     BASED(ADDR(IEU001.INPUT.FILLER)),        
       2   CDEVTRN      CHAR(001),     ##############################################        
                                       /*--!  P : VALEUR PAR DEFAUT   */        
       2   CDDEVDB      CHAR(003),     ##############################################        
                                       /*--!  BEF / EUR               */        
       2   TBDFDBD_PTR  PTR,        
       2   TBDFATT_PTR  PTR,        
       2   TBDFSEG_PTR  PTR,        
       2   SYSTIME      BIN FIXED(31),        
       2   DATEORD      PIC '(7)9',        
       2   NBMXCOP_C    FIXED BIN(15),        
       2   FILLER       CHAR(170);     ##############################################        
 /*********************************************************************/        
              /* INTERFACE DL1          */        
 DCL 1    GA2016J           BASED(JWB001.GXXXXXJ_P),        
 /*------------------------- I N P U T -------------------------------*/        
      2   INPUT,        
       3  IOPCB             PTR,        
       3  ALTPCB            PTR,        
       3  PRTPCB            PTR,        
       3  SPA_PTR           PTR,        
       3  MID_PTR           PTR,        
       3  PAGE_PTR          PTR,        
       3  PAGEER_PTR        PTR,        
       3  LTNMMTH           CHAR(20),        
       3  DXI10PCB          PTR,                                                
       3  DC105PCB          PTR,                                                
       3  DSM88PCB          PTR,        
       3  DXI04PCB          PTR,        
       3  DXI05PCB          PTR,        
       3  DXI06PCB          PTR,        
       3  DA215PCB          PTR,                                                
       3  DA215$PCB         PTR,                                                
       3  DA2152PCB         PTR,                                                
       3  DA216PCB          PTR,                                                
       3  DA223PCB          PTR,                                                
       3  DEU02PCB          PTR,                                                
       3  DS101PCB          PTR,        
       3  DS101S2PCB        PTR,        
       3  DS101S3PCB        PTR,        
       3  DS106PCB          PTR,        
       3  DS108PCB          PTR,        
       3  DS124PCB          PTR,        
       3  DSM19PCB          PTR,        
       3  DS102PCB          PTR,        
       3  DSM40PCB          PTR,        
       3  DS133PCB          PTR,        
       3  DS103PCB          PTR,        
       3  DS139PCB          PTR,        
       3  DSM22PCB          PTR,        
       3  DSM18PCB          PTR,        
       3  DSM18BPCB         PTR,        
       3  DD201PCB          PTR,        
       3  DSM43PCB          PTR,        
       3  DEU02MPCB         PTR,        
       3  DEU02DPCB         PTR,        
       3  DSM55PCB          PTR,        
       3  DC105MPCB         PTR,        
       3  DS125PCB          PTR,        
       3  DS137PCB          PTR,        
       3  DCO15PCB          PTR,        
       3  DCO26PCB          PTR,        
       3  DSM25MPCB         PTR,        
       3  DS101MPCB         PTR,        
       3  DS101M2PCB        PTR,        
       3  DS101M3PCB        PTR,        
       3  DS106MPCB         PTR,        
       3  DS108MPCB         PTR,        
       3  DS124MPCB         PTR,        
       3  DS125MPCB         PTR,        
       3  DS137MPCB         PTR,        
       3  DCO15MPCB         PTR,        
       3  DCO26MPCB         PTR,        
       3  DSM22MPCB         PTR,        
       3  DDO01PCB          PTR,        
       3  DDO02PCB          PTR,        
       3  DDO03PCB          PTR,        
       3  DC105SPCB         PTR,                                                
       3  DSM60PCB          PTR,                                                
       3  DSM61PCB          PTR,                                                
       3  DSM62PCB          PTR,                                                
       3  DSM63PCB          PTR,                                                
       3  DSM64PCB          PTR,                                                
       3  DSM65PCB          PTR,                                                
       3  DSM66PCB          PTR,                                                
       3  DSM67PCB          PTR,                                                
       3  DSM68PCB          PTR,                                                
       3  DSM69PCB          PTR,                                                
       3  DS102$PCB          PTR,                                               
       3  DS128PCB          PTR,                                                
       3  DS132PCB          PTR,                                                
       3  DS134PCB          PTR,                                                
       3  DS137$PCB          PTR,                                               
       3  DSM01PCB          PTR,                                                
       3  DSM06PCB          PTR,                                                
       3  DSM07PCB          PTR,                                                
       3  DSM09PCB          PTR,                                                
       3  DS146PCB          PTR, ################################################                   
       3  DSM80PCB          PTR, ################################################                   
       3  DSMB9PCB          PTR; ################################################                   
             /* SERVICE                */        
 /*******************************************************************/        
 /* INTERFACE GENERAL POUR TOUS LES SERVICES                        */        
 /*******************************************************************/        
         
 DCL 1  JWB001,        
      2   CDEVCLI    CHAR(01),      ########################################        
      2   RETOUR     BIT (1),       #########################################        
      2   LEVEL      PIC '9',       #########################################        
      2   ATTRIB     CHAR(02),      ########################################        
      2   LTNMSER    CHAR(08),      ########################################        
      2   ENTREE,        
       3  DBSCRAT,        
        4 METAPCB    PTR,           ##############################################        
        4 DBSCRPCB   PTR,           ##############################################        
        4 LTSGSCR    CHAR(08),      #########################################        
       3  DBTABLE,        
        4 METAPCB    PTR,           ##############################################        
        4 DBTABPCB   PTR,           ##############################################        
        4 LTSGTAB    CHAR(08),      #########################################        
        4 CDDFTAB    CHAR(08),      #########################################        
       3  DBCOMDE,        
        4 METAPCB    PTR,           ##############################################        
        4 DBCDEPCB   PTR,           ##############################################        
        4 LTSGCDE    CHAR(08),      #########################################        
        4 CDDFCDE    CHAR(08),      #########################################        
       3  CDTRACE    PIC '9',       ##########################################        
       3  TBTRACE_I  FIXED (5),     ########################################        
       3  BOTBDB2    BIT (1),       ##########################################        
       3  LTNMBUS    CHAR(20),      #########################################        
       3  LTNMOBJ    CHAR(20),      #########################################        
       3  LTNMMTH    CHAR(20),      #########################################        
      2   SORTIE,        
       3  CDRTPGM    CHAR(09),      #########################################        
       3  CDRTDB2    BIN FIXED(31), ####################################        
       3  SQLERRM    CHAR (70) VAR, ####################################        
       3  CDROLLB    BIT(1),        ###########################################        
       3  LSTCALL    CHAR(12),      #########################################        
       3  LSTSERV    CHAR(12),      #########################################        
       3  TBTRACE (100),            ###############################################        
        4 FLAG_TRACE CHAR(01),        
        4 MSGE_TRACE CHAR(40),        
      2   GXXXXXJ_P  PTR;           ##############################################        
         
 /* EXPLICATIONS:                                                    */        
 /*                                                                  */        
 /* APPEL DU BUS 'LTNMBUS' POUR EXECUTION DE LA FONCTION 'LTNMFCT'   */        
 /* DE L'OBJET 'LTNMOBJ'                                             */        
 /*                                                                  */        
 /* LES TRACES SONT AFFICHEES EN FCT DE CDTRACE (0->9)               */        
 /* ->  0 PAS DE TRACE, 9 TRACE COMPLETES                            */        
         
         
              /* BUS                    */        
         
 /********************************************        
 * INTERFACES AVEC LES SCENARIOS             *        
 ********************************************/        
 DCL XEU100  ENTRY OPTIONS(FETCHABLE);        
         
 DCL XA2F11 ENTRY;            #####################################################        
 /**********************************************************************        
 *                                                                     *        
 *                        AUTO PRODUCTION                              *        
 *                        +++++++++++++++                              *        
 *                                                                     *        
 *                SAUVEGARDE DES DEVIS VIA INTERNET (DSM88)            *        
 *                =================================                    *        
 * TDMBIE 23.01.02 ECRITURE                                            *        
 * TDMTHO 04.05.06 AJOUT DATE ECHeANCE                                 *        
 * TDMKIP 17.11.08 AJOUT NOHA1AF,NOHA2AF,NOHA1CO,NOHA2CO               *        
 * TDMSOX 10.06.10 NOUVELLES ZONES TARIFS AUTOS WE96                   *        
 *                                                                     *        
 **********************************************************************/        
         
 DCL 1    JA2F11,                           #######################################################        
 /*------------------------- I N P U T -------------------------------*/        
      2   PTRPCB,        
         3 ALTPCB       PTR,           ####################################################        
         3 TABPCB       PTR,           ####################################################        
         3 DSM88PCB     PTR,           ####################################################        
         3 DSM22PCB     PTR,           ####################################################        
         3 DS139PCB     PTR,           ####################################################        
         3 DS133PCB     PTR,           ####################################################        
         3 DSM55PCB     PTR,           ####################################################        
         3 DEU02PCB     PTR,           ####################################################        
      2   INPUT,        
         3 CDTYPOP      CHAR(1),       ################################################        
         3 NOIDDEV      FIXED DEC(11), ##########################################        
         3 NOIDVER     FIXED(3),       ################################################        
         3 CDCMGES     CHAR(08),       ################################################        
         3 CDCMPRO     CHAR(01),       ################################################        
         3 CDSCTRN     CHAR(01),       ################################################        
         3 CDDVTRN     CHAR(01),       ################################################        
         3 CDEVTRN     CHAR(01),       ################################################        
         3 LTOBJOP,        
          4  NOSQINT             CHAR(05), ######################################        
          4  NOSQSUJ             CHAR(05), ######################################        
          4  CDCNTVC             CHAR(03), ######################################        
          4  CDCAC               CHAR(15), ######################################        
          4  CDOPER              CHAR(03), ######################################        
          4  CDPRODU             CHAR(07), ######################################        
          4  CDTYPPR             CHAR(03), ######################################        
          4  CDLETTR             CHAR(03), ######################################        
          4  CDCANAL             CHAR(09), ######################################        
          4  CDTTAPP             CHAR(02), ######################################        
          4  NOSEQRB             CHAR(03), ######################################        
          4  CDSGGES             CHAR(01), ######################################        
          4  CDCOUGE             CHAR(04), ######################################        
          4  CDDEVIS             CHAR(11), ######################################        
          4  CDRSCTL             CHAR(01), ######################################        
      2   DATA,        
         3  NOIDPOL     CHAR(08),      ###############################################        
         3  CDPADIV     CHAR(02),      ###############################################        
         3  CDDRIVE     CHAR(01),      ###############################################        
         3  NOAGTAV     CHAR(06),      ###############################################        
         3  RDMAGIS     CHAR(01),      ###############################################        
         3  VABMACT     CHAR(02),      ###############################################        
         3  VABMSOU     CHAR(02),      ###############################################        
         3  VAMDACT     CHAR(02),      ###############################################        
         3  LTRETAR     CHAR(06),      ###############################################        
         3  CDTYFRA     CHAR(01),      ###############################################        
         3  CDTAXES     CHAR(01),      ###############################################        
         3  CDCOTIS     CHAR(01),      ###############################################        
         3  CDFRACT     CHAR(01),      ###############################################        
         3  CDFORGA     CHAR(01),      ###############################################        
         3  CDPROMO     CHAR(01),      ###############################################        
         3  CDJEENF     CHAR(01),      ###############################################        
         3  CDJEFAM     CHAR(01),      ###############################################        
         3  CDTY2PO     CHAR(01),      ###############################################        
         3  CDSINIS     CHAR(01),      ###############################################        
         3  CDGRPAF     CHAR(07),      ###############################################        
         3  CDTYDEV     CHAR(02),      ###############################################        
         3  CDUSVEH     CHAR(2),       ################################################        
         3  DAEFRJJ     CHAR(2),       ################################################        
         3  DAEFRMM     CHAR(2),       ################################################        
         3  DAEFRAA     CHAR(4),       ################################################        
         3  DAEFAJJ     CHAR(2),       ################################################        
         3  DAEFAMM     CHAR(2),       ################################################        
         3  DAEFAAA     CHAR(4),       ################################################        
         3  CDGAZOI     CHAR(01),      ###############################################        
         3  NBKMPRO     FIXED DEC(3),  ###########################################        
         3  NBJRPRO     FIXED DEC(3),  ###########################################        
         3  NBKMAVH     FIXED DEC(3),  ###########################################        
         3  NBFRDMA     FIXED DEC(3),  ###########################################        
         3  LTREFCL     CHAR(30),      ###############################################        
         3  CDCLS1      PIC'99',       ################################################        
         3  CDCLS2      PIC'99',       ################################################        
         3  CDCLS3      PIC'99',       ################################################        
         3  CDCLS4      PIC'99',       ################################################        
         3  CDCLS5      PIC'99',       ################################################        
         3  CDTYPVH_W   PIC'99999',    #############################################        
         3  JJDEPER     CHAR(02),      ###############################################        
         3  MMDEPER     CHAR(02),      ###############################################        
         3  AADEPER     CHAR(04),      ###############################################        
         3  CDSTART     CHAR(01),      ###############################################        
         3  CDJEUCO     CHAR(01),      ###############################################        
         3  CDUSPRO     PIC'9',        #################################################        
         3  CDTABBM     CHAR(1),       ################################################        
         3  CDTAGAN     CHAR(1),       ################################################        
         3  CDIDSEG     CHAR(1),       ################################################        
         3  CDIDTRF     CHAR(1),       ################################################        
         3  CDASTMC     CHAR(1),       ################################################        
         3  CDHOREC     CHAR(1),       ################################################        
         3  CDCIBCL     CHAR(2),       ################################################        
         3  CDIDPRO     CHAR(3),       ################################################        
         3  NUVSPRO     PIC'99',       ################################################        
         3  CDTYPRO     CHAR(2),       ################################################        
         3  CDGEPRO     CHAR(2),       ################################################        
         3  SIGNAL,        
          4  CDRSAFF     CHAR(01),     ##############################################        
          4  LTNMAFF     CHAR(20),     ##############################################        
          4  LTPRAFF     CHAR(15),     ##############################################        
          4  CDTYPAF     CHAR(01),     ##############################################        
          4  CDLGPOL     CHAR(01),     ##############################################        
          4  NOIDAFF     CHAR(08),     ##############################################        
          4  LTADRAF     CHAR(25),     ##############################################        
          4  NOHA1AF   BIN FIXED(15),  ###########################################        
          4  NOHA2AF     CHAR(04),     ##############################################        
          4  LTLOCAF     CHAR(23),     ##############################################        
          4  CDCPOAF     CHAR(06),     ##############################################        
          4  DANAIJJ     CHAR(02),     ##############################################        
          4  DANAIMM     CHAR(02),     ##############################################        
          4  DANAIAA     CHAR(04),     ##############################################        
          4  CDRSCCO     CHAR(01),     ##############################################        
          4  LTNOMCO     CHAR(20),     ##############################################        
          4  LTPRECO     CHAR(15),     ##############################################        
          4  LTADRCO     CHAR(30),     ##############################################        
          4  NOHA1CO   BIN FIXED(15),  ###########################################        
          4  NOHA2CO     CHAR(04),     ##############################################        
          4  LTLOCCO     CHAR(23),     ##############################################        
          4  CDCPOCO     CHAR(06),     ##############################################        
          4  DANCOJJ     CHAR(02),     ##############################################        
          4  DANCOMM     CHAR(02),     ##############################################        
          4  DANCOAA     CHAR(04),     ##############################################        
         3  VEHIC,        
          4  LTMARVH    CHAR(15),      ###############################################        
          4  CDEURTX    CHAR(07),      ###############################################        
          4  ANCSTVH    CHAR(04),      ###############################################        
          4  CDCATVH    CHAR(03),      ###############################################        
          4  NUPUIVH     CHAR(03),     ##############################################        
          4  NUCYLVH     CHAR(05),     ##############################################        
          4  NBPRTAV     CHAR(04),     ##############################################        
          4  NBPRTAR     CHAR(04),     ##############################################        
          4  VACATVH     CHAR(09),     ##############################################        
          4  VAACTVH     CHAR(09),     ##############################################        
          4  VAOBJVH     CHAR(05),     ##############################################        
          4  NUPDSVH     CHAR(04),     ##############################################        
          4  VAACCVH     CHAR(09),     ##############################################        
          4  LTPLQVH     CHAR(12),     ##############################################        
          4  LTCHAVH     CHAR(17),     ##############################################        
          4  CDALARM     CHAR(1),      ###############################################        
          4  NBKMCPT     FIXED DEC(11),#########################################        
          4  CDTARJE     CHAR(1),      ###############################################        
          4  CDFRANS     CHAR(2),      ###############################################        
          4  TBDEVGA(10),              #######################################################        
           5  CDTYGAR    CHAR(03),     ##############################################        
           5  CDTFGAR    CHAR(02),     ##############################################        
           5  NUVSTRF    PIC'99',      ###############################################        
           5  PRBASGA    FIXED DEC(9), ##########################################        
           5  NUMJDIV  DEC FIXED(5,2), ##########################################        
           5  NUMJLEA  DEC FIXED(3),   ############################################        
           5  NUMJPDG  DEC FIXED(3),   ############################################        
           5  NURDCLI  DEC FIXED(3),   ############################################        
           5  NURDPLU  DEC FIXED(3),   ############################################        
           5  NURDFRA  DEC FIXED(3),   ############################################        
           5  NURDLOI  DEC FIXED(3),   ############################################        
           5  NURDGAZ  DEC FIXED(3),   ############################################        
           5  NURDDIV  DEC FIXED(5,2), ##########################################        
          4  CDOLDVH   CHAR(1),        #################################################        
          4  CDECOVH   CHAR(2),        #################################################        
         3  ACCES(14),        
          4 LTACCSP  CHAR(30),         #################################################        
          4 VAACCSP  DEC FIXED(7),     #############################################        
         3  REMORQUE,        
          4  CDCATRE     CHAR(03),     ##############################################        
          4  LTMARRE     CHAR(15),     ##############################################        
          4  ANCSTRE     CHAR(04),     ##############################################        
          4  VACATRE     CHAR(09),     ##############################################        
          4  VAACTRE     CHAR(09),     ##############################################        
          4  NUPDSRE     CHAR(04),     ##############################################        
          4  TBGARRE(09),              #######################################################        
           5  CDTYGAR    CHAR(03),     ##############################################        
           5  CDTFGAR    CHAR(02),     ##############################################        
           5  NUVSTRF    PIC'99',      ###############################################        
           5  PRBASGA    FIXED DEC(9), ##########################################        
         3  ANTEC,        
          4  CDINTOX     CHAR(01),     ##############################################        
          4  CDIVRES     CHAR(1),      ###############################################        
          4  CDFUITE     CHAR(01),     ##############################################        
          4  NBDECPE     PIC'99' ,     ##############################################        
          4  NBSINRC     PIC'9',       ################################################        
          4  NBSINDM     PIC'9',       ################################################        
          4  NBSINVO     PIC'9',       ################################################        
          4  CDPRASS     CHAR(1),      ###############################################        
          4  NOIDCMP     CHAR(4),      ###############################################        
          4  NOPOCMP     CHAR(12),     ##############################################        
          4  CDPORES     CHAR(1),      ###############################################        
          4  CDIDRES     CHAR(1),      ###############################################        
          4  CDMOTAN     CHAR(2),      ###############################################        
          4  ECRCDEC     CHAR(2),      ###############################################        
         3 JEUNECO(3),        
          4 LTNMCON  CHAR(20),         ##################################################        
          4 LTPRCON  CHAR(15),         ##################################################        
          4 DATENAI  DEC FIXED(7),     ##############################################        
          4 DAPERMI  DEC FIXED(5),     ##############################################        
          4 CDQUACO  CHAR(01),         ##################################################        
          4 CDSUPPL  CHAR(01),         ##################################################        
         3  DAECHCT  CHAR(04),         ##################################################        
 /*------------------------- O U T P U T -----------------------------*/        
      2   OUTPUT,                     ##############################################################        
         3  CDRTPGM     CHAR (6),      ###############################################        
         3  DBPTR       PTR,           ####################################################        
         3  LASTDLI     CHAR (10);     ##############################################        
 /*********************************************************************/        
 /*                                                                   */        
 /*   INTERFACE POUR TRAITEMENT DIVERS POUR LES DEVIS                 */        
 /*   ================================================                */        
 /*                                                                   */        
 /*  AJOUT CDTYCOL (COULEUR) INPUT_01 TDMTHO 08/12/2009 PACK VIRTUEL  */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1    JSM152,        
 /*------------------------- I N P U T -------------------------------*/        
      2   PTRPCB,                         ###############################################################        
       3  DB1PCB           PTR,           #################################################        
       3  DB2PCB           PTR,           #################################################        
      2   PARAM,                          ################################################################        
       3  OPER             CHAR(02),      ############################################        
       3  DATA             CHAR(500),     ###########################################        
 /*------------------------ O U T P U T ------------------------------*/        
      2   RETURN_CODE,                    ##########################################################        
       3  CDRTPGM          CHAR (6),      ############################################        
       3  DBPTR            PTR,           #################################################        
       3  LASTDLI          CHAR (10),     ###########################################        
      2   OUTPUT           CHAR (100);    ##########################################        
 /*-------------------------------------------------------------------*/        
 DCL 1    KEY_DEVIS,        
      2   NOIDDEV PIC'(4)9',        
      2   NOIDVER PIC'(3)9';        
 DCL KEY_DEVIS_SSA PIC'(7)9' BASED(ADDR(KEY_DEVIS));        
 /*-------------------------------------------------------------------*/        
 /*----------------------- I N P U T 00 ------------------------------*/        
 DCL 1 INPUT_00 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(07),        
      2 CDFONCS            CHAR(03),        
      2 NOIDAFF            FIXED(7),        
      2 FILLER             CHAR(486);        
 /*----------------------- I N P U T 01 ------------------------------*/        
 DCL 1 INPUT_01 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 NOIDMEM     DEC FIXED(9),        
      2 CDNATEV     CHAR(3),        
      2 NOTIERL     CHAR(3),        
      2 TBEGCOD(16) BIT(1),        
      2 LTNATEV     CHAR(40),        
      2 CDORGEV     CHAR(8),        
      2 CDMMSEL     CHAR(3),        
      2 CDUTTRN     CHAR(8),        
      2 NOMGINF     CHAR(4),        
      2 CDCMGES     CHAR(08),        
      2 CDTYCOL     CHAR(01),        
      2 FILLER      CHAR(415);        
 /*----------------------- I N P U T 02 ------------------------------*/        
 DCL 1 INPUT_02 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 CDORGMG_W   CHAR(7),        
      2 DAENTMG_W   FIXED(7),        
      2 LTNMMSG_W   CHAR(40),        
      2 CDOPTRN     CHAR(05),        
      2 TBEGCOD(16) BIT(1),        
      2 CDCMGES     CHAR(08),        
      2 NOIDAFF     FIXED DEC(7),        
      2 FILLER      CHAR(430);        
 /*----------------------- I N P U T 03 ------------------------------*/        
 DCL 1 INPUT_03 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 CDCMGES     CHAR(08),        
      2 CDTYDEV     CHAR(03),        
      2 PRODUIT     CHAR(07),        
      2 CDEVTRN     CHAR(01),        
      2 CDSCTRN     CHAR(01),        
      2 FILLER      CHAR(480);        
 /*----------------------- I N P U T 04 ------------------------------*/        
 DCL 1 INPUT_04 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 NOIDAFF            FIXED(7),        
      2 FILLER             CHAR(496);        
 /*----------------------- I N P U T 05 ------------------------------*/        
 DCL 1 INPUT_05 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(07),        
      2 CDFONCS            CHAR(03),        
      2 CDOGINT            CHAR(03),        
      2 CDCMGES            CHAR(08),        
      2 CDSTAT             CHAR(02),        
      2 NOSQSUJ            PIC'(05)9',        
      2 CDEVTRN            CHAR(01),        
      2 CDSCTRN            CHAR(01),        
      2 FILLER             CHAR(470);        
 /*----------------------- I N P U T 06 ------------------------------*/        
 DCL 1 INPUT_06 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 CDCMGES            CHAR(08),        
      2 CDOJAP             CHAR(03),        
      2 CDINTP             CHAR(03),        
      2 CDSGGES            CHAR(08),        
      2 CDOGINT            CHAR(03),        
      2 PRODUIT            CHAR(07),        
      2 CDEVTRN            CHAR(01),        
      2 CDSCTRN            CHAR(01),        
      2 FILLER             CHAR(466);        
 /*----------------------- I N P U T 07 ------------------------------*/        
 DCL 1 INPUT_07 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(07),        
      2 CDFONCS            CHAR(03),        
      2 CDOGINT            CHAR(03),        
      2 CDCMGES            CHAR(08),        
      2 CDSTAT             CHAR(02),        
      2 NOSQSUJ            PIC'(05)9',        
      2 CDEVTRN            CHAR(01),        
      2 CDSCTRN            CHAR(01),        
      2 CDNMAFI            CHAR(06),        
      2 FILLER             CHAR(464);        
 /*----------------------- I N P U T 08 ------------------------------*/        
 DCL 1 INPUT_08 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(7),        
      2 NOIDAFF            DEC FIXED(9),        
      2 NOIDDEV            CHAR(11),        
      2 FILLER             CHAR(477);        
 /*----------------------- I N P U T 09 ------------------------------*/        
 DCL 1 INPUT_09 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(07),        
      2 CDFONCS            CHAR(03),        
      2 CDCMGES            CHAR(08),        
      2 CDSTAT             CHAR(02),        
      2 CDEVTRN            CHAR(01),        
      2 CDSCTRN            CHAR(01),        
      2 CDNMAFI            CHAR(06),        
      2 FILLER             CHAR(472);        
 /*----------------------- I N P U T 10 ------------------------------*/        
 DCL 1 INPUT_10 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(07),        
      2 CDNMAFI            CHAR(06),        
      2 CDEVTRN            CHAR(01),        
      2 CDSCTRN            CHAR(01),        
      2 FILLER             CHAR(485);        
 /*----------------------- I N P U T 11 ------------------------------*/        
 DCL 1 INPUT_11 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(07),        
      2 CDFONCS            CHAR(03),        
      2 CDCMGES            CHAR(08),        
      2 CDSTAT             CHAR(02),        
      2 CDEVTRN            CHAR(01),        
      2 CDSCTRN            CHAR(01),        
      2 CDTYCAC            CHAR(07),        
      2 FILLER             CHAR(471);        
 /*----------------------- I N P U T 12 ------------------------------*/        
 DCL 1 INPUT_12 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 NOSQINT            PIC'(5)9',        
      2 NBSQSUJ            PIC'(5)9',        
      2 NOIDAFF            FIXED(7),        
      2 FILLER             CHAR(486);        
 /*----------------------- I N P U T 13 ------------------------------*/        
 DCL 1 INPUT_13 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 PRODUIT            CHAR(07),        
      2 CDNMAFI            CHAR(07),        
      2 CAS                CHAR(02),        
      2 WLM_PTR            PTR,        
      2 WLM2_PTR           PTR,        
      2 FILLER             CHAR(476);        
 DCL 1 INPUT_13_D201001 BASED(ADDR(INPUT_13.FILLER)),        
      2 NOIDAFF            FIXED(7),        
      2 CDLGTRN            PIC'9',        
      2 NBSQITE_P          PIC'(6)9',        
      2 NOIDVER            PIC'999',        
      2 FILLER             CHAR(462);        
 DCL 1 INPUT_13_IB3     BASED(ADDR(INPUT_13.FILLER)),        
      2 CDLGTRN            PIC'9',        
      2 NBSQITE_P          PIC'(6)9',        
      2 NOIDVER            PIC'999',        
      2 FILLER             CHAR(466);        
 /*----------------------- I N P U T 14 ------------------------------*/        
 DCL 1 INPUT_14 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 CDTYPRO            CHAR(07),        
      2 CDSBPRO            CHAR(07),        
      2 CDTYPOP            CHAR(01),        
      2 VALUE1             CHAR(01),        
      2 VALUE2             FIXED DEC(9),        
      2 VALUE3             FIXED DEC(7),        
      2 VALUE4(50)  FIXED DEC(3),        
      2 NOCOPY(50)  FIXED DEC(3),        
      2 SEGMENT(50) PTR,        
      2 NOIDECR            PIC'999',        
      2 CDLGTRD            CHAR(01), ############################################        
                                     /* UNIQUEMENT POUR LES DEVIS     */        
                                     /* INCENDIE ET PACKAGE !!!       */        
                                     /* EN AFFICHAGE, LANGUE VERS     */        
                                     /* LAQUELLE IL FAUT TRADUIRE     */        
                                     /* LE DEVIS POUR L'AFFICHER DANS */        
                                     /* LA LANGUE DU GESTIONNAIRE     */        
                                     /* EN INSCRIPTION, LANGUE DANS   */        
                                     /* LAQUELLE LE DEVIS EST TRANSMIS*/        
                                     /* A LA ROUTINE D'eCRITURE DU DEV*/        
                                     /* QUI SI <> 'F' DEVRA TRADUIRE  */        
                                     /* LE DEVIS EN FRANCAIS PUISQUE  */        
                                     /* LES DATA EN DB SONT TOUJOURS  */        
                                     /* REPRESENTEES AVEC LES CODES   */        
                                     /* BILINGUES EN FR               */        
      2 FCTIBDVTRD         ENTRY VARIABLE, ######################################        
                                           /* INCENDIE - APPEL SI     */        
                                           /* CDLGTRD <> ' '          */        
      2 FILLER             CHAR(063);        
 /*----------------------- I N P U T 15 ------------------------------*/        
 DCL 1 INPUT_15 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 NOIDAFF            FIXED(7),        
      2 PTR_S1AFFIL        PTR,        
      2 PTR_S1ADAFF        PTR,        
      2 FILLER             CHAR(488);        
 /*----------------------- I N P U T 16 ------------------------------*/        
 DCL 1 INPUT_16 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 CDTYPRO            CHAR(7),        
      2 CDSBPRO            CHAR(7),        
      2 NOIDAFF            FIXED(7),        
      2 NOIDDEV            CHAR(11),        
      2 FILLER             CHAR(471);        
 /*----------------------- I N P U T 17 ------------------------------*/        
 /* SI NOSQMEM REMPLI => RECTIFICATION LIGNE MEMO                     */        
 /* SEULS LES ELEMENTS NON INITIALISES A BLANCS SONT REMPLACES        */        
 /* ATTENTION TBEGCOD PAS MIS A JOUR DANS CE CAS                      */        
 /* SINON             => INSCRIPTION LIGNE MEMO IDEM QUE INPUT_01     */        
 DCL 1 INPUT_17 BASED(ADDR(JSM152.PARAM.DATA)),        
      2 NOIDMEM     DEC FIXED(9),        
      2 NOSQMEM     BIN FIXED(15),        
      2 CDNATEV     CHAR(3),        
      2 NOTIERL     CHAR(3),        
      2 TBEGCOD(16) BIT(1),        
      2 LTNATEV     CHAR(40),        
      2 CDORGEV     CHAR(8),        
      2 CDMMSEL     CHAR(3),        
      2 CDUTTRN     CHAR(8),        
      2 NOMGINF     CHAR(4),        
      2 CDCMGES     CHAR(08),        
      2 CDTYCOL     CHAR(01),        
      2 FILLER      CHAR(413);        
 /*-------------------------------------------------------------------*/        
 /*-------------------------------------------------------------------*/        
 /*-----------------------   S O R T I E -----------------------------*/        
 /*-------------------------------------------------------------------*/        
 /*-------------------------------------------------------------------*/        
 /*----------------------O U T P U T 02 ------------------------------*/        
 DCL 1 OUTPUT_02 BASED(ADDR(JSM152.OUTPUT)),        
      2 NOSQMSG            FIXED BIN(31),        
      2 FILLER             CHAR(96);        
 /*----------------------O U T P U T 04 ------------------------------*/        
 DCL 1 OUTPUT_04 BASED(ADDR(JSM152.OUTPUT)),        
      2 NOSQDEV            FIXED BIN(15),        
      2 FILLER             CHAR(98);        
 /*----------------------O U T P U T 08 ------------------------------*/        
 DCL 1 OUTPUT_08 BASED(ADDR(JSM152.OUTPUT)),        
      2 CDNMAFI            CHAR(06),        
      2 DAENTMS            DEC FIXED(15),        
      2 CDTYCAC            CHAR(07),        
      2 CDTYDEV            CHAR(02),        
      2 FILLER             CHAR(77);        
 /*----------------------O U T P U T 12 ------------------------------*/        
 DCL 1 OUTPUT_12 BASED(ADDR(JSM152.OUTPUT)),        
      2 CDOGINT            CHAR(3),        
      2 CDOJAP             CHAR(3),        
      2 CDINTP             CHAR(3),        
      2 FILLER             CHAR(91);        
 /*----------------------O U T P U T 13 ------------------------------*/        
 DCL 1 OUTPUT_13 BASED(ADDR(JSM152.OUTPUT)),        
      2 CLAUSE             CHAR(3),        
      2 FILLER             CHAR(97);        
 DCL   DAENTMS_C           CHAR (8)  BASED(ADDR(OUTPUT_08.DAENTMS));        
 /*----------------------O U T P U T 14 ------------------------------*/        
 DCL 1 OUTPUT_14 BASED(ADDR(JSM152.OUTPUT)),        
      2 NOIDVER            PIC'999',        
      2 FILLER             CHAR(97);        
 /*----------------------O U T P U T 15 ------------------------------*/        
 DCL 1 OUTPUT_15 BASED(ADDR(JSM152.OUTPUT)),        
      2 TBIDENS(14)        CHAR(07),        
      2 FILLER             CHAR(02);        
 /*----------------------O U T P U T 16 ------------------------------*/        
 DCL 1 OUTPUT_16 BASED(ADDR(JSM152.OUTPUT)),        
      2 CDPOLICE           BIT(1),        
      2 NOIDPOL            CHAR(08),        
      2 FILLER             CHAR(91);        
 /*----------------------O U T P U T 02 ------------------------------*/        
 DCL 1 OUTPUT_17 BASED(ADDR(JSM152.OUTPUT)),        
      2 NOSQMEM            BIN FIXED(15),        
      2 FILLER             CHAR(98);        
              /* Envoi message au gestionnaire */        
 DCL XSM587 ENTRY;        
         
 DCL XS1038 ENTRY;         ################################################        
 /********************************************************************/        
 /* EURO=YES AUTHOR=TDMLEM/LEMAIRE...... INTERV=TDMLEM/LEMAIRE.......*/        
 /********************************************************************/        
         
 DCL  1   JS1003,        
       2  CDRTPGM    CHAR(2),         ##################################################        
       2  NOIDAFO    CHAR(7),         ##################################################        
       2  NOIDAFN    CHAR(7);         ##################################################        
           /* TRANSF.NOIDAFF NEW->OLD */        
         
 DCL KGI011 ENTRY;            #####################################################        
 /*********************************************************************/        
 /* INTERFACE : KGI011J POUR LES METHODES DE TRAITEMENT DES DATES     */        
 /*                                                                   */        
 /*$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ */        
 /*$                  ATTENTION                                     $ */        
 /*$                  =========                                     $ */        
 /*$LA NOTION DE JOURS FERIES EST LIEE AUX JOURS FERIES BANCAIRES   $ */        
 /*$  SAUF SI TBEGCOD(1) = 1 (IL Y A QUELQUES PONTS BANCAIRES EN +) $ */        
 /*$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1 KGI011J,        
      2 INPUT        CHAR (200),    ################################################        
      2 INPUT2       CHAR (150),    ################################################        
      2 OUTPUT       CHAR (400);    ################################################        
         
 /*********************************************************************/        
 /*                                                                   */        
 /*             REDEFINITION EN INPUT                                 */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1 KGI011J_RI BASED(ADDR(KGI011J.INPUT)),        
    /* ----- FORMAT D'ENTREE OBLIGATOIRE ---- */        
    /* CHAMPS PERMETTANT LE TRAITEMENT SUIVANT LA METHODE */        
      2 CDFMTDA          CHAR (20),   ############################################        
         
      2 NBJJCAL          FIXED (05),  ###########################################        
      2 NBMMCAL          FIXED (05),  ###########################################        
      2 NBAACAL          FIXED (03),  ###########################################        
         
      2 AAPIVOT          PIC '9999',  ###########################################        
                                      /* DU SIECLE                   */        
         
      2 CDLGTRN          PIC '9',     ##############################################        
         
      2 TBEGCOD (32)     BIT (01),    #############################################        
           /* BIT  1 : 0 = UTILISATION JOUR FERIE BANCAIRE           */        
           /*          1 = UTILISATION JOUR FERIE NON BANCAIRE       */        
           /* BIT  2 : 0 = UTILISATION JOUR FERIE EN INPUT           */        
           /*          1 = UTILISATION JOUR FERIE DATE CIBLE         */        
         
      2 NBSEM_P6         PIC '(06)9', ##########################################        
         
      2 JJJJULIEN_P3     PIC '(03)9', ##########################################        
      2 AAAAJULIEN_P4    PIC '(04)9', ##########################################        
         
    /* LISTE DES FORMATS DE DATES POSSIBLE */        
      2 JJMMAA_P6        PIC '(06)9',        
      2 AAMMJJ_P6        PIC '(06)9',        
      2 SAAMMJJ_P7       PIC '(07)9',        
      2 SJJMMAA_P7       PIC '(07)9',        
      2 JJMMAAAA_P8      PIC '(08)9',        
      2 AAAAMMJJ_P8      PIC '(08)9',        
         
      2 JJMMAA_C6        CHAR (06),        
      2 AAMMJJ_C6        CHAR (06),        
      2 SAAMMJJ_C7       CHAR (07),        
      2 SJJMMAA_C7       CHAR (07),        
      2 JJMMAAAA_C8      CHAR (08),        
      2 AAAAMMJJ_C8      CHAR (08),        
         
      2 DATETIME_C17     CHAR (17),   ##################################        
         
      2 JJ_MM_AAAA_C10   CHAR (10),   ########################################        
         
      2 FILLER           CHAR (39);        
         
 DCL 1 KGI011J_RI2 BASED(ADDR(KGI011J.INPUT2)),        
    /* ----FORMAT D'ENTREE OPTIONNEL - POUR LE CALCUL ENTRE 2 DATES */        
      2 JJMMAA_P6        PIC '(06)9',        
      2 AAMMJJ_P6        PIC '(06)9',        
      2 SAAMMJJ_P7       PIC '(07)9',        
      2 SJJMMAA_P7       PIC '(07)9',        
      2 JJMMAAAA_P8      PIC '(08)9',        
      2 AAAAMMJJ_P8      PIC '(08)9',        
         
      2 JJMMAA_C6        CHAR (06),        
      2 AAMMJJ_C6        CHAR (06),        
      2 SAAMMJJ_C7       CHAR (07),        
      2 SJJMMAA_C7       CHAR (07),        
      2 JJMMAAAA_C8      CHAR (08),        
      2 AAAAMMJJ_C8      CHAR (08),        
         
      2 DATETIME_C17     CHAR (17),   ##################################        
         
      2 JJ_MM_AAAA_C10   CHAR (10),   ########################################        
         
      2 FILLER           CHAR (39);        
         
         
 /*********************************************************************/        
 /*                                                                   */        
 /*             REDEFINITION EN OUTPUT                                */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1 KGI011J_RO BASED(ADDR(KGI011J.OUTPUT)),        
    /* FORMAT DE SORTIE */        
      /* RESULTAT DU NBR JOURS OUVRABLES - NBR JOURS NON OUVRABLES   */        
      /*  ENTRE 2 DATES                                              */        
      2 NBJJOUV          PIC '(05)9', ##########################################        
      2 NBJJNOUV         PIC '(05)9', ##########################################        
         
      /* RESULT. DIFF ENTRE 2 DATES  */        
      2 NBJJJJJ          PIC '(05)9', ##########################################        
      2 NBJJRES          PIC '(02)9', ##########################################        
      2 NBMMRES          PIC '(02)9', ##########################################        
      2 NBAARES          PIC '(04)9', ##########################################        
         
      2 CDCOMPARE        CHAR (01),   ############################################        
                                      /* '2' -> DATE2 > DATE1        */        
                                      /* '=' -> DATE1 = DATE2        */        
         
      2 BOVALID_DATE     BIT (01),        
          /* '1'B : SI 'VALID_DATE_ECH' ALORS DATE1 <= DATE JOUR     */        
          /*        SI 'VALID_DATE_POST' ALORS DATE1 >= DATE JOUR    */        
          /* '0'B : SI 'VALID_DATE_ECH' ALORS DATE1 >  DATE JOUR     */        
          /*        SI 'VALID_DATE_POST' ALORS DATE1 <  DATE JOUR    */        
         
      /* FORMATAGE POUR DATE DU JOUR */        
      2 DATEHEURE_C18    CHAR (18),   ############################################        
      2 DATETIME_C17     CHAR (17),   ############################################        
      2 HEURE_F5         FIXED (05),  ###########################################        
         
      2 HHHMISS999_P10,               ########################################################        
       3 HHH             PIC '(03)9', ##################        
       3 MI              PIC '(02)9', ##################        
       3 SS              PIC '(02)9', ##################        
       3 MIL             PIC '(03)9', ##################        
         
    /* FORMAT DE SORTIE TOUJOURS ASSIGNE */        
    /* RENSEIGNEMENT SUR LA DATE EN INPUT */        
      2 CDTYPEJJ         CHAR (01),        
          /* '1' : SI LA DATE EN INPUT EST UN JOUR FERIE OU WEEK-END */        
          /* '2' : SI LA DATE EN INPUT EST UN JOUR OUVRABLE          */        
          /* '3' : SI LA DATE EN INPUT EST HORS LIMITE TABLEAU FERIE */        
         
      2 BOFINMOIS        BIT (01),    #############################################        
                                      /* '0'B SI DATE NON FIN DE MOIS*/        
         
      2 NBWEEK           PIC '(02)9', ##########################################        
      2 NOAAAA           PIC '(04)9', ##########################################        
         
    /* RENSEIGNEMENT SUR LA DATE EN OUTPUT */        
      2 JJJJULIEN_P3     PIC '(03)9', ##########################################        
      2 AAAAJULIEN_P4    PIC '(04)9', ##########################################        
         
      2 IDJOUR           PIC '(01)9', ##########################################        
                                      /* DIMANCHE = 1 - SAMEDI = 7   */        
      2 LTFILLER         CHAR (08) VAR, ########################################        
      2 LTMOIS           CHAR (09) VAR, ########################################        
      2 LTDATE           CHAR (30) VAR, ########################################        
         
      2 JJMMAA_P6        PIC '(06)9',        
      2 AAMMJJ_P6        PIC '(06)9',        
      2 SAAMMJJ_P7       PIC '(07)9',        
      2 SJJMMAA_P7       PIC '(07)9',        
      2 JJMMAAAA_P8      PIC '(08)9',        
      2 AAAAMMJJ_P8      PIC '(08)9',        
         
      2 JJMMAA_C6        CHAR (06),        
      2 AAMMJJ_C6        CHAR (06),        
      2 SAAMMJJ_C7       CHAR (07),        
      2 SJJMMAA_C7       CHAR (07),        
      2 JJMMAAAA_C8      CHAR (08),        
      2 AAAAMMJJ_C8      CHAR (08),        
         
      2 S_P1             PIC '(01)9',        
      2 JJ_P2            PIC '(02)9',        
      2 MM_P2            PIC '(02)9',        
      2 AA_P2            PIC '(02)9',        
      2 SAA_P3           PIC '(03)9',        
      2 AAAA_P4          PIC '(04)9',        
      2 JJ_MM_AA_P8      PIC '99/99/99',        
      2 JJ_MM_AAAA_P10   PIC '99/99/9999',        
         
      2 JJ_MM_AAAA_C10   CHAR (10),        #############################################        
         
      2 LTJOUR           CHAR (15) VAR, ########################################        
         
      2 FILLER           CHAR (115);        
         
         
 /********************************************************************/        
 /*                                                                  */        
 /* METHODE :                                                        */        
 /*    - VALID_DATE            : VALIDATION D'UNE DATE               */        
 /*    - VALID_DATE_ECH        : VALIDATION D'UNE DATE <= A DATE JOUR*/        
 /*    - VALID_DATE_POST       : VALIDATION D'UNE DATE >= A DATE JOUR*/        
 /*    - FORMAT_DATE           : FORMATAGE DES DATES                 */        
 /*                                                                  */        
 /*    - DIFF_2_DATES_365      : CALCUL NOMBRE DE JOURS ENTRE 2 DATES*/        
 /*                            :  SANS LES ANNEES BISSEXTILES        */        
 /*    - DIFF_2_DATES_366      : CALCUL NOMBRE DE JOURS ENTRE 2 DATES*/        
 /*                            :  AVEC LES ANNEES BISSEXTILES        */        
 /*                            :  + NBR ANNEES, NBR MOIS, NBR JOURS  */        
 /*    - DIFF_2_DATES_372      : CALCUL NOMBRE DE JOURS ENTRE 2 DATES*/        
 /*                            :  AVEC TOUS LES MOIS A 31 JOURS      */        
 /*    - DIFF_2_DATES_HEURES   : CALCUL DU NOMBRE D'HEURES, MINUTES, */        
 /*                            :  SECONDES ENTRE 2 DATES             */        
 /*                                                                  */        
 /*    - DIFF_2_DATES_OUV      : CALCUL DU NOMBRE DE JOURS OUVRABLES */        
 /*                            :  ET NON OUVRABLES ENTRE 2 DATES     */        
 /*                            :  DU LUNDI AU VENDREDI INCLUS        */        
 /*                            :  DATES LIMITES INCLUSES             */        
 /*                                                                  */        
 /*    - DIFF_2_DATES_OUV_SAM  : CALCUL DU NOMBRE DE JOURS OUVRABLES */        
 /*                            :  ET NON OUVRABLES ENTRE 2 DATES     */        
 /*                            :  DU LUNDI AU SAMEDI INCLUS          */        
 /*                            :  DATES LIMITES INCLUSES             */        
 /*                                                                  */        
 /*    - DATE_PLUS_DUREE       : AJOUT NBR JOURS/MOIS/ANNEE A 1 DATE */        
 /*    - DATE_MOINS_DUREE      : ENLEVE NBR JOURS/MOIS/ANNEE A 1 DATE*/        
 /*                                                                  */        
 /*    - DATE_DU_JOUR          : RENVOI LA DATE DU JOUR              */        
 /*                                                                  */        
 /*    - DATE_EN_JOUR_JULIEN   : CALCUL DU JOUR JULIEN SUIVANT DATE  */        
 /*    - JOUR_JULIEN_EN_DATE   : CALCUL LA DATE SUIVANT JOUR JULIEN  */        
 /*                                                                  */        
 /*    - NUMERO_SEMAINE        : CALCUL LE NUMERO DE LA SEMAINE      */        
 /*                                                                  */        
 /*    - DATE_SEMAINE          : CALCUL DU LUNDI DE LA SEMAINE       */        
 /*                            : DEMANDEE                            */        
 /*                                                                  */        
 /*    - VERIF_DATE_FIN_MOIS   : VERIFICATION D'UNE DATE FIN DE MOIS */        
 /*    - AVOIR_DATE_FIN_MOIS   : AVOIR UN DATE DE FIN DE MOIS        */        
 /*                                                                  */        
 /*    - COMPARE_DATES         : COMPARAISON ENTRE 2 DATES           */        
 /*                                                                  */        
 /*    - DATE_PLUS_JJ_OUV      : AJOUT NBR JOURS OUVRABLES A UNE DATE*/        
 /*    - DATE_MOINS_JJ_OUV     : ENLEVE NBR JOURS OUVRABLES A UNE DATE*/        
 /*                                                                  */        
 /* ATTENTION :                                                      */        
 /*    TOUTES METHODES VALIDENT LA DATE D'ENTREE                     */        
 /*    TOUTES METHODES RENVOIENT LE FORMATAGE DE LA DATE             */        
 /*         - SOIT D'ENTREE                                          */        
 /*         - SOIT DE SORTIE EN CAS DE CALCUL                        */        
 /*         - SOIT LA PREMIERE DATE D'ENTREE POUR LES COMPARAISONS   */        
 /*                                                                  */        
 /* NB :                                                             */        
 /*    LES METHODES 'DIFF_2_DATES_XXX' DONNENT COMME RESULTAT        */        
 /*    1 JOUR ENTRE LE 1 MAI ET LE 2 MAI                             */        
 /*                                                                  */        
 /********************************************************************/        
 /*                                                                  */        
 /* MESSAGE D'ERREUR (KWB001.CDRTPGM = $LTNMPRJ !! 'XXX')            */        
 /*------------------------------------------------------------------*/        
 /*                                                                  */        
 /*    001 : LA METHODE N'EXISTE PAS                                 */        
 /*    002 : LE FORMAT N'EXISTE PAS                                  */        
 /*    003 : DATE NON CONFORME                                       */        
 /*    004 : CODE INCORRECT - INTERNE AU PROGRAMME                   */        
 /*    005 : ANNEE DIFFERENTE DE 18XX, 19XX, 20XX OU 21XX            */        
 /*           (VALABLE UNIQUEMENT POUR LA DATE EN 6 POSITIONS)       */        
 /*    006 : DATE INVALIDE                                           */        
 /*    007 : NOMBRE DE JOURS INCORRECT                               */        
 /*    008 : ANNEE INCORRECTE                                        */        
 /*    009 : JOUR JULIEN INCORRECT                                   */        
 /*    010 : ANNEE NON ENCODEE DANS TABLEAU JOURS FERIES             */        
 /*    011 : DATE ENCODEE OU DATE RESULTAT EST SOIT INFERIEURE       */        
 /*           A 1800 SOIT SUPERIEURE A 2799                          */        
 /*    012 : NUMERO DE LA SEMAINE INFERIEURE A 1 OU SUPERIEURE A 53  */        
 /*    013 : PAS DE COMPARAISON ENTRE 2 DATES EN 6 POSITIONS         */        
 /*                                                                  */        
 /********************************************************************/        
         
         
 DCL KGI012 ENTRY;            #####################################################        
 /*********************************************************************/        
 /* INTERFACE : KGI012J POUR LES METHODES DE TRAITEMENT DES MONTANTS  */        
 /*********************************************************************/        
 /*********************************************************************/        
 /* ATTENTION : TDMSLE - LOGIQUE PREVUE EN FRANCAIS UNIQUEMENT        */        
 /* 06/06/2002            AU NIVEAU DU MONTANT EN LETTRE              */        
 /*********************************************************************/        
         
 DCL 1 KGI012J,        
      2 INPUT        CHAR (300),    ################################################        
      2 OUTPUT       CHAR (600);    ################################################        
         
 /*********************************************************************/        
 /*                                                                   */        
 /*             REDEFINITION EN INPUT                                 */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1 KGI012J_RI BASED(ADDR(KGI012J.INPUT)),        
    /* ----- FORMAT D'ENTREE OBLIGATOIRE ---- */        
     /* CHAMPS PERMETTANT LE TRAITEMENT SUIVANT LA METHODE */        
      2 CDFMTMT     CHAR (20),     #################################################        
      2 MTIN_F15    FIXED (15),    ################################################        
         
      2 LTIN_C25    CHAR (25) VAR, #############################################        
                                   /*  + EVENTUELLEMENT              */        
                                   /*    + LA VIRGULE                */        
                                   /*    + LA DEVISE (AVANT/APRES)   */        
                                   /*    + LE SIGNE  (AVANT/APRES)   */        
         
      2 NBDECIN     FIXED (02),    ################################################        
                                   /*  OBLIGATOIRE                   */        
         
      2 CDMSKOUT    CHAR (11),     #################################################        
                                   /*  EN SORTIE                     */        
         
      2 CDDVTRN     CHAR (03),     #################################################        
      2 CDLGTRN     PIC '9',       ###################################################        
         
      2 NBLENOUT    FIXED (03),    ################################################        
                                   /*  MAX 26 POUR LE MASQUE         */        
                                   /*  MIN 20 POUR LES LETTRES       */        
                                   /*   -> SEPARATEUR APRES 'NBLENOUT*/        
                                   /* SI =0 ALORS UTILISATION DE LA  */        
                                   /*   TAILLE NECESSAIRE            */        
         
      2 TBEGCOD (32)     BIT (01),    #############################################        
           /*   BIT  1 : VALABLE POUR LA VALIDATION ET LE FORMATAGE  */        
           /*             MAIS TOUJOURS UNE VIRGULE EN SORTIE        */        
           /*   BIT  1 : 0 = MONTANT AVEC VIRGULE COMME SEPARATEUR   */        
           /*                 DE DECIMALE                            */        
           /*            1 = MONTANT AVEC POINT OU VIRGULE           */        
           /*                 COMME SEPARATEUR DE DECIMALE           */        
           /*                                                        */        
           /*   BIT  2 : VALABLE UNIQUEMENT POUR LE FORMATAGE        */        
           /*   BIT  2 : 0 = NBDECIN = NBR DECIMALE EN ENTREE        */        
           /*                 OBLIGATOIRE                            */        
           /*            1 = NBDECIN = NBR DECIMALE EN ENTREE        */        
           /*                 MAXIMALE ENCODEE                       */        
           /*                                                        */        
           /*   BIT  3 : VALABLE UNIQUEMENT POUR LE FORMATAGE        */        
           /*   BIT  3 : 0 = VALEUR MONETAIRE SANS CHANGEMENT        */        
           /*                 MTMNT_F15 - SANS MODIF NOMBRE DECIMALE */        
           /*                 ENCODE                                 */        
           /*            1 = VALEUR MONETAIRE EN ENTIER MTMNT_F15    */        
           /*                 - AVEC MODIF NOMBRE DECIMALE ENCODE    */        
           /*                                                        */        
           /*   BIT  4 : VALABLE POUR LE FORMATAGE DES MONTANTS NULS */        
           /*             AVEC P OU B POUR LA POSITION 5             */        
           /*   BIT  4 : 0 = MONTANT NUL -> AFFICHAGE DE BLANCS      */        
           /*            1 = MONTANT NUL -> AFFICHAGE 0,XX SUIVANT   */        
           /*                 LE NOMBRE DE CHIFFRES APRES LA VIRGULE */        
           /*                                                        */        
           /*   BIT  4 : VALABLE POUR LE FORMATAGE DES MONTANTS NULS */        
           /*             AVEC Z POUR LA POSITION 5                  */        
           /*   BIT  4 : 0 = MONTANT NUL -> AFFICHAGE 0,XX SUIVANT   */        
           /*                 LE NOMBRE DE CHIFFRES APRES LA VIRGULE */        
           /*            1 = MONTANT NUL -> AFFICHAGE DE BLANCS      */        
           /*                                                        */        
           /*   BIT  5 : VALABLE ACCEPTATION MONTANT POSITIF         */        
           /*             UNIQUEMENT                                 */        
           /*   BIT  5 : 0 = MONTANT POSITIF ET NEGATIF ACCEPTE      */        
           /*            1 = MONTANT POSITIF UNIQUEMENT              */        
           /*                                                        */        
           /*   BIT  6 : VALABLE ACCEPTATION OU REFUS MONTANT        */        
           /*             NUL                                        */        
           /*   BIT  6 : 0 = MONTANT NUL ACCEPTE                     */        
           /*            1 = MONTANT NUL REFUSE                      */        
           /*                                                        */        
           /*   BIT  7 : VALABLE ACCEPTATION OU REFUS MONTANT        */        
           /*             .99 AU LIEU DE 0.99                        */        
           /*   BIT  7 : 0 = MONTANT 0.99 OBLIGATOIRE                */        
           /*            1 = MONTANT .99 ET 0.99 ACCEPTE             */        
           /*                                                        */        
           /*   BIT  8 : SUPPRESSION DU 1ER SEPARATEUR (EXTREME GCHE)*/        
           /*           QUAND DEPASSEMENT D'UN CHIFFRE (ERREUR '006')*/        
           /*           EX : 1234.567.890,12 AU LIEU DE              */        
           /*             1.234.567.890,12                           */        
           /*           MASQUE = $....12V02$                         */        
           /*          ATTENTION : UNIQUEMENT AVEC SEPARATEUR        */        
           /*   BIT  8 : 0 = MONTANT 1.234.567.890,12 ERREUR CLASSIQ.*/        
           /*            1 = MONTANT 1234.567.890,12 AUCUNE ERREUR   */        
           /*                                                        */        
         
      2 FILLER      CHAR (222);        
         
 /*********************************************************************/        
 /*                                                                   */        
 /*             REDEFINITION EN OUTPUT                                */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1 KGI012J_RO BASED(ADDR(KGI012J.OUTPUT)),        
    /* FORMAT DE SORTIE */        
      2 LTMNT_C26   CHAR (26) VAR, #############################################        
                                   /*  CADRAGE A GAUCHE SUIVANT      */        
                                   /*  LA LONG. DE 'NBLENOUT'        */        
         
      2 MTMNT_F15   FIXED (15),    ################################################        
      2 NBDECOUT    FIXED (02),    ################################################        
                                   /*  AVEC LE FIXED (15)            */        
         
      2 LTMTLET_C250 CHAR (250) VAR, ###########################################        
         
      2 FILLER      CHAR (310);        
         
         
 /********************************************************************/        
 /*                                                                  */        
 /* METHODE :                                                        */        
 /*    - VALID_MONTANT         : VALIDATION DU MONTANT               */        
 /*                                                                  */        
 /*    - FORMATAGE             : FORMATAGE SUIVANT LE MASQUE         */        
 /*                            :  (UN SEUL FORMAT PAR MASQUE EN      */        
 /*                            :   SORTIE)                           */        
 /*                                                                  */        
 /*    - CONVERT_EN_LETTRES    : CONVERSION D'UN MONTANT EN LETTRES  */        
 /*                                                                  */        
 /* ATTENTION :                                                      */        
 /*    TOUTES METHODES VALIDENT LE MONTANT EN ENTREE                 */        
 /*    TOUTES METHODES DOIVENT ALIMENTER 'NBDECIN'                   */        
 /*    UTILISATION DU CODE DEVISE VENANT DE IEU001 SI CDDVTRN NON    */        
 /*        INITIALISE                                                */        
 /*                                                                  */        
 /********************************************************************/        
 /********************************************************************/        
 /* MASQUE CDMSKOUT :                                                */        
 /*                                                                  */        
 /*    - POS 1    : $ TOUJOURS                                       */        
 /*    - POS 2    : DEVISE                                           */        
 /*                   -> G : AVEC DEVISE A GAUCHE DU MONTANT         */        
 /*                   -> D : AVEC DEVISE A DROITE DU MONTANT         */        
 /*                   -> B : SANS DEVISE                             */        
 /*    - POS 3,4  : SIGNE DEVANT OU DERRIERE LE MONTANT              */        
 /*                   -> SG : TOUJOURS LE SIGNE A GAUCHE DU MONTANT  */        
 /*                   -> SD : TOUJOURS LE SIGNE A DROITE DU MONTANT  */        
 /*                   -> -G : AFFICHE - A GAUCHE DU MONTANT SI < 0   */        
 /*                   -> -D : AFFICHE - A DROITE DU MONTANT SI < 0   */        
 /*                   -> BB : N'AFFICHE JAMAIS LE SIGNE              */        
 /*    - POS 5    : PRESENTATION DES MONTANTS POUR LES ZEROS NON     */        
 /*               :  SIGNIFICATIFS ET LES SEPARATEURS DE MILLIERS    */        
 /*                   -> Z : AFF. 0 SI MONTANT NUL - SANS SEPARATEUR */        
 /*                   -> * : AFF. * SI MONTANT NUL - SANS SEPARATEUR */        
 /*                        :  TOUJOURS SANS SIGNE FORCE SIGNE = AA   */        
 /*                   -> P : AFFICHE DES . COMME SEPARATEUR          */        
 /*                        :  TOUJOURS DES BLANCS SI MONTANT NUL     */        
 /*                   -> B : AFFICHE DES BLANCS COMME SEPARATEUR     */        
 /*                        :  TOUJOURS DES BLANCS SI MONTANT NUL     */        
 /*    - POS 6,7  : NOMBRE DE CARACTERES AVANT LA VIRGULE            */        
 /*               :  Y COMPRIS LES . OU LES ESPACES                  */        
 /*               :  MAX 19 CARACTERES - MINIMUM 1 CARACTERE         */        
 /*    - POS 8    : V TOUJOURS                                       */        
 /*    - POS 9,10 : NOMBRE DE CHIFFRES APRES LA VIRGULE (MAX (14)    */        
 /*    - POS 11   : $ TOUJOURS                                       */        
 /*                                                                  */        
 /********************************************************************/        
 /********************************************************************/        
 /*                                                                  */        
 /* MESSAGE D'ERREUR (JWB001.CDRTPGM = $LTNMPRJ !! 'XXX')            */        
 /*------------------------------------------------------------------*/        
 /*                                                                  */        
 /*    001 : LA METHODE N'EXISTE PAS                                 */        
 /*    002 : LE CODE DEVISE N'EXISTE PAS                             */        
 /*    003 : LE MASQUE INCORRECT                                     */        
 /*    004 : CODE INCORRECT - INTERNE AU PROGRAMME                   */        
 /*    005 : MONTANT INVALIDE                                        */        
 /*    006 : LA ZONE 'ENTIER' DU MASQUE EST TROP PETITE POUR         */        
 /*        :  CONTENIR LE MONTANT                                    */        
 /*    007 : LA ZONE RECEPTRICE EST TROP PETITE                      */        
 /*    008 : LA TAILLE DU MASQUE EST > A LA TAILLE DE LA VARIABLE    */        
 /*        :  DE RECEPTION                                           */        
 /*    009 : LA NOMBRE DE DECIMALE EST < A 0 OU > 14                 */        
 /*    010 : LA TAILLE DONNEE EST TROP PETITE                        */        
 /*    011 : LE CODE LANGUE DEMANDE N'EST PAS TRAITE                 */        
 /*    012 : LE NOMBRE DE DECIMALE EST TROP GRAND                    */        
 /*    013 : LE CODE FORMAT N'EXISTE PAS                             */        
 /*    014 : LE NBR DECIMALE ATTENDU NE CORRESPOND PAS AU NBR RECU   */        
 /*    015 : LE MONTANT EST NEGATIF - REFUSE                         */        
 /*    016 : LE MONTANT EST NUL - REFUSE                             */        
 /*                                                                  */        
 /********************************************************************/        
         
         
 DCL KS1005  ENTRY; ##################################################        
 /***********************************************************/        
 /* INTERFACE DU SERVICE SIGNALETIQUE AFFILIE               */        
 /*                                                         */        
 /***********************************************************/        
         
    /* LIMITE TABL.RELATIONS (RELAT)  */        
    /* LIMITE TABL.RELATIONS (CLREL)  */        
    /* LIMITE TABL.HISTORIQUES        */        
    /* LIMITE ADRESSES E-MAIL         */        
    /* LIMITE ENSEMBLES               */        
    /* LIMITE PRODUITS                */        
    /* LIMITE POLICES                 */        
    /* LIMITE DEVIS                   */        
         
 DCL 1 KS1005J,        
      2  PTRPCB,        
       3 DEU02PCB          PTR,     ###############################################        
       3 DS101PCB          PTR,     ###############################################        
       3 DS102PCB          PTR,     ###############################################        
       3 DS128PCB          PTR,     ###############################################        
       3 DS129PCB          PTR,     ###############################################        
       3 DS132PCB          PTR,     ###############################################        
       3 DS134PCB          PTR,     ###############################################        
       3 DS137PCB          PTR,     ###############################################        
 /*******************************************************************/        
      2  INPUT,        
 /*******************************************************************/        
 /*  SEGMENT AFFILIE                                                */        
 /*******************************************************************/        
       3 AFFIL_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),  /*NO!  !NUMERO D'AFFILIE          */        
        4 LTNMAFF  CHAR(30),      ##################################################        
        4 CDRSAFF  CHAR(1),       ###################################################        
        4 CDSEXAF  CHAR(1),       ###################################################        
        4 DANAIAF  DEC FIXED(10), #############################################        
        4 CDLGEAF  CHAR(1),       ###################################################        
        4 NORULOC  DEC FIXED(7),  ##############################################        
        4 NOHA1AF  BIN FIXED(15), #############################################        
        4 NOHA2AF  CHAR(4),       ###################################################        
        4 CDEGCOU  CHAR(1),       ###################################################        
        4 TBEGCOD  BIT(40),       ###################################################        
                                  /*--!  !01 : PROFESSION           */        
                                  /*--!  !02 : EXTENSION DU NOM     */        
                                  /*--!  !03 : LIEU DE NAISSANCE    */        
                                  /*--!  !04 : INSPECTEUR-CPT-FACT. */        
                                  /*--!  !05 : MOTIF DE LA MODIF.   */        
                                  /*--!  !06 : NOM CONDENSE MEMBRE  */        
                                  /*--!  !07 : NOM CONJOINT EN MEGA */        
                                  /*--!  !08 : NUMERO PIC DU CCB    */        
                                  /*--!  !09 : --- VIDE --9/11/2000 */        
                                  /*--!  !10 : TELEPHONE EMPLOYEUR  */        
                                  /*--!  !11 : NO AFFILIE AUTRE SOC */        
                                  /*--!  !12 : REFERENCE CHGT ADR.  */        
                                  /*--!  !13 : REF. DE LA M-A-J     */        
                                  /*--!  !14 : 1 PARTIE NOM DU MBRE */        
                                  /*--!  !15 : 2 PARTIE NOM DU MBRE */        
                                  /*--!  !16 : --- VIDE --9/11/2000 */        
                                  /*--!  !17 : MATRICULE CIE LGCP   */        
                                  /*--!  !18 : PRESENCE RELATIONS   */        
                                  /*--!  !19 : NO DOMICILIATION     */        
                                  /*--!  !20 :                      */        
                                  /*--!  !21 : INFOS ACCIDENTS      */        
                                  /*--!  !22 : NOM COMPTE TIERS     */        
                                  /*--!  !23 : INFO CAISSE AG       */        
                                  /*--!  !24 : QUALITE DELEGUE AG   */        
                                  /*--!  !25 : AFF.AMEL A BLANC     */        
        4 TBTYPAF  BIT(240),      ##################################################        
                                  /*--!  !VOIR DEFINITION IPS1006   */        
                                  /*--!  !01 : AFFILIE SECONDAIRE   */        
                                  /*--!  !02 : AFFILIE PRINCIPAL    */        
                                  /*--!  !03 : BILINGUE FRANCAIS    */        
                                  /*--!  !04 : BILINGUE NEERLANDAIS */        
                                  /*--!  !11 : EPOUX DE ...         */        
                                  /*--!  !12 : EPOUDE DE ...        */        
                                  /*--!  !13 : ENFANT DE ...        */        
                                  /*--!  !14 : PARENT DE ...        */        
                                  /*--!  !15 : CONCUBIN DE ...      */        
                                  /*--!  !16 : CONCUBINE DE ...     */        
                                  /*--!  !17 : DIVERS DE ...        */        
                                  /*--!  !18 : DIVERSES DE ...      */        
                                  /*--!  !29 : CLIENT A REFUSER     */        
                                  /*--!  !30 : CHGT ADRESSE EN COUR */        
                                  /*--!  !31 : VIP                  */        
                                  /*--!  !32 : VIP TRES INPORTANT   */        
                                  /*--!  !33 : PAS D'AGENDA         */        
                                  /*--!  !34 : CLIENT CCB           */        
                                  /*--!  !35 : CLIENT PASSIF        */        
                                  /*--!  !36 : MEMBRE DU PERSONNEL  */        
                                  /*--!  !37 : PAS DE MAILING       */        
                                  /*--!  !38 : CLIENT A SURVEILLER  */        
                                  /*--!  !39 : EXPERT AUTO ^AUTOMAT */        
                                  /*--!  !40 : CONVENTION DE GESTIO */        
                                  /*--!  !41 : CLIENT FICTIF        */        
                                  /*--!  !42 : MEMO                 */        
                                  /*--!  !43 : CHGT D'ADRESSE EN CO */        
                                  /*--!  !44 : AFFILIE PERIME       */        
                                  /*--!  !45 : CONTENTIEUX          */        
                                  /*--!  !46 : CLUB BLOSO           */        
                                  /*--!  !47 : MEMBRE VLB           */        
                                  /*--!  !48 : PAS DE TP INFORMEX   */        
                                  /*--!  !49 : FONCTIONNAIRE CEE    */        
                                  /*--!  !50 : A NE PAS RAPPELER    */        
                                  /*--!  !51 : ADRESSE SOPRESS      */        
                                  /*--!  !52 : CONTRAT BILINGUE     */        
                                  /*--!  !53 : AFFILIE DECEDE       */        
                                  /*--!  !54 : PRODUCTION FICTIVE   */        
                                  /*--!  !55 : GESTION PROTEGEE     */        
                                  /*--!  !56 : CLIENT CGFP          */        
                                  /*--!  !57 : CELLULE DE DISTRIBUT */        
                                  /*--!  !58 : GESTION SIN. DEDICAE */        
                                  /*--!  !60 : DOCUMENT EURO/DEFAUT */        
                                  /*--!  !61 : PROSPECT             */        
                                  /*--!  !62 : SUIVI GESTIONNAIRE   */        
                                  /*--!  !63 : MEMBRE               */        
                                  /*--!  !64 : FAUX-MEMBRE          */        
                                  /*--!  !65 : IMPOSABLE            */        
                                  /*--!  !72 : ACTIF DEFINITIF      */        
                                  /*--!  !73 : ACTIF TEMPORAIRE     */        
                                  /*--!  !74 : INACTIF              */        
                                  /*--!  !75 : RETRAITE             */        
                                  /*--!  !76 : UTILISATEUR EXTERNE  */        
                                  /*--!  !77 : FONCTIONNAIRE        */        
                                  /*--!  !78 : CTRL RSQ : W=BLOQUE  */        
                                  /*--!  !79 : CTRL RSQ : S=SURVEIL */        
                                  /*--!  !80 : SMAP-INFOS           */        
                                  /*--!  !81 : FICHE PERSONNELLE V  */        
                                  /*--!  !82 : NOUV. ADR. INCONNUE  */        
                                  /*--!  !83 : BENEFICIE DE 3 APPEL */        
                                  /*--!  !     AU CC JURIDIQUE LEGI */        
                                  /*--!  !84:FAIT PART. D'1 AFFINIT */        
                                  /*--!  !85:VIE PURE (AME)         */        
                                  /*--!  !86:ENVOI ENQUETE MIEUX... */        
                                  /*--!  !87:RETOUR ENQ. MIEUX...   */        
                                  /*--!  !88:RETOUR ENQ.MIEUX+SIGN. */        
                                  /*--!  !89 : SPONSORING (VIP)     */        
        4 NOTL1AF  DEC FIXED(3),  ##############################################        
        4 NOTL2AF  DEC FIXED(9),  ##############################################        
        4 NONATAF  DEC FIXED(11), #############################################        
        4 DADERMJ  DEC FIXED(7),  ##############################################        
        4 CDLGRUE  CHAR(1),       ###################################################        
        4 NOAF1EX  DEC FIXED(7),  ##############################################        
        4 NOAF2EX  BIN FIXED(15), #############################################        
        4 CDPOGEO  DEC FIXED(7),  ##############################################        
        4 NBFICDO  BIN FIXED(15), #############################################        
        4 FILL_01  CHAR(50),      ##################################################        
 /*****************************************************************/        
 /* SEGMENT ENTETE POLICE                                         */        
 /*****************************************************************/        
       3 POLIC_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),   /*NO!  !NUMERO D'AFFILIE          */        
 /*K*/  4 NOIDPOL  DEC FIXED(8),   /*NO!  !NO. DE POLICE             */        
        4 CDTYPOL  CHAR(2),        ####################################################        
        4 CDLGPOL  CHAR(1),        ####################################################        
        4 CDETAPO  CHAR(1),        ####################################################        
                                   /*--!  !A : ACTIVE                */        
                                   /*--!  !C : CLOTUREE / ANNULEE    */        
                                   /*--!  !P : PASSIVE / EN ATTENTE  */        
                                   /*--!  !S : SUSPENDUE/SANS SUITE  */        
        4 CDCMPRO  CHAR(1),        ####################################################        
        4 CDCMGES  CHAR(8),        ####################################################        
        4 NUSOUPO  DEC FIXED(4),   ###############################################        
                                   /*--!  !EN IE, VAUT 9999 POUR LE  */        
                                   /*--!  !NUMERO DE CI 000000       */        
        4 CDINSPO  CHAR(2),        ####################################################        
        4 CDINTAG  DEC FIXED(7),   ###############################################        
                                   /*--!  !A REMPLACER PAR CDAGINT   */        
        4 NOINTPO  CHAR(12),       ###################################################        
        4 CDMODPA  CHAR(1),        ####################################################        
        4 CDREAPO  CHAR(1),        ####################################################        
        4 CDGAGPO  CHAR(1),        ####################################################        
        4 NODERAV  DEC FIXED(3),   ###############################################        
        4 NBEXEPO  DEC FIXED(3),   ###############################################        
        4 NODOMPO  DEC FIXED(10),  ##############################################        
        4 NOCPTPO  DEC FIXED(10),  ##############################################        
        4 CDEGAPO  CHAR(1),        ####################################################        
        4 TBCDPOL(24)  BIT(1),     #################################################        
                                   /*--!  !01: POLICE COURT TERME    */        
                                   /*--!  !02: FACT MS PAR SOUS GR   */        
                                   /*--!  !03: PRESENCE AD. POLICE   */        
                                   /*--!  !04: MUTATION DE SOCIETE   */        
                                   /*--!  !       SMAP <---> MEGA    */        
                                   /*--!  !05: MS : ATTESTATION      */        
                                   /*--!  !06: BILINGUE/TRILINGUE    */        
                                   /*--!  !07: SINISTRE EN D1        */        
                                   /*--!  !08: SINISTRE EN SA        */        
                                   /*--!  !09: SINISTRE EN AC        */        
                                   /*--!  !10: MEMO POLICE           */        
                                   /*--!  !22: POLICE SOUS PACKAGE   */        
                                   /*--!  !23: POLICE PACKAGE        */        
                                   /*--!  !24: CHGT AFFILIE          */        
        4 NOIDMAT  CHAR(14),       ###################################################        
        4 NOHDRLT  BIN FIXED(15),  ##############################################        
        4 CDDVPOL  CHAR(3),        ####################################################        
        4 CDSTAPO  CHAR(1),        ####################################################        
                                   /*--!  !0: POLICE INCOMPLETE      */        
                                   /*--!  !1: PRODUCT. INDIV. OK     */        
                                   /*--!  !2: FACTURAT.INDIV. OK     */        
                                   /*--!  !3: FACTURAT.PACKAGE OK    */        
        4 CDAGINT  CHAR(6),        ####################################################        
        4 NORFEXT  CHAR(12),       ###################################################        
        4 CDTYDOC  CHAR(1),        ####################################################        
        4 FILLER  CHAR(09),        ####################################################        
        4 FILL_02  CHAR(41),       ###################################################        
 /*****************************************************************/        
 /* SEGMENT ADRESSE COURRIER PAR POLICE                           */        
 /*****************************************************************/        
       3 ADPOL_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),          /*NO!  !NUMERO D'AFFILIE    */        
 /*K*/  4 NOIDPOL  DEC FIXED(8),          /*NO!  !NO. DE POLICE       */        
 /*K*/  4 CDADPOL  CHAR(1),               /*CD!  !CODE ADRESSE        */        
        4 LTNMPOL  CHAR(30),              ####################################################        
        4 CDRSPOL  CHAR(1),               #####################################################        
        4 LTRUEPO  CHAR(30),              ####################################################        
        4 CDCPOPO  CHAR(6),               #####################################################        
        4 LTLOCPO  CHAR(25),              ####################################################        
        4 CDPAYPO  CHAR(3),               #####################################################        
        4 FILL_03  CHAR(50),              ####################################################        
 /*****************************************************************/        
 /* SEGMENT ADRESSE AFFILIE                                       */        
 /*****************************************************************/        
       3 ADAFF_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),            /*NO!  !NUMERO D'AFFILIE  */        
        4 LTRUEAF  CHAR(25),                ####################################################        
        4 CDCPOAF  CHAR(6),                 #####################################################        
        4 LTLOCAF  CHAR(25),                ####################################################        
        4 CDPAYAF  CHAR(3),                 #####################################################        
        4 FILL_04  CHAR(50),                ####################################################        
 /*****************************************************************/        
 /* SEGMENT ADRESSE COURRIER PAR AFFILIE                          */        
 /*****************************************************************/        
       3 ADCOU_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),          /*NO!  !NUMERO D'AFFILIE    */        
 /*K*/  4 CDADCOU  CHAR(1),               /*CD!  !CODE ADRESE         */        
        4 LTNMCOU  CHAR(30),              ####################################################        
        4 CDRSCOU  CHAR(1),               #####################################################        
        4 LTRUECO  CHAR(30),              ####################################################        
        4 CDCPOCO  CHAR(6),               #####################################################        
        4 LTLOCCO  CHAR(25),              ####################################################        
        4 CDPAYCO  CHAR(3),               #####################################################        
        4 FILL_05  CHAR(50),              ####################################################        
 /*****************************************************************/        
 /* SEGMENT RELATIONS ENTRE AFFILIES (DOUBLONS)                   */        
 /*****************************************************************/        
       3 RELAT_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),    /*NO!  !NUMERO D'AFFILIE          */        
        4 CDNATRE  CHAR(2),         #####################################################        
        4 NOAFFRE  DEC FIXED(7),    ################################################        
        4 FILL_06  CHAR(50),        ####################################################        
 /*****************************************************************/        
 /* SEGMENT CREATION D ENSEMBLES                                  */        
 /*****************************************************************/        
       3 ENSEM_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),    /*NO!  !NUMERO D'AFFILIE          */        
        4 TBIDENS     CHAR(7),      ##################################################        
        4 FILLER      CHAR(7),      ##################################################        
        4 FILL_07  CHAR(43),        ####################################################        
 /*****************************************************************/        
 /* SEGMENT DESTINE AUX DONNEES COMPLEMENTAIRES                   */        
 /*****************************************************************/        
       3 COMPL_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),    /*NO!  !NO. D'AFFILIE             */        
 /*K*/  4 CDTYINF  CHAR(2),         /*CD!  !CODIF. TYPE D'INFORAMTION */        
        4 LTNMINF  CHAR(30),        ####################################################        
        4 FILL_08  CHAR(50),        ####################################################        
 /*****************************************************************/        
 /* SEGMENT HISTORIQUE AFFILIE                                    */        
 /*****************************************************************/        
       3 HISAF_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),      /*NO!  !NO. D'AFFILIE           */        
 /*K*/  4 NOSQAFF  BIN FIXED(15),     /*NO!  !NO. DE SEQUENCE AFFILIE */        
        4 NBSQAFF  BIN FIXED(15),     ###############################################        
        4 CDCMGES  CHAR(8),           #####################################################        
        4 DAMAJAF  DEC FIXED(7),      ################################################        
        4 HHMAJAF  DEC FIXED(7),      ################################################        
        4 NOIDTER  CHAR(8),           #####################################################        
        4 LTNMAFF  CHAR(30),          ####################################################        
        4 LTEXTNM  CHAR(30),          ####################################################        
        4 CDRSAFF  CHAR(1),           #####################################################        
        4 CDSEXAF  CHAR(1),           #####################################################        
        4 CDLGEAF  CHAR(1),           #####################################################        
        4 DANAIAF  DEC FIXED(10),     ###############################################        
        4 LTNMCDS  CHAR(21),          ####################################################        
        4 LTRUEAF  CHAR(25),          ####################################################        
        4 CDCPOAF  CHAR(6),           #####################################################        
        4 LTLOCAF  CHAR(25),          ####################################################        
        4 CDPAYAF  CHAR(3),           #####################################################        
        4 LTLINAI  CHAR(30),          ####################################################        
        4 LTPROAF  CHAR(30),          ####################################################        
        4 NOTL1AF  DEC FIXED(3),      ################################################        
        4 NOTL2AF  DEC FIXED(9),      ################################################        
        4 NOTLBUR  CHAR(16),          ####################################################        
        4 NBFACAF  PIC'9',            ######################################################        
        4 CDINSAF  CHAR(2),           #####################################################        
        4 NOCPTAF  PIC'(12)9',        ##################################################        
        4 LTCOMAF  CHAR(30),          ####################################################        
        4 LTNMCOU  CHAR(30),          ####################################################        
        4 CDRSCOU  CHAR(1),           #####################################################        
        4 LTRUECO  CHAR(30),          ####################################################        
        4 CDCPOCO  CHAR(6),           #####################################################        
        4 LTLOCCO  CHAR(25),          ####################################################        
        4 CDPAYCO  CHAR(3),           #####################################################        
        4 LTNM1MB  CHAR(30),          ####################################################        
        4 LTNM2MB  CHAR(30),          ####################################################        
        4 NOHA1AF  BIN FIXED(15),     ###############################################        
        4 NOHA2AF  CHAR(4),           #####################################################        
        4 NOFA1AF  DEC FIXED(3),      ################################################        
        4 NOFA2AF  DEC FIXED(9),      ################################################        
        4 CDCHAL1  CHAR(2),           #####################################################        
        4 CDETCIV  CHAR(2),           #####################################################        
        4 CDORGAF  CHAR(2),           #####################################################        
        4 CDRCTAF  CHAR(2),           #####################################################        
        4 NOGSMAF  CHAR(15),          ####################################################        
        4 DADECAF  DEC FIXED(7),      ################################################        
        4 CDNATAF  CHAR(3),           #####################################################        
        4 RSVHIST  CHAR(93),          ####################################################        
        4 FILL_09  CHAR(50),          ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE ACTIVITES                                */        
 /*****************************************************************/        
       3 CLACT_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),        /*NO!  !IDENTIFICATION CLIENT */        
        4 TBEGCOD(16)  BIT(1),          ##################################################        
        4 FILL_10  CHAR(50),            ####################################################        
 /*****************************************************************/        
 /* SEGMENT ACTIVITES PROFESSIONELLES                             */        
 /*****************************************************************/        
       3 CLPRO_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),        /*NO!  !IDENTIFICATION CLIENT */        
 /*K*/  4 DAEFPRO  DEC FIXED(7),        /*DC!  !DA. EFF. COMPL.    */        
        4 NOSQRUE  BIN FIXED(15),       ############################################        
        4 CDTYPRO  CHAR(2),             ##################################################        
        4 CDTYEMP  CHAR(2),             ##################################################        
        4 CDPOEMP  CHAR(4),             ##################################################        
        4 LOPOEMP  CHAR(20),            #################################################        
        4 TXDETVA  DEC FIXED(3),        #############################################        
        4 NUDETVA  CHAR(9),             ##################################################        
        4 LTCMPRO  CHAR(40),            #################################################        
        4 LTCMEMP  CHAR(40),            #################################################        
        4 CDHANDI  CHAR(1),             ##################################################        
        4 CDRETVA  CHAR(1),             ##################################################        
        4 CDASTVA  CHAR(1),             ##################################################        
        4 CDTRANS  CHAR(1),             ##################################################        
        4 TBEGCOD(16)  BIT(1),          ###############################################        
                                       /*--!  !01:SECTEUR PRIVE   */        
                                       /*--!  !02:SECTEUR PUBLIC  */        
                                       /*--!  !03:SECT.ASSOCIATIF */        
        4 CDFONCT  CHAR(1),             ##################################################        
        4 CDGEPRO  CHAR(2),             ##################################################        
        4 CDGEEMP  CHAR(2),             ##################################################        
        4 CDTAENT  CHAR(2),             ##################################################        
        4 FILL_11  CHAR(50),            #################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE ACTIVITES COMPLEMENTAIRES                */        
 /*****************************************************************/        
       3 CLACC_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),        /*NO!  !IDENTIFICATION CLIENT */        
 /*K*/  4 NOSQACC  BIN FIXED(15),       /*SQ!  !NO DE SEQUENCE      */        
        4 CDTYACC  CHAR(2),             ###################################################        
        4 LTCMACC  CHAR(40),            ##################################################        
        4 TBEGCOD(16)  BIT(1),          ################################################        
        4 CDTYASC  CHAR(2),             ###################################################        
        4 LTLIACC  CHAR(30),            ##################################################        
        4 FILL_12  CHAR(50),            #################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES CONTACTS                             */        
 /*****************************************************************/        
       3 CLCON_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),        /*NO!  !IDENTIFICATION CLIENT */        
        4 TBEGCOD(16)  BIT(1),          ##################################################        
        4 FILL_13  CHAR(50),            #################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES ADRESSES                             */        
 /*****************************************************************/        
       3 CLADR_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),      /*NO!  !IDENTIFICATION CLIENT   */        
 /*K*/  4 CDTYADR  CHAR(2),           /*CD!  !CODE TYPE ADRESSE       */        
 /*K*/  4 DAEFPRO  DEC FIXED(7),      /*DC!  !DATE EFFEF COMPLEMENTEE */        
        4 LTADNO1  CHAR(30),          ####################################################        
        4 LTADNO2  CHAR(30),          ####################################################        
        4 CDADRSO  CHAR(3),           #####################################################        
        4 LTADADR  CHAR(30),          ####################################################        
        4 NOADCPO  CHAR(5),           #####################################################        
        4 NOADBTE  CHAR(5),           #####################################################        
        4 CDADCPO  CHAR(6),           #####################################################        
        4 LOADLOC  CHAR(20),          ####################################################        
        4 CDADPAY  CHAR(3),           #####################################################        
        4 NUADTEL  CHAR(15),          ####################################################        
        4 NUADFAX  CHAR(15),          ####################################################        
        4 TBEGCOD(16)  BIT(1),        ##################################################        
        4 NOCPLPR  CHAR(10),          ####################################################        
        4 FILL_14  CHAR(50),          ###############################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE COMPLEMENT D ADRESSE                     */        
 /*****************************************************************/        
       3 CLCPL_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),      /*NO!  !IDENTIFICATION CLIENT   */        
 /*K*/  4 CDTYADR  CHAR(2),           /*CD!  !CODE TYPE ADRESSE       */        
 /*K*/  4 DAEFPRO  DEC FIXED(7),      /*DC!  !DATE EFFEF COMPLEMENTEE */        
        4 CDTYACC  CHAR(2),           #####################################################        
        4 LTCLCPL  CHAR(30),          ####################################################        
        4 TBEGCOD(16)  BIT(1),        ##################################################        
        4 FILL_15  CHAR(50),          ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES CONTACTS PRIVILEGIES                 */        
 /*****************************************************************/        
       3 CLCOP_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),      /*NO!  !IDENTIFICATION CLIENT   */        
        4 NOIDAFF(10)  CHAR(6),       #################################################        
        4 TBEGCOD(16)  BIT(1),        ##################################################        
        4 FILL_16  CHAR(50),          ####################################################        
 /*****************************************************************/        
 /* SEGMENT COMPLEMENT SIGNALETIQUE                               */        
 /*****************************************************************/        
       3 CLCOM_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),     /*NO!  !IDENTIFICATION CLIENT    */        
        4 DADECAF  DEC FIXED(7),     ################################################        
        4 DAPERMI  DEC FIXED(7),     ################################################        
        4 TBNBCTC(5),        
         5 CDTYCTC  CHAR(2),         ####################################################        
         5 NBCONTR  DEC FIXED(7),    ###############################################        
        4 NBENFAN  BIN FIXED(15),    ###############################################        
        4 NBENFHA  BIN FIXED(15),    ###############################################        
        4 NBAUTCH  BIN FIXED(15),    ###############################################        
        4 NOID_CI  DEC FIXED(7),     ################################################        
        4 DACIDEN  DEC FIXED(7),     ################################################        
        4 DAENVAG  DEC FIXED(7),     ################################################        
        4 NBENVAG  DEC FIXED(3),     ################################################        
        4 TBEGCOD(16)  BIT(1),       ##################################################        
                                     /*--!  !01 CD CHEF DE MENA.:'Y'  */        
                                     /*--!  !02 CD CHEF DE MENA.:'N'  */        
                                     /*--!  !03 CD MDP : ENVOI CLIENT */        
                                     /*--!  !04 CD ACC. INFOS NET     */        
        4 NOPERMI  CHAR(10),         ####################################################        
        4 CDLGSEC  CHAR(1),          #####################################################        
        4 CDORAFF  CHAR(2),          #####################################################        
        4 CDNATCL  CHAR(3),          #####################################################        
        4 LTPRECL  CHAR(15),         ####################################################        
        4 NUGSMCL  CHAR(15),         ####################################################        
        4 NOSEQUI  CHAR(3),          ####################################################        
                                     /*--!  !GENERE ALEATOIREMENT    */        
        4 CDGSTAM  CHAR(1),          ####################################################        
                                     /*--!  !VAL. POSS : I/R/S/BLANC */        
                                     /*--!  !I : ISRT 1ERE DEM DE MDP*/        
                                     /*--!  !R : NEW MDP-GARDE USERID*/        
                                     /*--!  !S : SUP MDP POUR USERID */        
        4 CDGSPWD  CHAR(1),          ####################################################        
                                     /*--!  !EMPECHE LA DEM. DE PLS  */        
                                     /*--!  !MDP SIMULTANEMENT       */        
                                     /*--!  !VAL. POSS : E/U/P/BLANC */        
                                     /*--!  !E : DMD DE MDP EN COURS */        
                                     /*--!  !U : USERID EXPEDIE      */        
                                     /*--!  !P : MDP EXPEDIE         */        
        4 CDORIDE  CHAR(1),          #####################################################        
                                     /*--!  !VAL. POSS : ALPHANUM.    */        
                                     /*--!  !A: ASSURANCE             */        
                                     /*--!  !B: BANQUE                */        
        4 CDWOCK1  CHAR(1),          #####################################################        
        4 CDWOCK2  CHAR(1),          #####################################################        
        4 CDETCIV  CHAR(2),          #####################################################        
        4 CDCHAL1  CHAR(2),          #####################################################        
        4 CDCHAL2  CHAR(3),          #####################################################        
        4 CDMAJCL  CHAR(2),          #####################################################        
        4 LTMAJCL  CHAR(30),         ####################################################        
        4 AFFINIT(5),        
         5 CDAFIN1  CHAR(2),         ####################################################        
         5 CDAFIN2  CHAR(15),        ###################################################        
         5 CDFAMIL  CHAR(1),         ####################################################        
        4 CDCIDEN  CHAR(1),          #####################################################        
        4 DADERMS  PIC'(7)9',        ###################################################        
        4 NBCONMS  PIC'(5)9',        ###################################################        
        4 DAEXPCI  PIC'(7)9',        ###################################################        
        4 DAABNWL  PIC'(7)9',        ###################################################        
        4 CDSTACI  CHAR(1),          #####################################################        
        4 DASTACI  PIC'(07)9',       ##################################################        
        4 NOBCEAF  CHAR(10),         ####################################################        
        4 CDCTF2F  CHAR(1),          #####################################################        
        4 CDPEP    CHAR(1),          #####################################################        
        4 CDCOMMEN CHAR(1),          #####################################################        
        4 CDPTIENF CHAR(1),          #####################################################        
        4 CDEINVO  CHAR(1),          #####################################################        
        4 FILL_16  CHAR(49),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES RELATIONS                            */        
 /*****************************************************************/        
       3 CLREL_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),     /*NO!  !IDENTIFICATION CLIENT    */        
 /*K*/  4 NOSEQRE  BIN FIXED(15),    /*SQ!  !NUM. DE SEQUENCE         */        
        4 NOIDREL  CHAR(2),          #####################################################        
        4 CDTYREL  CHAR(1),          #####################################################        
        4 NOCLREL  DEC FIXED(7),     ################################################        
        4 TBEGCOD(16)  BIT(1),       ##################################################        
        4 REC_VOTE  CHAR(27),        ###################################################        
        4 DAASSEM  DEC FIXED(7),     ################################################        
        4 FILL_17  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT AUTRES PRENOMS                                        */        
 /*****************************************************************/        
       3 CLPRE_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),     /*NO!  !IDENTIFICATION CLIENT    */        
        4 LTPRCL1  CHAR(15),         ####################################################        
        4 LTPRCL2  CHAR(15),         ####################################################        
        4 TBEGCOD(16)  BIT(1),       ##################################################        
        4 FILL_18  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE ADRESSE E-MAIL                           */        
 /*****************************************************************/        
       3 CLEML_I,        
 /*K*/  4 NOIDCLI  DEC FIXED(9),     /*NO!  !IDENTIFICATION CLIENT    */        
        4 DAADEML  DEC FIXED(7),     ################################################        
        4 TBEGCOD(16)  BIT(1),       ##################################################        
                                     /*--!  !1 - ADRESSE INACTIVE     */        
        4 LTADEML  CHAR(50),         ####################################################        
        4 LTORIGI  CHAR(10),         ####################################################        
        4 CDPREML  CHAR(1),          #####################################################        
        4 FILL_19  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DEVIS                                    */        
 /*****************************************************************/        
       3 CLDEV_I,        
        4 NOIDCLI  DEC FIXED(9),    ##############################################        
        4 DADVINT  DEC FIXED(11),   #############################################        
        4 NODVINT  DEC FIXED(13),   #############################################        
        4 CDIDINT  DEC FIXED(9),    ##############################################        
        4 HHMMINT  DEC FIXED(5),    ##############################################        
        4 TBEGCOD(16)  BIT(1),      ################################################        
                                    /*--!  ! 1 - AFFICHABLE MYSMAP  */        
                                    /*--!  ! 2 - DELETE MYSMAP      */        
                                    /*--!  ! 3 - SAVE CRM PUR       */        
                                    /*--!  ! 4 - REMPLACE           */        
        4 CDTYPDV  CHAR(2),         ###################################################        
        4 CDORIDV  CHAR(2),         ###################################################        
        4 CDTYPRO  CHAR(7),         ###################################################        
        4 FILL_20  CHAR(50),        ###################################################        
 /*****************************************************************/        
 /* SEGMENT PRODUIT CLIENT                                        */        
 /*****************************************************************/        
       3 PROCL_I,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),     /*NO!  !NO D'AFFILIE             */        
 /*K*/  4 NOIDPOL  DEC FIXED(9),     /*NO!  !NO. DE POLICE            */        
        4 NOIDPAC  DEC FIXED(9),     ################################################        
        4 CDTYPOL  CHAR(2),          #####################################################        
        4 CDIDPRD  CHAR(8),          #####################################################        
        4 CDIDGES  CHAR(8),          #####################################################        
        4 CDCMPRO  CHAR(1),          #####################################################        
                                     /*--!  ! 1: LIEGE                */        
                                     /*--!  ! 2  HASSELT              */        
                                     /*--!  ! 3: BRUXELLES            */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDEGPOL  CHAR(1),          #####################################################        
                                     /*--!  ! A: ACTIF                */        
                                     /*--!  ! C: CLOTURE              */        
                                     /*--!  ! P: PASSIF               */        
                                     /*--!  ! S: SUSPENDU             */        
                                     /*--!  ! D: DEVIS/PROJET         */        
                                     /*--!  ! O: OFFRE                */        
                                     /*--!  ! ?: INCONNU              */        
        4 CDCATPO  CHAR(11),         ####################################################        
        4 CDOCAAR  CHAR(4),          #####################################################        
        4 CDOCADP  CHAR(4),          #####################################################        
        4 CDMOTDP  CHAR(2),          #####################################################        
        4 CDGRPAF  CHAR(7),          #####################################################        
        4 CDFRAPO  CHAR(1),          #####################################################        
        4 CDPREML  CHAR(1),          #####################################################        
                                     /*--!  ! S: SEMESTRIEL           */        
                                     /*--!  ! M: MENSUEL              */        
                                     /*--!  ! Q: QUADRIMESTRIEL       */        
                                     /*--!  ! T: TRIMESTRIEL          */        
                                     /*--!  ! B: BIMESTRIEL           */        
                                     /*--!  ! U: UNIQUE               */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDFRFRA  CHAR(1),          #####################################################        
                                     /*--!  ! Y: YES                  */        
                                     /*--!  ! N: NO                   */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDADPOL  CHAR(1),          #####################################################        
                                     /*--!  ! Y: YES                  */        
                                     /*--!  ! N: NO                   */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDDVPOL  CHAR(3),          #####################################################        
                                     /*--!  ! BEF                     */        
                                     /*--!  ! EUR                     */        
        4 CDCLAPO  CHAR(1),          #####################################################        
                                     /*--!  ! G: GROUPE               */        
                                     /*--!  ! I: INDIVIDUELLE         */        
                                     /*--!  ! ^: INCONNU              */        
        4 NOCPTPO  CHAR(12),         ####################################################        
        4 NODOMPO  CHAR(12),         ####################################################        
        4 NBRAPPO  PIC'9',           ######################################################        
        4 NBSINAC  DEC FIXED(7),     ################################################        
        4 DACMPSI  DEC FIXED(7),     ################################################        
        4 DAEFFPO  DEC FIXED(7),     ################################################        
        4 DAEXPPO  DEC FIXED(7),     ################################################        
        4 DAECHPO  DEC FIXED(4),     ################################################        
        4 PRTRMBA  DEC FIXED(15),    ###############################################        
        4 PRTRMTO  DEC FIXED(15),    ###############################################        
        4 LTINFCP  CHAR(220),        ###################################################        
        4 FILL_21  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES RELATIONS ENTRE LES CLIENTS */        
 /* (RELAT)                                                       */        
 /*****************************************************************/        
       3 EXPLORLA_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
        4 NOIDAFF    PIC '(9)9',     ################################################        
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES RELATIONS ENTRE LES CLIENTS */        
 /* (CLREL)                                                       */        
 /*****************************************************************/        
       3 EXPLOREL_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
        4 NOIDCLI  DEC FIXED(9),     ################################################        
        4 NOSEQRE  BIN FIXED(15),    ###############################################        
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES HISTORIQUES DE SIGNALETIQUE */        
 /*                                                               */        
 /*****************************************************************/        
       3 EXPLOHIS_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
        4 NOIDAFF  DEC FIXED(7),      ################################################        
        4 NOSQAFF  BIN FIXED(15),     ###############################################        
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES ADRESSES E-MAIL             */        
 /*                                                               */        
 /*****************************************************************/        
       3 EXPLOEML_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
        4 NOIDCLI  DEC FIXED(9),     ################################################        
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES ENSEMBLES                   */        
 /*                                                               */        
 /*****************************************************************/        
       3 EXPLOENS_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
        4 NOIDAFF  DEC FIXED(7),      ################################################        
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES POLICES                     */        
 /*                                                               */        
 /*****************************************************************/        
       3 EXPLOPOL_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
        4 NOIDAFF  DEC FIXED(7),      ################################################        
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES PRODUITS CLIENTS            */        
 /*                                                               */        
 /*****************************************************************/        
       3 EXPLOPRO_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
        4 NOIDAFF  DEC FIXED(7),      ################################################        
        4 NOIDPOL  DEC FIXED(9),      ################################################        
         
 /*****************************************************************/        
 /* <<< CRITERES POUR EXPLORATION DES DEVIS INTERNET              */        
 /*                                                               */        
 /*****************************************************************/        
       3 EXPLODEV_I,                 ############################################################        
        4 NBITEXP    BIN FIXED(15),  #############################################        
 /*K*/  4 NOIDCLI  DEC FIXED(9),     /*NO!  !IDENTIFICATION CLIENT    */        
        4 DADVINT  DEC FIXED(11),   #############################################        
        4 NODVINT  DEC FIXED(13),   #############################################        
        4 CDIDINT  DEC FIXED(9),    ##############################################        
        4 HHMMINT  DEC FIXED(5),    ##############################################        
        4 TBEGCOD(16)  BIT(1),      ################################################        
                                    /*--!  ! 1 - AFFICHABLE MYSMAP  */        
                                    /*--!  ! 2 - DELETE MYSMAP      */        
                                    /*--!  ! 3 - SAVE CRM PUR       */        
        4 CDTYPDV  CHAR(2),         ###################################################        
        4 CDORIDV  CHAR(2),         ###################################################        
         
 /*****************************************************************/        
      2 OUTPUT,        
 /*******************************************************************/        
 /*  SEGMENT AFFILIE                                                */        
 /*******************************************************************/        
       3 AFFIL_O,        
        4 NOIDAFF  DEC FIXED(7),  ##############################################        
        4 LTNMAFF  CHAR(30),      ##################################################        
        4 CDRSAFF  CHAR(1),       ###################################################        
        4 CDSEXAF  CHAR(1),       ###################################################        
        4 DANAIAF  DEC FIXED(10), #############################################        
        4 CDLGEAF  CHAR(1),       ###################################################        
        4 NORULOC  DEC FIXED(7),  ##############################################        
        4 NOHA1AF  BIN FIXED(15), #############################################        
        4 NOHA2AF  CHAR(4),       ###################################################        
        4 CDEGCOU  CHAR(1),       ###################################################        
        4 TBEGCOD  BIT(40),       ###################################################        
                                  /*--!  !01 : PROFESSION           */        
                                  /*--!  !02 : EXTENSION DU NOM     */        
                                  /*--!  !03 : LIEU DE NAISSANCE    */        
                                  /*--!  !04 : INSPECTEUR-CPT-FACT. */        
                                  /*--!  !05 : MOTIF DE LA MODIF.   */        
                                  /*--!  !06 : NOM CONDENSE MEMBRE  */        
                                  /*--!  !07 : NOM CONJOINT EN MEGA */        
                                  /*--!  !08 : NUMERO PIC DU CCB    */        
                                  /*--!  !09 : --- VIDE --9/11/2000 */        
                                  /*--!  !10 : TELEPHONE EMPLOYEUR  */        
                                  /*--!  !11 : NO AFFILIE AUTRE SOC */        
                                  /*--!  !12 : REFERENCE CHGT ADR.  */        
                                  /*--!  !13 : REF. DE LA M-A-J     */        
                                  /*--!  !14 : 1 PARTIE NOM DU MBRE */        
                                  /*--!  !15 : 2 PARTIE NOM DU MBRE */        
                                  /*--!  !16 : --- VIDE --9/11/2000 */        
                                  /*--!  !17 : MATRICULE CIE LGCP   */        
                                  /*--!  !18 : PRESENCE RELATIONS   */        
                                  /*--!  !19 : NO DOMICILIATION     */        
                                  /*--!  !20 :                      */        
                                  /*--!  !21 : INFOS ACCIDENTS      */        
                                  /*--!  !22 : NOM COMPTE TIERS     */        
                                  /*--!  !23 : INFO CAISSE AG       */        
                                  /*--!  !24 : QUALITE DELEGUE AG   */        
                                  /*--!  !25 : AFF.AMEL A BLANC     */        
        4 TBTYPAF  BIT(240),      ##################################################        
                                  /*--!  !VOIR DEFINITION IPS1006   */        
                                  /*--!  !01 : AFFILIE SECONDAIRE   */        
                                  /*--!  !02 : AFFILIE PRINCIPAL    */        
                                  /*--!  !03 : BILINGUE FRANCAIS    */        
                                  /*--!  !04 : BILINGUE NEERLANDAIS */        
                                  /*--!  !11 : EPOUX DE ...         */        
                                  /*--!  !12 : EPOUDE DE ...        */        
                                  /*--!  !13 : ENFANT DE ...        */        
                                  /*--!  !14 : PARENT DE ...        */        
                                  /*--!  !15 : CONCUBIN DE ...      */        
                                  /*--!  !16 : CONCUBINE DE ...     */        
                                  /*--!  !17 : DIVERS DE ...        */        
                                  /*--!  !18 : DIVERSES DE ...      */        
                                  /*--!  !29 : CLIENT A REFUSER     */        
                                  /*--!  !30 : CHGT ADRESSE EN COUR */        
                                  /*--!  !31 : VIP                  */        
                                  /*--!  !32 : VIP TRES INPORTANT   */        
                                  /*--!  !33 : PAS D'AGENDA         */        
                                  /*--!  !34 : CLIENT CCB           */        
                                  /*--!  !35 : CLIENT PASSIF        */        
                                  /*--!  !36 : MEMBRE DU PERSONNEL  */        
                                  /*--!  !37 : PAS DE MAILING       */        
                                  /*--!  !38 : CLIENT A SURVEILLER  */        
                                  /*--!  !39 : EXPERT AUTO ^AUTOMAT */        
                                  /*--!  !40 : CONVENTION DE GESTIO */        
                                  /*--!  !41 : CLIENT FICTIF        */        
                                  /*--!  !42 : MEMO                 */        
                                  /*--!  !43 : CHGT D'ADRESSE EN CO */        
                                  /*--!  !44 : AFFILIE PERIME       */        
                                  /*--!  !45 : CONTENTIEUX          */        
                                  /*--!  !46 : CLUB BLOSO           */        
                                  /*--!  !47 : MEMBRE VLB           */        
                                  /*--!  !48 : PAS DE TP INFORMEX   */        
                                  /*--!  !49 : FONCTIONNAIRE CEE    */        
                                  /*--!  !50 : A NE PAS RAPPELER    */        
                                  /*--!  !51 : ADRESSE SOPRESS      */        
                                  /*--!  !52 : CONTRAT BILINGUE     */        
                                  /*--!  !53 : AFFILIE DECEDE       */        
                                  /*--!  !54 : PRODUCTION FICTIVE   */        
                                  /*--!  !55 : GESTION PROTEGEE     */        
                                  /*--!  !56 : CLIENT CGFP          */        
                                  /*--!  !57 : CELLULE DE DISTRIBUT */        
                                  /*--!  !58 : GESTION SIN. DEDICAE */        
                                  /*--!  !60 : DOCUMENT EURO/DEFAUT */        
                                  /*--!  !61 : PROSPECT             */        
                                  /*--!  !62 : SUIVI GESTIONNAIRE   */        
                                  /*--!  !63 : MEMBRE               */        
                                  /*--!  !64 : FAUX-MEMBRE          */        
                                  /*--!  !65 : IMPOSABLE            */        
                                  /*--!  !72 : ACTIF DEFINITIF      */        
                                  /*--!  !73 : ACTIF TEMPORAIRE     */        
                                  /*--!  !74 : INACTIF              */        
                                  /*--!  !75 : RETRAITE             */        
                                  /*--!  !76 : UTILISATEUR EXTERNE  */        
                                  /*--!  !77 : FONCTIONNAIRE        */        
                                  /*--!  !78 : CTRL RSQ : W=BLOQUE  */        
                                  /*--!  !79 : CTRL RSQ : S=SURVEIL */        
                                  /*--!  !80 : SMAP-INFOS           */        
                                  /*--!  !81 : FICHE PERSONNELLE V  */        
                                  /*--!  !82 : NOUV. ADR. INCONNUE  */        
                                  /*--!  !83 : BENEFICIE DE 3 APPEL */        
                                  /*--!  !     AU CC JURIDIQUE LEGI */        
                                  /*--!  !84:FAIT PART. D'1 AFFINIT */        
                                  /*--!  !85:VIE PURE (AME)         */        
                                  /*--!  !86:ENVOI ENQUETE MIEUX... */        
                                  /*--!  !87:RETOUR ENQ. MIEUX...   */        
                                  /*--!  !88:RETOUR ENQ.MIEUX+SIGN. */        
                                  /*--!  !89 : SPONSORING (VIP)     */        
        4 NOTL1AF  DEC FIXED(3),  ##############################################        
        4 NOTL2AF  DEC FIXED(9),  ##############################################        
        4 NONATAF  DEC FIXED(11), #############################################        
        4 DADERMJ  DEC FIXED(7),  ##############################################        
        4 CDLGRUE  CHAR(1),       ###################################################        
        4 NOAF1EX  DEC FIXED(7),  ##############################################        
        4 NOAF2EX  BIN FIXED(15), #############################################        
        4 CDPOGEO  DEC FIXED(7),  ##############################################        
        4 NBFICDO  BIN FIXED(15), #############################################        
        4 FILL_22  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT ENTETE POLICE                                         */        
 /*****************************************************************/        
       3 POLIC_O,        
        4 NOIDPOL  DEC FIXED(8),   ###############################################        
        4 CDTYPOL  CHAR(2),        ####################################################        
        4 CDLGPOL  CHAR(1),        ####################################################        
        4 CDETAPO  CHAR(1),        ####################################################        
                                   /*--!  !A : ACTIVE                */        
                                   /*--!  !C : CLOTUREE / ANNULEE    */        
                                   /*--!  !P : PASSIVE / EN ATTENTE  */        
                                   /*--!  !S : SUSPENDUE/SANS SUITE  */        
        4 CDCMPRO  CHAR(1),        ####################################################        
        4 CDCMGES  CHAR(8),        ####################################################        
        4 NUSOUPO  DEC FIXED(4),   ###############################################        
                                   /*--!  !EN IE, VAUT 9999 POUR LE  */        
                                   /*--!  !NUMERO DE CI 000000       */        
        4 CDINSPO  CHAR(2),        ####################################################        
        4 CDINTAG  DEC FIXED(7),   ###############################################        
                                   /*--!  !A REMPLACER PAR CDAGINT   */        
        4 NOINTPO  CHAR(12),       ###################################################        
        4 CDMODPA  CHAR(1),        ####################################################        
        4 CDREAPO  CHAR(1),        ####################################################        
        4 CDGAGPO  CHAR(1),        ####################################################        
        4 NODERAV  DEC FIXED(3),   ###############################################        
        4 NBEXEPO  DEC FIXED(3),   ###############################################        
        4 NODOMPO  DEC FIXED(10),  ##############################################        
        4 NOCPTPO  DEC FIXED(10),  ##############################################        
        4 CDEGAPO  CHAR(1),        ####################################################        
        4 TBCDPOL(24)  BIT(1),     #################################################        
                                   /*--!  !01: POLICE COURT TERME    */        
                                   /*--!  !02: FACT MS PAR SOUS GR   */        
                                   /*--!  !03: PRESENCE AD. POLICE   */        
                                   /*--!  !04: MUTATION DE SOCIETE   */        
                                   /*--!  !       SMAP <---> MEGA    */        
                                   /*--!  !05: MS : ATTESTATION      */        
                                   /*--!  !06: BILINGUE/TRILINGUE    */        
                                   /*--!  !07: SINISTRE EN D1        */        
                                   /*--!  !08: SINISTRE EN SA        */        
                                   /*--!  !09: SINISTRE EN AC        */        
                                   /*--!  !10: MEMO POLICE           */        
                                   /*--!  !22: POLICE SOUS PACKAGE   */        
                                   /*--!  !23: POLICE PACKAGE        */        
                                   /*--!  !24: CHGT AFFILIE          */        
        4 NOIDMAT  CHAR(14),       ###################################################        
        4 NOHDRLT  BIN FIXED(15),  ##############################################        
        4 CDDVPOL  CHAR(3),        ####################################################        
        4 CDSTAPO  CHAR(1),        ####################################################        
                                   /*--!  !0: POLICE INCOMPLETE      */        
                                   /*--!  !1: PRODUCT. INDIV. OK     */        
                                   /*--!  !2: FACTURAT.INDIV. OK     */        
                                   /*--!  !3: FACTURAT.PACKAGE OK    */        
        4 CDAGINT  CHAR(6),        ####################################################        
        4 NORFEXT  CHAR(12),       ###################################################        
        4 CDTYDOC  CHAR(1),        ####################################################        
        4 FILLER   CHAR(9),        ####################################################        
        4 FILL_23  CHAR(41),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT ADRESSE COURRIER PAR POLICE                           */        
 /*****************************************************************/        
       3 ADPOL_O,        
        4 CDADPOL  CHAR(1),               #####################################################        
        4 LTNMPOL  CHAR(30),              ####################################################        
        4 CDRSPOL  CHAR(1),               #####################################################        
        4 LTRUEPO  CHAR(30),              ####################################################        
        4 CDCPOPO  CHAR(6),               #####################################################        
        4 LTLOCPO  CHAR(25),              ####################################################        
        4 CDPAYPO  CHAR(3),               #####################################################        
        4 FILL_24  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT ADRESSE AFFILIE                                       */        
 /*****************************************************************/        
       3 ADAFF_O,        
        4 LTRUEAF  CHAR(25),                ####################################################        
        4 CDCPOAF  CHAR(6),                 #####################################################        
        4 LTLOCAF  CHAR(25),                ####################################################        
        4 CDPAYAF  CHAR(3),                 #####################################################        
        4 FILL_25  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT ADRESSE COURRIER PAR AFFILIE                          */        
 /*****************************************************************/        
       3 ADCOU_O,        
        4 CDADCOU  CHAR(1),               #####################################################        
        4 LTNMCOU  CHAR(30),              ####################################################        
        4 CDRSCOU  CHAR(1),               #####################################################        
        4 LTRUECO  CHAR(30),              ####################################################        
        4 CDCPOCO  CHAR(6),               #####################################################        
        4 LTLOCCO  CHAR(25),              ####################################################        
        4 CDPAYCO  CHAR(3),               #####################################################        
        4 FILL_26  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT RELATIONS ENTRE AFFILIES (DOUBLONS)                   */        
 /*****************************************************************/        
       3 RELAT_O,        
        4 CDNATRE  CHAR(2),         #####################################################        
        4 NOAFFRE  DEC FIXED(7),    ################################################        
        4 FILL_27  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT CREATION D ENSEMBLES                                  */        
 /*****************************************************************/        
       3 ENSEM_O,        
        4 TBIDENS(2)  CHAR(7),      ############################################        
        4 FILL_28  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT DESTINE AUX DONNEES COMPLEMENTAIRES                   */        
 /*****************************************************************/        
       3 COMPL_O,        
        4 NOIDAFF  DEC FIXED(7),    ################################################        
        4 CDTYINF  CHAR(2),         #####################################################        
        4 LTNMINF  CHAR(30),        ####################################################        
        4 FILL_29  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT HISTORIQUE AFFILIE                                    */        
 /*****************************************************************/        
       3 HISAF_O,        
        4 NOIDAFF  DEC FIXED(7),      ################################################        
        4 NOSQAFF  BIN FIXED(15),     ###############################################        
        4 NBSQAFF  BIN FIXED(15),     ###############################################        
        4 CDCMGES  CHAR(8),           #####################################################        
        4 DAMAJAF  DEC FIXED(7),      ################################################        
        4 HHMAJAF  DEC FIXED(7),      ################################################        
        4 NOIDTER  CHAR(8),           #####################################################        
        4 LTNMAFF  CHAR(30),          ####################################################        
        4 LTEXTNM  CHAR(30),          ####################################################        
        4 CDRSAFF  CHAR(1),           #####################################################        
        4 CDSEXAF  CHAR(1),           #####################################################        
        4 CDLGEAF  CHAR(1),           #####################################################        
        4 DANAIAF  DEC FIXED(10),     ###############################################        
        4 LTNMCDS  CHAR(21),          ####################################################        
        4 LTRUEAF  CHAR(25),          ####################################################        
        4 CDCPOAF  CHAR(6),           #####################################################        
        4 LTLOCAF  CHAR(25),          ####################################################        
        4 CDPAYAF  CHAR(3),           #####################################################        
        4 LTLINAI  CHAR(30),          ####################################################        
        4 LTPROAF  CHAR(30),          ####################################################        
        4 NOTL1AF  DEC FIXED(3),      ################################################        
        4 NOTL2AF  DEC FIXED(9),      ################################################        
        4 NOTLBUR  CHAR(16),          ####################################################        
        4 NBFACAF  PIC'9',            ######################################################        
        4 CDINSAF  CHAR(2),           #####################################################        
        4 NOCPTAF  PIC'(12)9',        ##################################################        
        4 LTCOMAF  CHAR(30),          ####################################################        
        4 LTNMCOU  CHAR(30),          ####################################################        
        4 CDRSCOU  CHAR(1),           #####################################################        
        4 LTRUECO  CHAR(30),          ####################################################        
        4 CDCPOCO  CHAR(6),           #####################################################        
        4 LTLOCCO  CHAR(25),          ####################################################        
        4 CDPAYCO  CHAR(3),           #####################################################        
        4 LTNM1MB  CHAR(30),          ####################################################        
        4 LTNM2MB  CHAR(30),          ####################################################        
        4 NOHA1AF  BIN FIXED(15),     ###############################################        
        4 NOHA2AF  CHAR(4),           #####################################################        
        4 NOFA1AF  DEC FIXED(3),      ################################################        
        4 NOFA2AF  DEC FIXED(9),      ################################################        
        4 CDCHAL1  CHAR(2),           #####################################################        
        4 CDETCIV  CHAR(2),           #####################################################        
        4 CDORGAF  CHAR(2),           #####################################################        
        4 CDRCTAF  CHAR(2),           #####################################################        
        4 NOGSMAF  CHAR(15),          ####################################################        
        4 DADECAF  DEC FIXED(7),      ################################################        
        4 CDNATAF  CHAR(3),           #####################################################        
        4 RSVHIST  CHAR(93),          ####################################################        
        4 FILL_30  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE ACTIVITES                                */        
 /*****************************************************************/        
       3 CLACT_O,        
        4 NOIDCLI  DEC FIXED(9),        ################################################        
        4 TBEGCOD(16)  BIT(1),          ##################################################        
        4 FILL_31  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT ACTIVITES PROFESSIONELLES                             */        
 /*****************************************************************/        
       3 CLPRO_O,        
        4 DAEFPRO  DEC FIXED(7),        #############################################        
        4 NOSQRUE  BIN FIXED(15),       ############################################        
        4 CDTYPRO  CHAR(2),             ##################################################        
        4 CDTYEMP  CHAR(2),             ##################################################        
        4 CDPOEMP  CHAR(4),             ##################################################        
        4 LOPOEMP  CHAR(20),            #################################################        
        4 TXDETVA  DEC FIXED(3),        #############################################        
        4 NUDETVA  CHAR(9),             ##################################################        
        4 LTCMPRO  CHAR(40),            #################################################        
        4 LTCMEMP  CHAR(40),            #################################################        
        4 CDHANDI  CHAR(1),             ##################################################        
        4 CDRETVA  CHAR(1),             ##################################################        
        4 CDASTVA  CHAR(1),             ##################################################        
        4 CDTRANS  CHAR(1),             ##################################################        
        4 TBEGCOD(16)  BIT(1),          ###############################################        
                                       /*--!  !01:SECTEUR PRIVE   */        
                                       /*--!  !02:SECTEUR PUBLIC  */        
                                       /*--!  !03:SECT.ASSOCIATIF */        
        4 CDFONCT  CHAR(1),             ##################################################        
        4 CDGEPRO  CHAR(2),             ##################################################        
        4 CDGEEMP  CHAR(2),             ##################################################        
        4 CDTAENT  CHAR(2),             ##################################################        
        4 FILL_32  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE ACTIVITES COMPLEMENTAIRES                */        
 /*****************************************************************/        
       3 CLACC_O,        
        4 NOSQACC  BIN FIXED(15),       #############################################        
        4 CDTYACC  CHAR(2),             ###################################################        
        4 LTCMACC  CHAR(40),            ##################################################        
        4 TBEGCOD(16)  BIT(1),          ################################################        
        4 CDTYASC  CHAR(2),             ###################################################        
        4 LTLIACC  CHAR(30),            ##################################################        
        4 FILL_33  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES CONTACTS                             */        
 /*****************************************************************/        
       3 CLCON_O,        
        4 NOIDCLI  DEC FIXED(9),        ################################################        
        4 TBEGCOD(16)  BIT(1),          ##################################################        
        4 FILL_34  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES ADRESSES                             */        
 /*****************************************************************/        
       3 CLADR_O,        
        4 CDTYADR  CHAR(2),           #####################################################        
        4 DAEFPRO  DEC FIXED(7),      ################################################        
        4 LTADNO1  CHAR(30),          ####################################################        
        4 LTADNO2  CHAR(30),          ####################################################        
        4 CDADRSO  CHAR(3),           #####################################################        
        4 LTADADR  CHAR(30),          ####################################################        
        4 NOADCPO  CHAR(5),           #####################################################        
        4 NOADBTE  CHAR(5),           #####################################################        
        4 CDADCPO  CHAR(6),           #####################################################        
        4 LOADLOC  CHAR(20),          ####################################################        
        4 CDADPAY  CHAR(3),           #####################################################        
        4 NUADTEL  CHAR(15),          ####################################################        
        4 NUADFAX  CHAR(15),          ####################################################        
        4 TBEGCOD(16)  BIT(1),        ##################################################        
        4 NOCPLPR  CHAR(10),          ####################################################        
        4 FILL_35  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE COMPLEMENT D ADRESSE                     */        
 /*****************************************************************/        
       3 CLCPL_O,        
        4 CDTYACC  CHAR(2),              #####################################################        
        4 LTCLCPL  CHAR(30),             ####################################################        
        4 TBEGCOD(16)  BIT(1),           ##################################################        
        4 FILL_36  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES CONTACTS PRIVILEGIES                 */        
 /*****************************************************************/        
       3 CLCOP_O,        
        4 NOIDAFF(10)  CHAR(6),           #################################################        
        4 TBEGCOD(16)  BIT(1),            ##################################################        
        4 FILL_37  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT COMPLEMENT SIGNALETIQUE                               */        
 /*****************************************************************/        
       3 CLCOM_O,        
        4 NOIDCLI  DEC FIXED(9),     ################################################        
        4 DADECAF  DEC FIXED(7),     ################################################        
        4 DAPERMI  DEC FIXED(7),     ################################################        
        4 TBNBCTC(5),        
         5 CDTYCTC  CHAR(2),         ####################################################        
         5 NBCONTR  DEC FIXED(7),    ###############################################        
        4 NBENFAN  BIN FIXED(15),    ###############################################        
        4 NBENFHA  BIN FIXED(15),    ###############################################        
        4 NBAUTCH  BIN FIXED(15),    ###############################################        
        4 NOID_CI  DEC FIXED(7),     ################################################        
        4 DACIDEN  DEC FIXED(7),     ################################################        
        4 DAENVAG  DEC FIXED(7),     ################################################        
        4 NBENVAG  DEC FIXED(3),     ################################################        
        4 TBEGCOD(16)  BIT(1),       ##################################################        
                                     /*--!  !01 CD CHEF DE MENA.:'Y'  */        
                                     /*--!  !02 CD CHEF DE MENA.:'N'  */        
                                     /*--!  !03 CD MDP : ENVOI CLIENT */        
                                     /*--!  !04 CD ACC. INFOS NET     */        
        4 NOPERMI  CHAR(10),         ####################################################        
        4 CDLGSEC  CHAR(1),          #####################################################        
        4 CDORAFF  CHAR(2),          #####################################################        
        4 CDNATCL  CHAR(3),          #####################################################        
        4 LTPRECL  CHAR(15),         ####################################################        
        4 NUGSMCL  CHAR(15),         ####################################################        
        4 NOSEQUI  CHAR(3),          ####################################################        
                                     /*--!  !GENERE ALEATOIREMENT    */        
        4 CDGSTAM  CHAR(1),          ####################################################        
                                     /*--!  !VAL. POSS : I/R/S/BLANC */        
                                     /*--!  !I : ISRT 1ERE DEM DE MDP*/        
                                     /*--!  !R : NEW MDP-GARDE USERID*/        
                                     /*--!  !S : SUP MDP POUR USERID */        
        4 CDGSPWD  CHAR(1),          ####################################################        
                                     /*--!  !EMPECHE LA DEM. DE PLS  */        
                                     /*--!  !MDP SIMULTANEMENT       */        
                                     /*--!  !VAL. POSS : E/U/P/BLANC */        
                                     /*--!  !E : DMD DE MDP EN COURS */        
                                     /*--!  !U : USERID EXPEDIE      */        
                                     /*--!  !P : MDP EXPEDIE         */        
        4 CDORIDE  CHAR(1),          #####################################################        
                                     /*--!  !VAL. POSS : ALPHANUM.    */        
                                     /*--!  !A: ASSURANCE             */        
                                     /*--!  !B: BANQUE                */        
        4 CDWOCK1  CHAR(1),          #####################################################        
        4 CDWOCK2  CHAR(1),          #####################################################        
        4 CDETCIV  CHAR(2),          #####################################################        
        4 CDCHAL1  CHAR(2),          #####################################################        
        4 CDCHAL2  CHAR(3),          #####################################################        
        4 CDMAJCL  CHAR(2),          #####################################################        
        4 LTMAJCL  CHAR(30),         ####################################################        
        4 AFFINIT(5),        
         5 CDAFIN1  CHAR(2),         ####################################################        
         5 CDAFIN2  CHAR(15),        ###################################################        
         5 CDFAMIL  CHAR(1),         ####################################################        
        4 CDCIDEN  CHAR(1),          #####################################################        
        4 DADERMS  PIC'(7)9',        ###################################################        
        4 NBCONMS  PIC'(5)9',        ###################################################        
        4 DAEXPCI  PIC'(7)9',        ###################################################        
        4 DAABNWL  PIC'(7)9',        ###################################################        
        4 CDSTACI  CHAR(1),          #####################################################        
        4 DASTACI  PIC'(07)9',       ##################################################        
        4 NOBCEAF  CHAR(10),         ####################################################        
        4 CDCTF2F  CHAR(1),          #####################################################        
        4 CDPEP    CHAR(1),          #####################################################        
        4 CDCOMMEN CHAR(1),          #####################################################        
        4 CDPTIENF CHAR(1),          #####################################################        
        4 CDEINVO  CHAR(1),          #####################################################        
        4 FILL_38  CHAR(49),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DES RELATIONS                            */        
 /*****************************************************************/        
       3 CLREL_O,        
        4 NOSEQRE  BIN FIXED(15),          ###############################################        
        4 NOIDREL  CHAR(2),                #####################################################        
        4 CDTYREL  CHAR(1),                #####################################################        
        4 NOCLREL  DEC FIXED(7),           ################################################        
        4 TBEGCOD(16)  BIT(1),             ##################################################        
        4 REC_VOTE  CHAR(27),              ###################################################        
        4 DAASSEM  DEC FIXED(7),           ################################################        
        4 FILL_39  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT AUTRES PRENOMS                                        */        
 /*****************************************************************/        
       3 CLPRE_O,        
        4 LTPRCL1  CHAR(15),                ####################################################        
        4 LTPRCL2  CHAR(15),                ####################################################        
        4 TBEGCOD(16)  BIT(1),              ##################################################        
        4 FILL_40  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE ADRESSE E-MAIL                           */        
 /*****************************************************************/        
       3 CLEML_O,        
        4 DAADEML  DEC FIXED(7),      ################################################        
        4 TBEGCOD(16)  BIT(1),        ##################################################        
                                      /*--!  !1 - ADRESSE INACTIVE    */        
        4 LTADEML  CHAR(50),          ####################################################        
        4 LTORIGI  CHAR(10),          ####################################################        
        4 CDPREML  CHAR(1),           #####################################################        
        4 FILL_41  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT SIGNALETIQUE DEVIS                                    */        
 /*****************************************************************/        
       3 CLDEV_O,        
        4 DADVINT  DEC FIXED(11),   #############################################        
        4 NODVINT  DEC FIXED(13),   #############################################        
        4 CDIDINT  DEC FIXED(9),    ##############################################        
        4 HHMMINT  DEC FIXED(5),    ##############################################        
        4 TBEGCOD(16)  BIT(1),      ################################################        
                                    /*--!  ! 1 - AFFICHABLE MYSMAP  */        
                                    /*--!  ! 2 - DELETE MYSMAP      */        
                                    /*--!  ! 3 - SAVE CRM PUR       */        
        4 CDTYPDV  CHAR(2),         ###################################################        
        4 CDORIDV  CHAR(2),         ###################################################        
        4 CDTYPRO  CHAR(7),         ###################################################        
        4 FILL_42  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* SEGMENT PRODUIT CLIENT                                        */        
 /*****************************************************************/        
       3 PROCL_O,        
 /*K*/  4 NOIDAFF  DEC FIXED(7),     /*NO!  !NO D'AFFILIE             */        
 /*K*/  4 NOIDPOL  DEC FIXED(9),     /*NO!  !NO. DE POLICE            */        
        4 NOIDPAC  DEC FIXED(9),     ################################################        
        4 CDTYPOL  CHAR(2),          #####################################################        
        4 CDIDPRD  CHAR(8),          #####################################################        
        4 CDIDGES  CHAR(8),          #####################################################        
        4 CDCMPRO  CHAR(1),          #####################################################        
                                     /*--!  ! 1: LIEGE                */        
                                     /*--!  ! 2  HASSELT              */        
                                     /*--!  ! 3: BRUXELLES            */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDEGPOL  CHAR(1),          #####################################################        
                                     /*--!  ! A: ACTIF                */        
                                     /*--!  ! C: CLOTURE              */        
                                     /*--!  ! P: PASSIF               */        
                                     /*--!  ! S: SUSPENDU             */        
                                     /*--!  ! D: DEVIS/PROJET         */        
                                     /*--!  ! O: OFFRE                */        
                                     /*--!  ! ?: INCONNU              */        
        4 CDCATPO  CHAR(11),         ####################################################        
        4 CDOCAAR  CHAR(4),          #####################################################        
        4 CDOCADP  CHAR(4),          #####################################################        
        4 CDMOTDP  CHAR(2),          #####################################################        
        4 CDGRPAF  CHAR(7),          #####################################################        
        4 CDFRAPO  CHAR(1),          #####################################################        
        4 CDPREML  CHAR(1),          #####################################################        
                                     /*--!  ! S: SEMESTRIEL           */        
                                     /*--!  ! M: MENSUEL              */        
                                     /*--!  ! Q: QUADRIMESTRIEL       */        
                                     /*--!  ! T: TRIMESTRIEL          */        
                                     /*--!  ! B: BIMESTRIEL           */        
                                     /*--!  ! U: UNIQUE               */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDFRFRA  CHAR(1),          #####################################################        
                                     /*--!  ! Y: YES                  */        
                                     /*--!  ! N: NO                   */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDADPOL  CHAR(1),          #####################################################        
                                     /*--!  ! Y: YES                  */        
                                     /*--!  ! N: NO                   */        
                                     /*--!  ! ^: INCONNU              */        
        4 CDDVPOL  CHAR(3),          #####################################################        
                                     /*--!  ! BEF                     */        
                                     /*--!  ! EUR                     */        
        4 CDCLAPO  CHAR(1),          #####################################################        
                                     /*--!  ! G: GROUPE               */        
                                     /*--!  ! I: INDIVIDUELLE         */        
                                     /*--!  ! ^: INCONNU              */        
        4 NOCPTPO  CHAR(12),         ####################################################        
        4 NODOMPO  CHAR(12),         ####################################################        
        4 NBRAPPO  PIC'9',           ######################################################        
        4 NBSINAC  DEC FIXED(7),     ################################################        
        4 DACMPSI  DEC FIXED(7),     ################################################        
        4 DAEFFPO  DEC FIXED(7),     ################################################        
        4 DAEXPPO  DEC FIXED(7),     ################################################        
        4 DAECHPO  DEC FIXED(4),     ################################################        
        4 PRTRMBA  DEC FIXED(15),    ###############################################        
        4 PRTRMTO  DEC FIXED(15),    ###############################################        
        4 LTINFCP  CHAR(220),        ###################################################        
        4 FILL_43  CHAR(50),         ####################################################        
 /*****************************************************************/        
 /* <<< EXPLORATION DES RELATIONS D UN CLIENT (RELAT)             */        
 /*****************************************************************/        
       3 NBELMTB_RLA  BIN FIXED(15), ############################################        
       3 TBIDELM_RLA(50),        
         4 CDNATRE    CHAR(2),       #################################################        
         4 NOAFFRE    FIXED (7),     ###############################################        
 /*****************************************************************/        
 /* <<< EXPLORATION DES RELATIONS D UN CLIENT (CLREL)             */        
 /*****************************************************************/        
       3 NBELMTB_REL  BIN FIXED(15), ############################################        
       3 TBIDELM_REL(50),        
        4 NOSEQRE  BIN FIXED(15),          ###############################################        
        4 NOIDREL  CHAR(2),                #####################################################        
        4 CDTYREL  CHAR(1),                #####################################################        
        4 NOCLREL  DEC FIXED(7),           ################################################        
        4 TBEGCOD(16)  BIT(1),             ##################################################        
        4 REC_VOTE  CHAR(27),              ###################################################        
        4 DAASSEM  DEC FIXED(7),           ################################################        
 /*****************************************************************/        
 /* <<< EXPLORATION DES HISTORIQUES D'UN CLIENT                   */        
 /*****************************************************************/        
       3 NBELMTB_HIS  BIN FIXED(15), ############################################        
       3 TBIDELM_HIS(50),        
        4 NOSQAFF  BIN FIXED(15),     ###############################################        
        4 NBSQAFF  BIN FIXED(15),     ###############################################        
        4 CDCMGES  CHAR(8),           #####################################################        
        4 DAMAJAF  DEC FIXED(7),      ################################################        
        4 HHMAJAF  DEC FIXED(7),      ################################################        
        4 NOIDTER  CHAR(8),           #####################################################        
        4 LTNMAFF  CHAR(30),          ####################################################        
        4 LTEXTNM  CHAR(30),          ####################################################        
        4 CDRSAFF  CHAR(1),           #####################################################        
        4 CDSEXAF  CHAR(1),           #####################################################        
        4 CDLGEAF  CHAR(1),           #####################################################        
        4 DANAIAF  DEC FIXED(10),     ###############################################        
        4 LTNMCDS  CHAR(21),          ####################################################        
        4 LTRUEAF  CHAR(25),          ####################################################        
        4 CDCPOAF  CHAR(6),           #####################################################        
        4 LTLOCAF  CHAR(25),          ####################################################        
        4 CDPAYAF  CHAR(3),           #####################################################        
        4 LTLINAI  CHAR(30),          ####################################################        
        4 LTPROAF  CHAR(30),          ####################################################        
        4 NOTL1AF  DEC FIXED(3),      ################################################        
        4 NOTL2AF  DEC FIXED(9),      ################################################        
        4 NOTLBUR  CHAR(16),          ####################################################        
        4 NBFACAF  PIC'9',            ######################################################        
        4 CDINSAF  CHAR(2),           #####################################################        
        4 NOCPTAF  PIC'(12)9',        ##################################################        
        4 LTCOMAF  CHAR(30),          ####################################################        
        4 LTNMCOU  CHAR(30),          ####################################################        
        4 CDRSCOU  CHAR(1),           #####################################################        
        4 LTRUECO  CHAR(30),          ####################################################        
        4 CDCPOCO  CHAR(6),           #####################################################        
        4 LTLOCCO  CHAR(25),          ####################################################        
        4 CDPAYCO  CHAR(3),           #####################################################        
        4 LTNM1MB  CHAR(30),          ####################################################        
        4 LTNM2MB  CHAR(30),          ####################################################        
        4 NOHA1AF  BIN FIXED(15),     ###############################################        
        4 NOHA2AF  CHAR(4),           #####################################################        
        4 NOFA1AF  DEC FIXED(3),      ################################################        
        4 NOFA2AF  DEC FIXED(9),      ################################################        
        4 CDCHAL1  CHAR(2),           #####################################################        
        4 CDETCIV  CHAR(2),           #####################################################        
        4 CDORGAF  CHAR(2),           #####################################################        
        4 CDRCTAF  CHAR(2),           #####################################################        
        4 NOGSMAF  CHAR(15),          ####################################################        
        4 DADECAF  DEC FIXED(7),      ################################################        
        4 CDNATAF  CHAR(3),           #####################################################        
        4 RSVHIST  CHAR(93),          ####################################################        
 /*****************************************************************/        
 /* <<< EXPLORATION DES ADRESSE E-MAIL                            */        
 /*****************************************************************/        
       3 NBELMTB_EML  BIN FIXED(15), ############################################        
       3 TBIDELM_EML(50),        
        4 DAADEML  DEC FIXED(7),      ################################################        
        4 TBEGCOD(16)  BIT(1),        ##################################################        
                                      /*--!  !1 - ADRESSE INACTIVE    */        
        4 LTADEML  CHAR(50),          ####################################################        
        4 LTORIGI  CHAR(10),          ####################################################        
        4 CDPREML  CHAR(1),           #####################################################        
 /*****************************************************************/        
 /* <<< EXPLORATION DES ENSEMBLES                                 */        
 /*****************************************************************/        
       3 NBELMTB_ENS  BIN FIXED(15), ############################################        
       3 TBIDELM_ENS(50),        
        4 TBIDENS(2)  CHAR(7),       ##################################################        
 /*****************************************************************/        
 /* <<< EXPLORATION DES POLICES                                   */        
 /*****************************************************************/        
       3 NBELMTB_POL  BIN FIXED(15), ############################################        
       3 TBIDELM_POL(99),        
        4 NOIDPOL  DEC FIXED(8),   ###############################################        
        4 CDTYPOL  CHAR(2),        ####################################################        
        4 CDINTAG  DEC FIXED(7),   ###############################################        
                                   /*--!  !A REMPLACER PAR CDAGINT   */        
        4 NODERAV  DEC FIXED(3),   ###############################################        
        4 TBCDPOL(24)  BIT(1),     #################################################        
                                   /*--!  !01: POLICE COURT TERME    */        
                                   /*--!  !02: FACT MS PAR SOUS GR   */        
                                   /*--!  !03: PRESENCE AD. POLICE   */        
                                   /*--!  !04: MUTATION DE SOCIETE   */        
                                   /*--!  !       SMAP <---> MEGA    */        
                                   /*--!  !05: MS : ATTESTATION      */        
                                   /*--!  !06: BILINGUE/TRILINGUE    */        
                                   /*--!  !07: SINISTRE EN D1        */        
                                   /*--!  !08: SINISTRE EN SA        */        
                                   /*--!  !09: SINISTRE EN AC        */        
                                   /*--!  !10: MEMO POLICE           */        
                                   /*--!  !22: POLICE SOUS PACKAGE   */        
                                   /*--!  !23: POLICE PACKAGE        */        
                                   /*--!  !24: CHGT AFFILIE          */        
 /*****************************************************************/        
 /* <<< EXPLORATION DES PRODUITS                                  */        
 /*****************************************************************/        
       3 NBELMTB_PRO  BIN FIXED(15), ############################################        
       3 TBIDELM_PRO(50),        
        4 NOIDPOL  DEC FIXED(9),   ###############################################        
        4 NOIDPAC  DEC FIXED(9),   ###############################################        
        4 CDTYPOL  CHAR(2),        ####################################################        
         
 /*****************************************************************/        
 /* <<< EXPLORATION DES DEVIS                                     */        
 /*****************************************************************/        
       3 NBELMTB_DEV  BIN FIXED(15), ##########################################        
       3 TBIDELM_DEV(99),        
        4 DADVINT  DEC FIXED(11),   #############################################        
        4 NODVINT  DEC FIXED(13),   #############################################        
        4 CDIDINT  DEC FIXED(9),    ##############################################        
        4 HHMMINT  DEC FIXED(5),    ##############################################        
        4 TBEGCOD(16)  BIT(1),      ################################################        
                                    /*--!  ! 1 - AFFICHABLE MYSMAP  */        
                                    /*--!  ! 2 - DELETE MYSMAP      */        
                                    /*--!  ! 3 - SAVE CRM PUR       */        
        4 CDTYPDV  CHAR(2),         ###################################################        
        4 CDTYPRO  CHAR(7),         ###################################################        
        4 CDORIDV  CHAR(2);         ###################################################        
         
         
 /* AFIN D'EVITER LES PROBLEMES DE STRUCTURE (DESCRIPTOR), JE REDEFINIS        
    LE NOUVEAU CHAMPS SUR LES FILLERS DES STRUCTURE INPUT ET OUTPUT        
    ==> LA STRUCTURE NE CHANGE DONC PAS ET LES PROGRAMMES UTILISANT        
    LE KS1005 NE SONT PAS A RECOMPILER */        
         
 DCL CDDEFCT_I  CHAR(02)  BASED(ADDR(KS1005J.INPUT.CLPRO_I.FILL_11));        
 DCL CDREVME_I  CHAR(01)        
                DEF  KS1005J.INPUT.CLPRO_I.FILL_11 POS(3);        
 DCL CDENFAN_I  CHAR(01)        
                DEF  KS1005J.INPUT.CLPRO_I.FILL_11 POS(4);        
 DCL CDDEFCT_O  CHAR(02)  BASED(ADDR(KS1005J.OUTPUT.CLPRO_O.FILL_32));        
 DCL CDREVME_O  CHAR(01)        
                DEF  KS1005J.OUTPUT.CLPRO_O.FILL_32 POS(3);        
 DCL CDENFAN_O  CHAR(01)        
                DEF  KS1005J.OUTPUT.CLPRO_O.FILL_32 POS(4);        
         
 /*********************************************************************        
    METHODE : CONSULT_XXXXX (CONSULTATION)        
              XXXXX = AFFIL       PCB:DS101        
                      POLIC        
                      ADPOL        
                      ADAFF        
                      ADCOU        
         
              XXXXX = COMPL       PCB:DS102        
         
              XXXXX = HISAF       PCB:DS128        
         
              XXXXX = PROCL       PCB:DS129        
         
              XXXXX = CLACT       PCB:DS132        
                      CLPRO        
                      CLACC        
         
              XXXXX = CLCON       PCB:DS134        
                      CLADR        
                      CLCPL        
                      CLCOP        
         
              XXXXX = CLCOM       PCB:DS137        
                      CLREL        
                      CLPRE        
         
    METHODE : CREAT_XXXXX (CREATION)        
              XXXXX = AFFIL       PCB:DS101        
                      POLIC        
                      ADPOL        
                      ADAFF        
                      ADCOU        
                      RELAT        
                      ENSEM        
         
              XXXXX = COMPL       PCB:DS102        
         
              XXXXX = HISAF       PCB:DS128        
         
              XXXXX = CLACT       PCB:DS132        
                      CLPRO        
                      CLACC        
         
              XXXXX = CLCON       PCB:DS134        
                      CLADR        
                      CLCPL        
                      CLCOP        
         
              XXXXX = CLCOM       PCB:DS137        
                      CLREL        
                      CLPRE        
                      CLEML        
         
    METHODE : MODIF_XXX (MODIFICATION)        
              XXXXX = AFFIL       PCB:DS101        
                      POLIC        
                      ADPOL        
                      ADAFF        
                      ADCOU        
                      ENSEM        
         
              XXXXX = COMPL       PCB:DS102        
         
              XXXXX = HISAF       PCB:DS128        
         
              XXXXX = CLACT       PCB:DS132        
                      CLPRO        
                      CLACC        
         
              XXXXX = CLCON       PCB:DS134        
                      CLADR        
                      CLCPL        
                      CLCOP        
         
              XXXXX = CLCOM       PCB:DS137        
                      CLREL        
                      CLPRE        
         
    METHODE : SUPPR_XXXXX (SUPPRESSION)        
              XXXXX = AFFIL       PCB:DS101        
                      POLIC        
                      ADPOL        
                      ADAFF        
                      ADCOU        
                      RELAT       REMPLIR TOTALEMENT RELAT_I        
                      ENSEM        
         
              XXXXX = COMPL       PCB:DS102        
         
              XXXXX = HISAF       PCB:DS128        
         
              XXXXX = CLACT       PCB:DS132        
                      CLPRO        
                      CLACC        
         
              XXXXX = CLCON       PCB:DS134        
                      CLADR        
                      CLCPL        
                      CLCOP        
         
              XXXXX = CLCOM       PCB:DS137        
                      CLREL        
                      CLPRE        
                      CLEML       SUPPRESSION GLOBALE        
         
         
    METHODE : EXIST_XXXXX (EXISTENCE)        
              XXXXX = A DEFINIR        
         
    METHODES EXPLORATION: EXPLO_1P_XXXXX  1ERE PAGE        
    ====================  EXPLO_PS_XXXXX  PAGE SUIVANTE        
                          EXPLO_PP_XXXXX  PAGE PRECEDENTE        
         
         
    XXXXX = CLREL (SIGNALETIQUE DES RELATIONS)        
    XXXXX = HISAF (HISTORIQUE DU SIGNALETIQUE D UN AFFILIE)        
         
    METHODES EXPLORATION SANS PAGINATION : EXPLO_XXXXX        
    =====================================        
         
    XXXXX = RELAT (RELATION ENTRE AFFILIES)        
    XXXXX = CLEML (ADRESSES E-MAIL )        
    XXXXX = ENSEM (ENSMBLES)        
    XXXXX = POLIC (POLICES)        
    XXXXX = PROCL (PRODUITS)        
    XXXXX = CLDEV (DEVIS)        
         
 **********************************************************************/        
   /* INTERFACE SERVICE SIGNALETIQUE      */        
         
 DCL KS1010  ENTRY;        
 /*********************************************************************/        
 /* KS1010J:                                                          */        
 /*         INTERFACE DU SERVICE KS1010:  CREATE PROSPECT VIA NET     */        
 /*                                                                   */        
 /*********************************************************************/        
         
 /* ------- */        
 /* INCLUDE */        
 /* ------- */        
         
 /* NRB - TDMARE - Generation le 27/01/1998 - 16:14        Lgth=00119 */        
 /*******************        
 *  SEGMENT AFFILIE *        
 *******************/        
 DCL  1 S1AFF00 ,                        ###############################################################        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),          /*NO!  !NUMERO D'AFFILIE 0   */        
       2 HEADER_AFF  PIC'(7)9',          #################################################        
       2 HEADER_POL  PIC'(8)9',          #################################################        
       2 FILLER  CHAR(100);              #####################################################        
                     /* COMPOSTEUR POUR DETERMINER DU NO D'AFFILIE */        
 /* NRB - TDMROO - GENERATION LE 03/05/2010 - 14:32        LGTH=00119 */        
 /********************/        
 /*  SEGMENT AFFILIE */        
 /********************/        
 DCL  1 S1AFFIL ,                   ###############################################################        
                                    /*DB!  !DCR41   !S1AFFIL          */        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),     /*NO!  !NUMERO D'AFFILIE          */        
       2 LTNMAFF  CHAR(30),         #####################################################        
       2 CDRSAFF  CHAR(1),          ######################################################        
       2 CDSEXAF  CHAR(1),          ######################################################        
       2 DANAIAF  DEC FIXED(10),    ################################################        
       2 CDLGEAF  CHAR(1),          ######################################################        
       2 NORULOC  DEC FIXED(7),     #################################################        
       2 NOHA1AF  BIN FIXED(15),    ################################################        
       2 NOHA2AF  CHAR(4),          ######################################################        
       2 CDEGCOU  CHAR(1),          ######################################################        
       2 TBEGCOD  BIT(40),          ######################################################        
                                    /*--!  !01 : PROFESSION           */        
                                    /*--!  !02 : EXTENSION DU NOM     */        
                                    /*--!  !03 : LIEU DE NAISSANCE    */        
                                    /*--!  !04 : INSPECTEUR-CPT-FACT. */        
                                    /*--!  !05 : MOTIF DE LA MODIF.   */        
                                    /*--!  !06 : NOM CONDENSE MEMBRE  */        
                                    /*--!  !07 : NOM CONJOINT EN MEGA */        
                                    /*--!  !08 : NUMERO PIC DU CCB    */        
                                    /*--!  !09 : --- VIDE --9/11/2000 */        
                                    /*--!  !10 : TELEPHONE EMPLOYEUR  */        
                                    /*--!  !11 : NO AFFILIE AUTRE SOC */        
                                    /*--!  !12 : REFERENCE CHGT ADR.  */        
                                    /*--!  !13 : REF. DE LA M-A-J     */        
                                    /*--!  !14 : 1 PARTIE NOM DU MBRE */        
                                    /*--!  !15 : 2 PARTIE NOM DU MBRE */        
                                    /*--!  !16 : --- VIDE --9/11/2000 */        
                                    /*--!  !17 : MATRICULE CIE LGCP   */        
                                    /*--!  !18 : PRESENCE RELATIONS   */        
                                    /*--!  !19 : NO DOMICILIATION     */        
                                    /*--!  !20 :                      */        
                                    /*--!  !21 : INFOS ACCIDENTS      */        
                                    /*--!  !22 : NOM COMPTE TIERS     */        
                                    /*--!  !23 : INFO CAISSE AG       */        
                                    /*--!  !24 : QUALITE DELEGUE AG   */        
                                    /*--!  !25 : AFF.AMEL A BLANC     */        
                                    /*--!  !26 : SUPPR. FAT VIA S1DAT */        
                                    /*--!  !27 : NO COMPTE IBAN       */        
                                    /*--!  !28 : CODE BIC             */        
                                    /*--!  !29 : IMAGE 1 CARTE IDENT. */        
                                    /*--!  !30 : IMAGE 2 CARTE IDENT. */        
                                    /*--!  !31 : DATE DER.MAJ EMVC OL */        
                                    /*--!  !32 : DATE CHGT ADRESSE    */        
                                    /*--!  !33 : NR BCE INTRA-CEE     */        
                                    /*--!  !34 : NR IBAN (ZOOMIT)     */        
       2 TBTYPAF  BIT(240),         #####################################################        
                                    /*--!  !VOIR DEFINITION IPS1006   */        
                                    /*--!  !01 : AFFILIE SECONDAIRE   */        
                                    /*--!  !02 : AFFILIE PRINCIPAL    */        
                                    /*--!  !03 : BILINGUE FRANCAIS    */        
                                    /*--!  !04 : BILINGUE NEERLANDAIS */        
                                    /*--!  !05 : NO TVA DS DANAIAF    */        
                                    /*--!  !11 : EPOUX DE ...         */        
                                    /*--!  !12 : EPOUDE DE ...        */        
                                    /*--!  !13 : ENFANT DE ...        */        
                                    /*--!  !14 : PARENT DE ...        */        
                                    /*--!  !15 : CONCUBIN DE ...      */        
                                    /*--!  !16 : CONCUBINE DE ...     */        
                                    /*--!  !17 : DIVERS DE ...        */        
                                    /*--!  !18 : DIVERSES DE ...      */        
                                    /*--!  !29 : CLIENT A REFUSER     */        
                                    /*--!  !30 : CHGT ADRESSE EN COUR */        
                                    /*--!  !31 : VIP                  */        
                                    /*--!  !32 : VIP TRES IMPORTANT   */        
                                    /*--!  !33 : PAS D'AGENDA         */        
                                    /*--!  !34 : CLIENT CCB           */        
                                    /*--!  !35 : CLIENT PASSIF        */        
                                    /*--!  !36 : MEMBRE DU PERSONNEL  */        
                                    /*--!  !37 : PAS DE MAILING       */        
                                    /*--!  !38 : CLIENT A SURVEILLER  */        
                                    /*--!  !39 : EXPERT AUTO ^AUTOMAT */        
                                    /*--!  !40 : CONVENTION DE GESTIO */        
                                    /*--!  !41 : CLIENT FICTIF        */        
                                    /*--!  !42 : MEMO                 */        
                                    /*--!  !43 : CHGT D'ADRESSE EN CO */        
                                    /*--!  !44 : AFFILIE PERIME       */        
                                    /*--!  !45 : CONTENTIEUX          */        
                                    /*--!  !46 : CLUB BLOSO           */        
                                    /*--!  !47 : MEMBRE VLB           */        
                                    /*--!  !48 : PAS DE TP INFORMEX   */        
                                    /*--!  !49 : FONCTIONNAIRE CEE    */        
                                    /*--!  !50 : A NE PAS RAPPELER    */        
                                    /*--!  !51 : ADRESSE SOPRESS      */        
                                    /*--!  !52 : CONTRAT BILINGUE     */        
                                    /*--!  !53 : AFFILIE DECEDE       */        
                                    /*--!  !54 : PRODUCTION FICTIVE   */        
                                    /*--!  !55 : GESTION PROTEGEE     */        
                                    /*--!  !56 : CLIENT CGFP          */        
                                    /*--!  !57 : CELLULE DE DISTRIBUT */        
                                    /*--!  !58 : GESTION SIN. DEDICAE */        
                                    /*--!  !59 : AD.COURRIER SINISTRE */        
                                    /*--!  !60 : DOCUMENT EURO/DEFAUT */        
                                    /*--!  !61 : PROSPECT             */        
                                    /*--!  !62 : SUIVI GESTIONNAIRE   */        
                                    /*--!  !63 : MEMBRE               */        
                                    /*--!  !64 : FAUX-MEMBRE          */        
                                    /*--!  !65 : IMPOSABLE            */        
                                    /*--!  !72 : ACTIF DEFINITIF      */        
                                    /*--!  !73 : ACTIF TEMPORAIRE     */        
                                    /*--!  !74 : INACTIF              */        
                                    /*--!  !75 : RETRAITE             */        
                                    /*--!  !76 : UTILISATEUR EXTERNE  */        
                                    /*--!  !77 : FONCTIONNAIRE        */        
                                    /*--!  !78 : CTRL RSQ : W=BLOQUE  */        
                                    /*--!  !79 : CTRL RSQ : S=SURVEIL */        
                                    /*--!  !80 : SMAP-INFOS           */        
                                    /*--!  !81 : FICHE PERSONNELLE V  */        
                                    /*--!  !82 : NOUV. ADR. INCONNUE  */        
                                    /*--!  !83 : BENEFICIE DE 3 APPEL */        
                                    /*--!  !     AU CC JURIDIQUE LEGI */        
                                    /*--!  !84:FAIT PART. D'1 AFFINIT */        
                                    /*--!  !85:VIE PURE (AME)         */        
                                    /*--!  !86:ENVOI ENQUETE MIEUX... */        
                                    /*--!  !87:RETOUR ENQ. MIEUX...   */        
                                    /*--!  !88:RETOUR ENQ.MIEUX+SIGN. */        
                                    /*--!  !89 : SPONSORING (VIP)     */        
                                    /*--!  !90 : STOP PHONING         */        
                                    /*--!  !91 : ROBINSON             */        
                                    /*--!  !92 : CTL RSQ:Z=BLOQUE ISI */        
                                    /*--!  !93 : PRES. CARTE IDENTIT. */        
                                    /*--!  !94 : FAILLITE             */        
                                    /*--!  !95:STOP TRANSFERT SMAP BQ */        
                                    /*--!  !96 : CODE CERTI-POST      */        
                                    /*--!  !97 : PROSPECT CORPORATE   */        
                                    /*--!  !98 : PROSPECT + DE 5 ANS  */        
                                    /*--!  !99 :ACCEPTATION EXPLICITE */        
                                    /*--!  !     E-MAIL PUBLICITAIRE  */        
                                    /*--!  !100: CLIENT REFUSE EN VIE */        
                                    /*--!  !     PARTICULIERS         */        
                                    /*--!  !101: ENQUTE VIE          */        
                                    /*--!  !     PARTICULIERS EN COURS*/        
                                    /*--!  !102: ACCEPTATION APRES    */        
                                    /*--!  !     ENQUTE VIE PARTIC.  */        
                                    /*--!  !103: REFUS EXPLICITE      */        
                                    /*--!  !     E-MAIL PUBLICITAIRE  */        
                                    /*--!  !104: PAS D'AGENDA ACTIF   */        
                                    /*--!  !     AV.ACTIVATION NVELLE */        
                                    /*--!  !     ADRESSE INCONNUE     */        
                                    /*--!  !105: PAS DE MAILING ACTIF */        
                                    /*--!  !     AV.ACTIVATION NVELLE */        
                                    /*--!  !     ADRESSE INCONNUE     */        
                                    /*--!  !106: CLIENT ETHIAS BANQUE */        
                                    /*--!  !107: ANCIEN CLIENT BANQUE */        
                                    /*--!  !     SEGMENTATION CLIENT  */        
                                    /*--!  !108: SEGMENT TOP          */        
                                    /*--!  !109: SEGMENT POTENTIEL    */        
                                    /*--!  !110: SEGMENT LOW          */        
                                    /*--!  !111: SEGMENT QUESTION MRK */        
                                    /*--!  !112: RESERVER             */        
                                    /*--!  !113: RESERVER             */        
                                    /*--!  !114: RESERVER             */        
                                    /*--!  !115: RESERVER             */        
                                    /*--!  !116: RESERVER             */        
                                    /*--!  !117: RESERVER             */        
                                    /*--!  !     SEGMENTATION CLIENT  */        
                                    /*--!  !118: PARRAIN POTENTIEL    */        
                                    /*--!  !119: FONCT. ASSIMILE      */        
                                    /*--!  !120: FONCT. PARRAINE      */        
                                    /*--!  !121: CONTRATS DS MENAGE   */        
                                    /*--!  !122: CLIENT E-DOCUMENT    */        
                                    /*--!  !123: AGPM                 */        
                                    /*--!  !124: MAGAZINE ETHIAS      */        
                                    /*--!  !125: FIDEL:FRANCHISE 20   */        
                                    /*--!  !126: FIDEL:FRANCHISE 50   */        
                                    /*--!  !127: FIDEL:FRANCHISE 100  */        
                                    /*--!  !128: FIDEL:TRIGGER        */        
                                    /*--!  !129: FIDELISATION         */        
                                    /*--!  !SEGMENT MENAGE            */        
                                    /*--!  !    LIFESTAGE             */        
                                    /*--!  !130: ENS (ENSEIGNANT)     */        
                                    /*--!  !131: YPR (YOUNG PROFES.)  */        
                                    /*--!  !132: SIN (SINGLES)        */        
                                    /*--!  !133: CWC (COUPLES SS ENF) */        
                                    /*--!  !134: FAM (FAMILY LIFE)    */        
                                    /*--!  !135: MED (MEDIORS)        */        
                                    /*--!  !136: SEN (SENIORS)        */        
                                    /*--!  !137: LIBRE (RESERVE)      */        
                                    /*--!  !138: LIBRE (RESERVE)      */        
                                    /*--!  !139: LIBRE (RESERVE)      */        
                                    /*--!  !    INCOME/WEALTH         */        
                                    /*--!  !140: LOWER (<1100 EUR)    */        
                                    /*--!  !141: MASS  (1100 e 3000)  */        
                                    /*--!  !142: AFFLUENT (>3000 EUR) */        
                                    /*--!  ! SEGMENT MENAGE           */        
       2 NOTL1AF  DEC FIXED(3),     #################################################        
       2 NOTL2AF  DEC FIXED(9),     #################################################        
       2 NONATAF  DEC FIXED(11),    ################################################        
       2 DADERMJ  DEC FIXED(7),     #################################################        
       2 CDLGRUE  CHAR(1),          ######################################################        
       2 NOAF1EX  DEC FIXED(7),     #################################################        
       2 NOAF2EX  BIN FIXED(15),    ################################################        
       2 CDPOGEO  DEC FIXED(7),     #################################################        
       2 NBFICDO  BIN FIXED(15);    ################################################        
         
         
    DCL 1 SSA_S1AFFIL,        
         2 FIL1         CHAR (8)     INIT ('S1AFFIL'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1AFFIL'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        FIXED (7),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMGUA - GENERATION LE 11/03/2010 - 09:30        LGTH=00110 */        
 /**************************/        
 /*  SEGMENT ENTETE POLICE */        
 /**************************/        
 DCL  1 S1POLIC ,                   ###############################################################        
                                    /*DB!  !DCR41   !S1POLIC          */        
 /*K*/ 2 NOIDPOL  DEC FIXED(8),     /*NO!  !NO. DE POLICE             */        
       2 CDTYPOL  CHAR(2),          ######################################################        
       2 CDLGPOL  CHAR(1),          ######################################################        
       2 CDETAPO  CHAR(1),          ######################################################        
                                    /*--!  !A : ACTIVE                */        
                                    /*--!  !C : CLOTUREE / ANNULEE    */        
                                    /*--!  !P : PASSIVE / EN ATTENTE  */        
                                    /*--!  !S : SUSPENDUE/SANS SUITE  */        
       2 CDCMPRO  CHAR(1),          ######################################################        
       2 CDCMGES  CHAR(8),          ######################################################        
       2 NUSOUPO  DEC FIXED(4),     #################################################        
                                    /*--!  !EN IE, VAUT 9999 POUR LE  */        
                                    /*--!  !NUMERO DE CI 000000       */        
       2 CDINSPO  CHAR(2),          ######################################################        
       2 CDINTAG  DEC FIXED(7),     #################################################        
                                    /*--!  !A REMPLACER PAR CDAGINT   */        
       2 NOINTPO  CHAR(12),         #####################################################        
       2 CDMODPA  CHAR(1),          ######################################################        
       2 CDREAPO  CHAR(1),          ######################################################        
       2 CDGAGPO  CHAR(1),          ######################################################        
       2 NODERAV  DEC FIXED(3),     #################################################        
       2 NBEXEPO  DEC FIXED(3),     #################################################        
       2 NODOMPO  DEC FIXED(10),    ################################################        
       2 NOCPTPO  DEC FIXED(10),    ################################################        
       2 CDEGAPO  CHAR(1),          ######################################################        
       2 TBCDPOL(24)  BIT(1),       ###################################################        
                                    /*--!  !01: POLICE COURT TERME    */        
                                    /*--!  !02: FACT MS PAR SOUS GR   */        
                                    /*--!  !03: PRESENCE AD. POLICE   */        
                                    /*--!  !04: MUTATION DE SOCIETE   */        
                                    /*--!  !       SMAP <---> MEGA    */        
                                    /*--!  !05: MS : ATTESTATION      */        
                                    /*--!  !06: BILINGUE/TRILINGUE    */        
                                    /*--!  !07: SINISTRE EN D1        */        
                                    /*--!  !08: SINISTRE EN SA        */        
                                    /*--!  !09: SINISTRE EN AC        */        
                                    /*--!  !10: MEMO POLICE           */        
                                    /*--!  !21: NE PEUT ETRE VUE NET  */        
                                    /*--!  !22: POLICE SOUS PACKAGE   */        
                                    /*--!  !23: POLICE PACKAGE        */        
                                    /*--!  !24: CHGT AFFILIE          */        
       2 NOIDMAT  CHAR(14),         #####################################################        
       2 NOHDRLT  BIN FIXED(15),    ################################################        
       2 CDDVPOL  CHAR(3),          ######################################################        
       2 CDSTAPO  CHAR(1),          ######################################################        
                                    /*--!  !0: POLICE INCOMPLETE      */        
                                    /*--!  !1: PRODUCT. INDIV. OK     */        
                                    /*--!  !2: FACTURAT.INDIV. OK     */        
                                    /*--!  !3: FACTURAT.PACKAGE OK    */        
       2 CDAGINT  CHAR(6),          ######################################################        
       2 NORFEXT  CHAR(12),         #####################################################        
       2 CDTYDOC  CHAR(1),          ######################################################        
       2 CDDOMIM  CHAR(1),          ######################################################        
                                    /*--!  !       2 = GeRe PAR DOMIC */        
       2 CDDOMGR  CHAR(1),          ######################################################        
                                    /*--!  !       ' ' OU 'N' = NON   */        
       2 FILLER  CHAR(7);           #######################################################        
         
    DCL 1 SSA_S1POLIC,        
         2 FIL1         CHAR (8)     INIT ('S1POLIC'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1POLIC'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        FIXED (8),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMOHL - GENERATION LE 20/04/2009 - 15:52        LGTH=00098 */        
 /***************************************        
 *  SEGMENT ADRESSE COURRIER PAR POLICE *        
 ***************************************/        
 DCL  1 S1ADPOL ,                         ###############################################################        
                                          /*DB!  !DCR41   !S1ADPOL    */        
 /*K*/ 2 CDADPOL  CHAR(1),                /*CD!  !CODE ADRESSE        */        
       2 LTNMPOL  CHAR(30),               #####################################################        
       2 CDRSPOL  CHAR(1),                ######################################################        
       2 LTRUEPO  CHAR(30),               #####################################################        
       2 CDCPOPO  CHAR(6),                ######################################################        
       2 LTLOCPO  CHAR(25),               #####################################################        
       2 CDPAYPO  CHAR(3),                ######################################################        
       2 FILLER  CHAR(2);                 #######################################################        
         
 DCL 1 SSA_S1ADPOL,        
         2 FIL1         CHAR (8)       INIT ('S1ADPOL'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KS1ADPOL'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (1),        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMCLO - Generation le 12/03/2003 - 11:12        Lgth=00059 */        
 /***************************/        
 /* SEGMENT ADRESSE AFFILIE */        
 /***************************/        
 DCL  1 S1ADAFF ,                           ###############################################################        
                                            /*DB!  !DCR41   !S1ADAFF  */        
       2 LTRUEAF  CHAR(25),                 #####################################################        
       2 CDCPOAF  CHAR(6),                  ######################################################        
       2 LTLOCAF  CHAR(25),                 #####################################################        
       2 CDPAYAF  CHAR(3);                  ######################################################        
         
 DCL 1 SSA_S1ADAFF,        
         2 FIL1         CHAR (8)     INIT ('S1ADAFF'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT (' ');        
 /* NRB - TDMOHL - GENERATION LE 20/04/2009 - 15:53        LGTH=00098 */        
 /*****************************************/        
 /*  SEGMENT ADRESSE COURRIER PAR AFFILIE */        
 /*****************************************/        
 DCL  1 S1ADCOU ,                         ###############################################################        
                                          /*DB!  !DCR41   !S1ADCOU    */        
 /*K*/ 2 CDADCOU  CHAR(1),                /*CD!  !CODE ADRESE         */        
       2 LTNMCOU  CHAR(30),               #####################################################        
       2 CDRSCOU  CHAR(1),                ######################################################        
       2 LTRUECO  CHAR(30),               #####################################################        
       2 CDCPOCO  CHAR(6),                ######################################################        
       2 LTLOCCO  CHAR(25),               #####################################################        
       2 CDPAYCO  CHAR(3),                ######################################################        
       2 FILLER  CHAR(2);                 #######################################################        
         
 DCL 1 SSA_S1ADCOU,        
         2 FIL1         CHAR (8)       INIT ('S1ADCOU'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KS1ADCOU'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (1),        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMEBN - Generation le 09/05/2003 - 11:36        Lgth=00006 */        
 /***********************************************/        
 /* SEGMENT RELATIONS ENTRE POLICES ET AFFILIES */        
 /***********************************************/        
 DCL  1 S1RELAT ,                   ###############################################################        
                                    /*DB!  !DCR41   !S1RELAT          */        
 /*K*/ 2 CDNATRE  CHAR(2),          /*CD!  !NATURE DE LA RELATION     */        
       2 NOAFFRE  DEC FIXED(7);     #################################################        
         
    DCL 1 SSA_S1RELAT,        
         2 FIL1         CHAR (8)     INIT ('S1RELAT'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1RELAT'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        CHAR (2),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMEBN - Generation le 09/05/2003 - 11:41        Lgth=00014 */        
 /********************************/        
 /* SEGMENT CREATION D'ENSEMBLES */        
 /********************************/        
 DCL  1 S1ENSEM ,                         ###############################################################        
                                          /*DB!  !DCR41   !S1ENSEM    */        
       2 TBIDENS(2)  CHAR(7);             ###################################################        
         
 DCL 1 SSA_S1ENSEM,        
        2 FIL1          CHAR (8)       INIT ('S1ENSEM'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (4)       INIT ('---');        
 /* NRB - TDMEBN - Generation le 09/05/2003 - 11:46        Lgth=00036 */        
 /************************************************/        
 /*  SEGMENT DESTINE AUX DONNEES COMPLEMENTAIRES */        
 /************************************************/        
 DCL  1 S1COMPL ,                   ###############################################################        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),     /*NO!  !NO. D'AFFILIE             */        
 /*K*/ 2 CDTYINF  CHAR(2),          /*CD!  !CODIF. TYPE D'INFORAMTION */        
       2 LTNMINF  CHAR(30);         #####################################################        
         
    DCL 1 SSA_S1COMPL,        
         2 FIL1         CHAR (8)     INIT ('S1COMPL'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1COMPL'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        CHAR (6),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMALL - GENERATION LE 06/10/2004 - 08:49        LGTH=00600 */        
 /******************************/        
 /* SEGMENT HISTORIQUE AFFILIE */        
 /* L': 600 DS125 HDAM S1AHS   */        
 /******************************/        
 DCL  1 S1HISAF ,                     ###############################################################        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),       /*NO!  !NO. D'AFFILIE           */        
 /*K*/ 2 NOSQAFF  BIN FIXED(15),      /*NO!  !NO. DE SEQUENCE AFFILIE */        
       2 NBSQAFF  BIN FIXED(15),      ################################################        
         
       2 CDCMGES  CHAR(8),            ######################################################        
       2 DAMAJAF  DEC FIXED(7),       #################################################        
       2 HHMAJAF  DEC FIXED(7),       #################################################        
       2 NOIDTER  CHAR(8),            ######################################################        
         
       2 LTNMAFF  CHAR(30),           #####################################################        
       2 LTEXTNM  CHAR(30),           #####################################################        
       2 CDRSAFF  CHAR(1),            ######################################################        
       2 CDSEXAF  CHAR(1),            ######################################################        
       2 CDLGEAF  CHAR(1),            ######################################################        
       2 DANAIAF  DEC FIXED(10),      ################################################        
       2 LTNMCDS  CHAR(21),           #####################################################        
       2 LTRUEAF  CHAR(25),           #####################################################        
       2 CDCPOAF  CHAR(6),            ######################################################        
       2 LTLOCAF  CHAR(25),           #####################################################        
       2 CDPAYAF  CHAR(3),            ######################################################        
       2 LTLINAI  CHAR(30),           #####################################################        
       2 LTPROAF  CHAR(30),           #####################################################        
       2 NOTL1AF  DEC FIXED(3),       #################################################        
       2 NOTL2AF  DEC FIXED(9),       #################################################        
       2 NOTLBUR  CHAR(16),           #####################################################        
       2 NBFACAF  PIC'9',             #######################################################        
       2 CDINSAF  CHAR(2),            ######################################################        
       2 NOCPTAF  PIC'(12)9',         ###################################################        
       2 LTCOMAF  CHAR(30),           #####################################################        
         
       2 LTNMCOU  CHAR(30),           #####################################################        
       2 CDRSCOU  CHAR(1),            ######################################################        
       2 LTRUECO  CHAR(30),           #####################################################        
       2 CDCPOCO  CHAR(6),            ######################################################        
       2 LTLOCCO  CHAR(25),           #####################################################        
       2 CDPAYCO  CHAR(3),            ######################################################        
         
       2 LTNM1MB  CHAR(30),           #####################################################        
       2 LTNM2MB  CHAR(30),           #####################################################        
         
       2 NOHA1AF  BIN FIXED(15),      ################################################        
       2 NOHA2AF  CHAR(4),            ######################################################        
       2 NOFA1AF  DEC FIXED(3),       #################################################        
       2 NOFA2AF  DEC FIXED(9),       #################################################        
       2 CDCHAL1  CHAR(2),            ######################################################        
       2 CDETCIV  CHAR(2),            ######################################################        
       2 CDORGAF  CHAR(2),            ######################################################        
       2 CDRCTAF  CHAR(2),            ######################################################        
       2 NOGSMAF  CHAR(15),           #####################################################        
       2 DADECAF  DEC FIXED(7),       #################################################        
       2 CDNATAF  CHAR(3),            ######################################################        
       2 RSVHIST  CHAR(93);           #####################################################        
         
         
    DCL 1 SSA_S1HISAF,        
         2 FIL1         CHAR (8)       INIT ('S1HISAF'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KS1HISAF'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE1       FIXED (7),        
         2 VALUE2       FIXED BIN (15),        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMBAI - GENERATION LE 16/09/2005 - 15:26        LGTH=00100 */        
         
 /***********************************        
 * SIGNALETIQUE ACTIVITES           *        
 ***********************************/        
 DCL  1 S1CLACT ,                       ###############################################################        
 /*K*/ 2 NOIDCLI  DEC FIXED(9),         /*NO!  !IDENTIFICATION CLIENT */        
       2 TBEGCOD(16)  BIT(1),           ###################################################        
       2 ADREMP  CHAR(50),              ######################################################        
       2 LTACTEMP  CHAR(20),            ####################################################        
       2 FILLER  CHAR(23);              ######################################################        
         
 DCL 1     SSA_S1CLACT,        
      2    FIL1         CHAR (8)       INIT ('S1CLACT'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLACT'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        FIXED(09),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMNET - GENERATION LE 19/11/2009 - 09:28        LGTH=00150 */        
 /****************************************/        
 /* SIGNALETIQUE ACTIVITE PROFESSIONELLE */        
 /****************************************/        
         
 DCL  1 S1CLPRO ,                          ###############################################################        
 /*K*/ 2 DAEFPRO  DEC FIXED(7),            /*DC!  !DA. EFF. COMPL.    */        
 /*K*/ 2 NOSQRUE  BIN FIXED(15),           /*SC!  !NO. SEQ. COMPL.999 */        
       2 CDTYPRO  CHAR(2),                 ######################################################        
       2 CDTYEMP  CHAR(2),                 ######################################################        
       2 CDPOEMP  CHAR(4),                 ######################################################        
       2 LOPOEMP  CHAR(20),                #####################################################        
       2 TXDETVA  DEC FIXED(3),            #################################################        
       2 NUDETVA  CHAR(9),                 ######################################################        
       2 LTCMPRO  CHAR(40),                #####################################################        
       2 LTCMEMP  CHAR(40),                #####################################################        
       2 CDHANDI  CHAR(1),                 ######################################################        
       2 CDRETVA  CHAR(1),                 ######################################################        
       2 CDASTVA  CHAR(1),                 ######################################################        
       2 CDTRANS  CHAR(1),                 ######################################################        
       2 TBEGCOD(16)  BIT(1),              ###################################################        
                                           /*--!  !01:SECTEUR PRIVE   */        
                                           /*--!  !02:SECTEUR PUBLIC  */        
                                           /*--!  !03:SECT.ASSOCIATIF */        
       2 CDFONCT  CHAR(1),                 ######################################################        
       2 CDGEPRO  CHAR(2),                 ######################################################        
       2 CDGEEMP  CHAR(2),                 ######################################################        
       2 CDTAENT  CHAR(2),                 ######################################################        
       2 CDPAYEM  CHAR(3),                 ######################################################        
       2 CDDEFCT  CHAR(2),                 ######################################################        
       2 CDREVME  CHAR(1),                 ######################################################        
       2 CDENFAN  CHAR(1),                 ######################################################        
       2 FILLER  CHAR(5);                  #######################################################        
         
 DCL 1     SSA_S1CLPRO,        
      2    FIL1         CHAR (8)       INIT ('S1CLPRO'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLPRO'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE1       FIXED(07),        
      2    VALUE2       BIN FIXED(15,0),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMROO - Generation le 09/04/2002 - 13:26        Lgth=00100 */        
 /*****************************************        
 * SIGNALETIQUE ACTIVITES COMPLEMENTAIRES *        
 *****************************************/        
 DCL  1 S1CLACC ,                         ###############################################################        
 /*K*/ 2 NOSQACC  BIN FIXED(15),          /*SQ!  !NO DE SEQUENCE      */        
       2 CDTYACC  CHAR(2),                ######################################################        
       2 LTCMACC  CHAR(40),               #####################################################        
       2 TBEGCOD(16)  BIT(1),             ###################################################        
       2 CDTYASC  CHAR(2),                ######################################################        
       2 LTLIACC  CHAR(30),               #####################################################        
       2 FILLER  CHAR(22);                ######################################################        
         
 DCL 1     SSA_S1CLACC,        
       2    FIL1         CHAR (8)       INIT ('S1CLACC'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT ('('),        
       2    FIL3         CHAR (8)       INIT ('KS1CLACC'),        
       2    OPER         CHAR (2)       INIT ('= '),        
       2    VALUE1       BIN FIXED(15,0),        
       2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:34        Lgth=00100 */        
 /***********************************        
 * SIGNALETIQUE DES CONTACTS        *        
 ***********************************/        
 DCL  1 S1CLCON ,                       ###############################################################        
 /*K*/ 2 NOIDCLI  DEC FIXED(9),         /*NO!  !IDENTIFICATION CLIENT */        
       2 TBEGCOD(16)  BIT(1),           ###################################################        
       2 FILLER  CHAR(93);              ######################################################        
         
 DCL 1     SSA_S1CLCON,        
      2    FIL1         CHAR (8)       INIT ('S1CLCON'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLCON'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        FIXED(09),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMNET - GENERATION LE 24/06/2009 - 14:10        LGTH=00200 */        
 /******************************************        
 * SIGNALETIQUE DES ADRESSES               *        
 ******************************************/        
 DCL  1 S1CLADR ,                     ###############################################################        
 /*K*/ 2 CDTYADR  CHAR(2),            /*CD!  !CODE TYPE ADRESSE       */        
 /*K*/ 2 DAEFPRO  DEC FIXED(7),       /*DC!  !DATE EFFEF COMPLEMENTEE */        
       2 LTADNO1  CHAR(30),           #####################################################        
       2 LTADNO2  CHAR(30),           #####################################################        
       2 CDADRSO  CHAR(3),            ######################################################        
       2 LTADADR  CHAR(30),           #####################################################        
       2 NOADCPO  CHAR(5),            ######################################################        
       2 NOADBTE  CHAR(5),            ######################################################        
       2 CDADCPO  CHAR(6),            ######################################################        
       2 LOADLOC  CHAR(20),           #####################################################        
       2 CDADPAY  CHAR(3),            ######################################################        
       2 NUADTEL  CHAR(15),           #####################################################        
       2 NUADFAX  CHAR(15),           #####################################################        
       2 TBEGCOD(16)  BIT(1),         ###################################################        
       2 NOCPLPR  CHAR(10),           #####################################################        
       2 NORULOC  DEC FIXED(7),       #################################################        
       2 NOIDAFP  DEC FIXED(7),       #################################################        
       2 DADMACT  DEC FIXED(7),       #################################################        
       2 FILLER  CHAR(8);             #######################################################        
         
 DCL 1     SSA_S1CLADR,        
       2    FIL1         CHAR (8)       INIT ('S1CLADR'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT ('('),        
       2    FIL3         CHAR (8)       INIT ('KS1CLADR'),        
       2    OPER         CHAR (2)       INIT ('= '),        
       2    VALUE1       CHAR (2),        
       2    VALUE2       FIXED(07),        
       2    FIL4         CHAR (1)       INIT (')');        
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
 /* NRB - TDMNET - GENERATION LE 24/06/2009 - 14:10        LGTH=00100 */        
 /*****************************************        
 * SIGNALETIQUE COMPLEMENT D'ADRESSE      *        
 *****************************************/        
 DCL  1 S1CLCPL ,                        ###############################################################        
       2 CDTYACC  CHAR(2),               ######################################################        
       2 LTCLCPL  CHAR(30),              #####################################################        
       2 TBEGCOD(16)  BIT(1),            ###################################################        
       2 LTADEML  CHAR(50),              #####################################################        
       2 FILLER  CHAR(16);               ######################################################        
         
 DCL 1     SSA_S1CLCPL,        
       2    FIL1         CHAR (8)       INIT ('S1CLCPL'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT (')') ;        
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:34        Lgth=00250 */        
 /******************************************        
 * SIGNALETIQUE DES CONTACTS PRIVILEGIES   *        
 ******************************************/        
 /* 2) PARTICULIER */        
 DCL  1 S1CLCOP ,                         ###############################################################        
       2 NOIDAFF(10)  CHAR(6),            ##################################################        
       2 TBEGCOD(16)  BIT(1),             ###################################################        
       2 FILLER  CHAR(188);               #####################################################        
 DCL 1     SSA_S1CLCOP,        
      2    FIL1         CHAR (8)       INIT ('S1CLCOP '),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT (')');        
 /* NRB - TDMGAS - GENERATION LE 23/11/2009 - 14:03        LGTH=00300 */        
 /****************************/        
 /** COMPLEMENT SIGNALETIQUE */        
 /****************************/        
 DCL  1 S1CLCOM ,                   ###############################################################        
 /*K*/ 2 NOIDCLI  DEC FIXED(9),     /*NO!  !IDENTIFICATION CLIENT     */        
       2 DADECAF  DEC FIXED(7),     #################################################        
       2 DAPERMI  DEC FIXED(7),     #################################################        
       2 TBNBCTC(5),        
        3 CDTYCTC  CHAR(2),         #####################################################        
        3 NBCONTR  DEC FIXED(7),    ################################################        
       2 NBENFAN  BIN FIXED(15),    ################################################        
       2 NBENFHA  BIN FIXED(15),    ################################################        
       2 NBAUTCH  BIN FIXED(15),    ################################################        
       2 NOID_CI  DEC FIXED(7),     #################################################        
       2 DACIDEN  DEC FIXED(7),     #################################################        
       2 DAENVAG  DEC FIXED(7),     #################################################        
       2 NBENVAG  DEC FIXED(3),     #################################################        
       2 TBEGCOD(16)  BIT(1),       ###################################################        
                                    /*--!  !01 A CHARGE               */        
                                    /*--!  !02 CLIENT HANDICAPE       */        
                                    /*--!  !03 MOT PASSE TRANSMIS CL  */        
                                    /*--!  !04 NE PAS VOIR LES CONT   */        
                                    /*--!  !05 ABONNEMENT NEWSLETTER  */        
                                    /*--!  !06 NEWSLETTER HTML        */        
                                    /*--!  !07 COLLECTIV.:PRES.COCOM  */        
                                    /*--!  !08 REFUS ABONNEMENT       */        
                                    /*--!  !   NEWSLETTER             */        
                                    /*--!  !09 ABO. MY ETHIAS         */        
                                    /*--!  !10 ABO. WEB BNQ PARTICUL  */        
                                    /*--!  !11 ABO. PER ETHIAS        */        
                                    /*--!  !12 ABO. WEB BNQ CORPORA.  */        
       2 NOPERMI  CHAR(10),         #####################################################        
       2 CDLGSEC  CHAR(1),          ######################################################        
       2 CDORAFF  CHAR(2),          ######################################################        
       2 CDNATCL  CHAR(3),          ######################################################        
       2 LTPRECL  CHAR(15),         #####################################################        
       2 NUGSMCL  CHAR(15),         #####################################################        
       2 NOSEQUI  CHAR(3),          ######################################################        
                                    /*--!  !GENERE ALEATOIREMENT      */        
       2 CDGSTAM  CHAR(1),          ######################################################        
                                    /*--!  !VAL. POSS : I/R/S/BLANC   */        
                                    /*--!  !I : ISRT 1ERE DEM DE MDP  */        
                                    /*--!  !R : NEW MDP-GARDE USERID  */        
                                    /*--!  !S : SUP MDP POUR USERID   */        
       2 CDGSPWD  CHAR(1),          ######################################################        
                                    /*--!  !EMPECHE LA DEM. DE PLS    */        
                                    /*--!  !MDP SIMULTANEMENT         */        
                                    /*--!  !VAL. POSS : E/U/P/BLANC   */        
                                    /*--!  !E : DMD DE MDP EN COURS   */        
                                    /*--!  !U : USERID EXPEDIE        */        
                                    /*--!  !P : MDP EXPEDIE           */        
       2 CDORIDE  CHAR(1),          ######################################################        
                                    /*--!  !VAL. POSS : ALPHANUM      */        
                                    /*--!  !A: ASSURANCE              */        
                                    /*--!  !B: BANQUE                 */        
       2 CDWOCK1  CHAR(1),          ######################################################        
                                    /*--!  !MIS A JOUR PAR BMP        */        
                                    /*--!  !SEULEMENT                 */        
       2 CDWOCK2  CHAR(1),          ######################################################        
                                    /*--!  !MIS A JOUR PAR BMP OU     */        
                                    /*--!  !PAR GESTIONNAIRE AUTOR.   */        
       2 CDETCIV  CHAR(2),          ######################################################        
       2 CDCHAL1  CHAR(2),          ######################################################        
       2 CDCHAL2  CHAR(3),          ######################################################        
       2 CDMAJCL  CHAR(2),          ######################################################        
       2 LTMAJCL  CHAR(30),         #####################################################        
       2 AFFINIT(5),        
        3 CDAFIN1  CHAR(2),         #####################################################        
        3 CDAFIN2  CHAR(15),        ####################################################        
        3 CDFAMIL  CHAR(1),         #####################################################        
       2 CDCIDEN  CHAR(1),          ######################################################        
       2 DADERMS  PIC'(07)9',       ###################################################        
       2 NBCONMS  PIC'(05)9',       ###################################################        
       2 DAEXPCI  PIC'(07)9',       ###################################################        
       2 DAABNWL  PIC'(07)9',       ###################################################        
       2 CDSTACI  CHAR(1),          ######################################################        
       2 DASTACI  PIC'(07)9',       ###################################################        
       2 NOBCEAF  CHAR(10),         #####################################################        
       2 CDCTF2F  CHAR(1),          ######################################################        
       2 CDPEP  CHAR(1),            ########################################################        
       2 CDCOMMEN  CHAR(1),         #####################################################        
       2 CDPTIENF  CHAR(1),         #####################################################        
       2 CDEINVO  CHAR(1),          ######################################################        
       2 CDGEMAG  CHAR(1),          ######################################################        
       2 CDMLEIN  CHAR(1);          ######################################################        
         
  DCL 1     SSA_S1CLCOM,        
       2    FIL1         CHAR (8)       INIT ('S1CLCOM'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT ('('),        
       2    FIL3         CHAR (8)       INIT ('KS1CLCOM'),        
       2    OPER         CHAR (2)       INIT ('= '),        
       2    VALUE        FIXED(09),        
       2    FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMFOG - Generation le 26/04/2001 - 15:11        Lgth=00100 */        
 /******************************************        
 * SIGNALETIQUE DES RELATIONS              *        
 ******************************************/        
 DCL  1 S1CLREL ,                          ###############################################################        
 /*K*/ 2 NOSEQRE  BIN FIXED(15),           /*SQ!  !NUM. DE SEQUENCE   */        
       2 NOIDREL  CHAR(2),                 ######################################################        
       2 CDTYREL  CHAR(1),                 ######################################################        
       2 NOCLREL  DEC FIXED(7),            #################################################        
       2 TBEGCOD(16)  BIT(1),              ###################################################        
       2 REC_VOTE  CHAR(27),               ####################################################        
       2 DAASSEM  DEC FIXED(7),            #################################################        
       2 FILLER  CHAR(58);                 ######################################################        
 DCL 1     SSA_S1CLREL,        
      2    FIL1         CHAR (8)       INIT ('S1CLREL'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLREL'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        BIN FIXED(15,0),        
      2    FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:35        Lgth=00100 */        
 /*****************************************        
 * SIGNALETIQUE AUTRES PRENOMS            *        
 *****************************************/        
 DCL  1 S1CLPRE ,                           ###############################################################        
       2 LTPRCL1  CHAR(15),                 #####################################################        
       2 LTPRCL2  CHAR(15),                 #####################################################        
       2 TBEGCOD(16)  BIT(1),               ###################################################        
       2 FILLER  CHAR(68);                  ######################################################        
 DCL 1     SSA_S1CLPRE,        
       2    FIL1         CHAR (8)       INIT ('S1CLPRE'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT (')') ;        
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:35        Lgth=00100 */        
 /*****************************************        
 * SIGNALETIQUE ADRESSES E_MAIL           *        
 *****************************************/        
 DCL  1 S1CLEML ,                     ###############################################################        
       2 DAADEML  DEC FIXED(7),       #################################################        
       2 TBEGCOD(16)  BIT(1),         ###################################################        
                                      /*--!  !1 - ADRESSE INACTIVE    */        
       2 LTADEML  CHAR(50),           #####################################################        
       2 LTORIGI  CHAR(10),           #####################################################        
       2 CDPREML  CHAR(1),            ######################################################        
       2 FILLER  CHAR(33);            ######################################################        
 DCL 1     SSA_S1CLEML,        
       2    FIL1         CHAR (8)       INIT ('S1CLEML'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT (')') ;        
 /* NRB - TDMGAS - GENERATION LE 12/05/2004 - 15:23        LGTH=00200 */        
 /**********************************************        
 * SIGNALETIQUE DES DEVIS INTERNET ET AUTRES  *        
 **********************************************/        
 DCL  1 S1CLDEV ,                     ###############################################################        
 /*KC*/2 DADVINT  DEC FIXED(11),      /*NO!  !DATE+SEQUENCE COMPL     */        
 /*F*/ 2 NODVINT  DEC FIXED(13),      /*NO!  !NUMeRO DEVIS            */        
       2 CDIDINT  DEC FIXED(9),       #################################################        
       2 HHMMINT  DEC FIXED(5),       #################################################        
       2 TBEGCOD(16)  BIT(1),         ###################################################        
                                      /*--!  ! 1 - INTERNET           */        
                                      /*--!  ! 2 - DELETE MYSMAP      */        
                                      /*--!  ! 3 - SAVE CRM PUR       */        
                                      /*--!  ! 4 - REMPLACE           */        
                                      /*--!  ! 5 - SAUVEGARDE MY SMAP */        
                                      /*--!  ! 6 - Souscription       */        
       2 CDTYPDV  CHAR(2),            ######################################################        
       2 CDORIDV  CHAR(2),            ######################################################        
       2 CDTYPRO  CHAR(7),            ######################################################        
         
       2 FILLER  CHAR(166);           #####################################################        
         
 DCL 1     SSA_S1CLDEV,        
      2    FIL1         CHAR (8)       INIT ('S1CLDEV'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLDEV'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        FIXED(11),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMLIS - GENERATION LE 03/02/2009 - 15:12        LGTH=00110 */        
 /**************************************/        
 /*  DSM22 - DETAIL MEMO GESTIONNAIRE  */        
 /*  HDAM     SEGMENT : 110 BYTES      */        
 /**************************************/        
 /* AJOUT CDTYACT (TDMLIS 02-02-09)    */        
 /**************************************/        
         
 DCL  1 SMMEMOG ,                    ###############################################################        
                                     /*DB!  !DCR39   !SMMEMOG         */        
                                     /*DB!  !DDO10   !SMMEMOG         */        
                                     /*DB!  !DSM98   !SMMEMOG         */        
 /*K*/ 2 NOIDMEM  DEC FIXED(9),      /*NO!  !EX + GESTIONNAIRE        */        
 /*K*/ 2 NOSQMEM  BIN FIXED(15),     /*NO!  !NO SEQUENCE COMPL. 32767 */        
       2 DAOPEVN  DEC FIXED(7),      #################################################        
       2 CDNATEV  CHAR(3),           ######################################################        
       2 NOTIERL  CHAR(3),           ######################################################        
       2 TBEGCOD(16)  BIT(1),        ###################################################        
                                     /*--!  !01 : INTITULE=MESSAGE    */        
                                     /*--!  !02 : INTITULE AVEC VAR.  */        
                                     /*--!  !03 : BLANCHIMENT ARGENT  */        
                                     /*--!  !06 : FICHIER ATTACH      */        
                                     /*--!  !07 : LIGN NON VISIB NET  */        
                                     /*--!  !09 : LIGNE VISIBLE NET   */        
                                     /*--!  !10 : DOCUMENT DOC1       */        
                                     /*--!  !11 : LIGNE RETIREE       */        
                                     /*--!  !12 : LETTRE LG PORTRAIT  */        
                                     /*--!  !13 : LETTRE LG PAYSAGE   */        
                                     /*--!  !14 : NOMGINF !! NOTXTEV  */        
                                     /*--!  !15 : NOSQINT !! NOSQSUJ  */        
                                     /*--!  !     INTERVENTION+ SUJET */        
                                     /*--!  !     2 FB15 SUR NOMGINF  */        
                                     /*--!  !16 : NON MODIF           */        
       2 LTNATEV  CHAR(40),          #####################################################        
       2 NOEVNRL  BIN FIXED(15),     ################################################        
       2 NOTXTEV  BIN FIXED(15),     ################################################        
       2 CDORGEV  CHAR(8),           ######################################################        
       2 CDTTAPP  CHAR(2),           ######################################################        
       2 CDMMSEL  CHAR(3),           ######################################################        
       2 CDUTTRN  CHAR(8),           ######################################################        
       2 NOMGINF  CHAR(4),           ######################################################        
       2 CDTYCOL  CHAR(1),           ######################################################        
       2 FILLER  CHAR(17),           ######################################################        
       2 NODOCEV  DEC FIXED(7);      #################################################        
         
   DCL      NOTXTEV_MEMOG      CHAR(2)  BASED(ADDR(SMMEMOG.NOTXTEV));        
         
   DCL SMMEMOG_LTNATEV_R_1_4  CHAR(4)  BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_1_6  CHAR(6)  BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_1_11 CHAR(11) BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_1_16 CHAR(16) BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_5    CHAR(36)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),4));        
   DCL SMMEMOG_LTNATEV_R_5_2  CHAR(2)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),4));        
   DCL SMMEMOG_LTNATEV_R_7_1  CHAR(1)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),6));        
   DCL SMMEMOG_LTNATEV_R_8    CHAR(33)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_8_5  CHAR(5)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_8_7  CHAR(7)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_8_8  CHAR(8)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_9_8  CHAR(8)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),8));        
   DCL SMMEMOG_LTNATEV_R_12   CHAR(29)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),11));        
   DCL SMMEMOG_LTNATEV_R_12_2 CHAR(2)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),11));        
   DCL SMMEMOG_LTNATEV_R_16_3 CHAR(3)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),15));        
   DCL SMMEMOG_LTNATEV_R_18_8 CHAR(8)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),17));        
         
    DCL 1   SSA_SMMEMOG,        
         2  FIL1        CHAR (8)     INIT ('SMMEMOG'),        
         2  FIL2        CHAR (1)     INIT ('*'),        
         2  CC          CHAR (3)     INIT ('---'),        
         2  PAR         CHAR (1)     INIT ('('),        
         2  FIL3        CHAR (8)     INIT ('KSMMEMOG'),        
         2  OPER        CHAR (2)     INIT ('= '),        
         2  VALUE0      FIXED DEC(9),        
         2  VALUE1      BIN FIXED(15),        
         2  FIL4        CHAR (1)     INIT (')');        
   /* LIGNE  MEMO AFF/POL/SIN FS MEMO */        
 /* NRB - TDMDOD - GENERATION LE 17/08/2004 - 10:48        LGTH=00110 */        
 /**************************************/        
 /*  DSM22 - HEADER MEMO GESTIONNAIRE  */        
 /*  HDAM         SEGMENT : 110 BYTES  */        
 /*  --------------------------------  */        
 /*  TDMDOD 17/08/04 AJOUT NOSQREB     */        
 /**************************************/        
         
 DCL  1 SMMEMOH ,                    ###############################################################        
                                     /*DB!  !DCR39   !SMMEMOG         */        
                                     /*DB!  !DDO10   !SMMEMOG         */        
                                     /*DB!  !DSM98   !SMMEMOG         */        
 /*K*/ 2 NOIDMEM  DEC FIXED(9),      /*NO!  !EX + GESTIONNAIRE        */        
 /*K*/ 2 NOSQMEM  BIN FIXED(15),     /*NO!  !NO SEQUENCE COMPL. 32767 */        
       2 NBSQMEM  BIN FIXED(15),     ################################################        
       2 NBLETEM  BIN FIXED(15),     ################################################        
       2 NBSQEVN  BIN FIXED(15),     ################################################        
       2 NBSQDEM  BIN FIXED(15),     ################################################        
       2 NBLIRET  BIN FIXED(15),     ################################################        
       2 NOSQREM  BIN FIXED(15),     ################################################        
       2 NBSQINT  BIN FIXED(15),     ################################################        
       2 NBSQRES(01)  BIN FIXED(15), ############################################        
       2 NOTXNFO  CHAR(2),           ######################################################        
       2 NOSQREB  BIN FIXED(15),     ################################################        
       2 FILLER  CHAR(51),           ######################################################        
       2 CDDBARC  CHAR(1),           ######################################################        
       2 TBEGSCR(64)  BIT(1),        ###################################################        
       2 TBEGCOD(16)  BIT(1),        ###################################################        
                                     /*--!  !08 = ANNULE              */        
                                     /*--!  !09 = PAS DE SIGNAL       */        
                                     /*--!  !SINISTRE                 */        
       2 DABLCMM  CHAR(4),           ######################################################        
       2 CDEGBLC  CHAR(1),           ######################################################        
       2 CDCMGES  CHAR(6),           ######################################################        
       2 DACLOMM  CHAR(4),           ######################################################        
       2 NOTXTHD  CHAR(2),           ######################################################        
       2 NODOCEM  DEC FIXED(7);      #################################################        
   /* HEADER MEMO AFF/POL/SIN FS MEMO */        
         
 DCL 1  KS1010J,        
         
      2  PTRPCB, ################################################################        
       3 DEU02PCB      PTR,          #####################################################        
       3 DC105PCB      PTR,          #####################################################        
       3 DS101PCB      PTR,          #####################################################        
       3 DS101$PCB     PTR,          #####################################################        
       3 DS102PCB      PTR,          #####################################################        
       3 DS104PCB      PTR,          #####################################################        
       3 DS104$PCB     PTR,          #####################################################        
       3 DS105PCB      PTR,          #####################################################        
       3 DS105$PCB     PTR,          #####################################################        
       3 DS106PCB      PTR,          #####################################################        
       3 DS106BPCB     PTR,          #####################################################        
       3 DS108PCB      PTR,          #####################################################        
       3 DS108$PCB     PTR,          #####################################################        
       3 DS125PCB      PTR,          #####################################################        
       3 DS125$PCB     PTR,          #####################################################        
       3 DS128PCB      PTR,          #####################################################        
       3 DS132PCB      PTR,          #####################################################        
       3 DS134PCB      PTR,          #####################################################        
       3 DS137PCB      PTR,          #####################################################        
       3 DSM22PCB      PTR,          #####################################################        
       3 DS149PCB      PTR,          #####################################################        
         
      2  INPUT, #################################################################        
       3 NOIDAFF       DEC FIXED(7), ############################################        
       3 TBEGCOD_I(64) BIT(1),       ##################################################        
                                     /* 01= screen button SIG         */        
                                     /* 02= ...                       */        
                                     /* 04= devis sauve my ethias     */        
                                     /* 13= screen button EML         */        
       3 CDCMGES       CHAR(08),     ################################################        
       3 CDOPTRN       CHAR(05),     ################################################        
       3 CDTYPOP       CHAR(01),     ################################################        
       3 CDLGTRN       CHAR(01),     ################################################        
       3 CDNATEV       CHAR(03),     ################################################        
       3 LTNATEV       CHAR(40),     ################################################        
       3 DEVIS,        
         4 NODVINT     PIC'(13)9',   ##############################################        
         4 CDIDINT     DEC FIXED(9), ############################################        
         4 CDTYPDV     CHAR(02),     ################################################        
         4 CDORIDV     CHAR(02),     ################################################        
         4 CDTYPRO     CHAR(07),     ################################################        
         
 /*********************************************************************/        
 /* DS101  :                                                          */        
 /*          S1AFFIL                                                  */        
 /*                 S1POLIC                                           */        
 /*                        S1ADPOL                                    */        
 /*                 S1ADAFF                                           */        
 /*                 S1ADCOU                                           */        
 /*                 S1RELAT                                           */        
 /*                 S1ENSEM                                           */        
 /*********************************************************************/        
       3 S1AFFIL_I     LIKE S1AFFIL, ############################################        
       3 S1POLIC_I     LIKE S1POLIC,        
       3 S1ADPOL_I     LIKE S1ADPOL,        
       3 S1ADAFF_I     LIKE S1ADAFF,        
       3 S1ADCOU_I     LIKE S1ADCOU,        
       3 S1RELAT_I     LIKE S1RELAT,        
       3 S1ENSEM_I     LIKE S1ENSEM,        
 /*********************************************************************/        
 /* DS102  :                                                          */        
 /*          S1COMPL                                                  */        
 /*********************************************************************/        
       3 S1COMPL_I     LIKE S1COMPL,        
 /*********************************************************************/        
 /* DS128  :                                                          */        
 /*          S1HISAF                                                  */        
 /*********************************************************************/        
       3 S1HISAF_I     LIKE S1HISAF,        
 /*********************************************************************/        
 /* DS132  :                                                          */        
 /*          S1CLACT                                                  */        
 /*                 S1CLPRO                                           */        
 /*                 S1CLACC                                           */        
 /*********************************************************************/        
       3 S1CLACT_I     LIKE S1CLACT,        
       3 S1CLPRO_I     LIKE S1CLPRO,        
       3 S1CLACC_I     LIKE S1CLACC,        
 /*********************************************************************/        
 /* DS134  :                                                          */        
 /*          S1CLCON                                                  */        
 /*                 S1CLADR                                           */        
 /*                 S1CLCPL                                           */        
 /*                 S1CLCOP                                           */        
 /*********************************************************************/        
       3 S1CLCON_I     LIKE S1CLCON,        
       3 S1CLADR_I     LIKE S1CLADR,        
       3 S1CLCPL_I     LIKE S1CLCPL,        
       3 S1CLCOP_I     LIKE S1CLCOP,        
 /*********************************************************************/        
 /* DS137  :                                                          */        
 /*          S1CLCOM                                                  */        
 /*                 S1CLREL                                           */        
 /*                 S1CLPRE                                           */        
 /*                 S1CLEML                                           */        
 /*********************************************************************/        
       3 S1CLCOM_I     LIKE S1CLCOM,        
       3 S1CLREL_I     LIKE S1CLREL,        
       3 S1CLPRE_I     LIKE S1CLPRE,        
       3 S1CLEML_I     LIKE S1CLEML,        
       3 S1CLDEV_I     LIKE S1CLDEV,        
 /* INPUT MY SMAP */        
       3 MYSMAP,        
         4 CDRSAFF   CHAR(01),        
         4 CDSEXAF   CHAR(01),        
         4 CDLGEAF   CHAR(01),        
         4 CDECVAF   CHAR(01),        
         4 NOTELAF   CHAR(13), ###########################        
         4 NOTEL2F   CHAR(13), ############################        
         4 NOTEL3F   CHAR(13), ########################        
         4 LTEMAIL   CHAR(50),        
         4 LTNMAFF   CHAR(30),        
         4 LTRUEAF   CHAR(25),        
         4 NOHA1AF   BIN FIXED(15),        
         4 NOHA2AF   CHAR(4),        
         4 CDCPOAF   CHAR(06),        
         4 LTLOCAF   CHAR(25),        
         4 CDPAYAF   CHAR(03),        
         4 CDTYPRO   CHAR(02),        
         4 CDGEPRO   CHAR(02),        
         4 NORULOC   FIXED DEC (7),        
         4 DANAIAF   FIXED DEC (7),        
      2 OUTPUT, #################################################################        
       3 TBEGCOD_O(64) BIT(1),       ##################################################        
                                     /* 01= UPDATE EFFECTIF, CAR #    */        
                                     /* 02=...                        */        
         
       3 S1AFFIL_O     LIKE S1AFFIL, ############################################        
       3 S1POLIC_O     LIKE S1POLIC,        
       3 S1ADPOL_O     LIKE S1ADPOL,        
       3 S1ADAFF_O     LIKE S1ADAFF,        
       3 S1ADCOU_O     LIKE S1ADCOU,        
       3 S1RELAT_O     LIKE S1RELAT,        
       3 S1ENSEM_O     LIKE S1ENSEM,        
       3 S1COMPL_O     LIKE S1COMPL,        
       3 S1HISAF_O     LIKE S1HISAF,        
       3 S1CLACT_O     LIKE S1CLACT,        
       3 S1CLPRO_O     LIKE S1CLPRO,        
       3 S1CLACC_O     LIKE S1CLACC,        
       3 S1CLCON_O     LIKE S1CLCON,        
       3 S1CLADR_O     LIKE S1CLADR,        
       3 S1CLCPL_O     LIKE S1CLCPL,        
       3 S1CLCOP_O     LIKE S1CLCOP,        
       3 S1CLCOM_O     LIKE S1CLCOM,        
       3 S1CLREL_O     LIKE S1CLREL,        
       3 S1CLPRE_O     LIKE S1CLPRE,        
       3 S1CLEML_O     LIKE S1CLEML,        
       3 S1CLDEV_O     LIKE S1CLDEV,        
       3 MYSMAP,        
         4 DADUJOU   CHAR(10),        
         4 NOIDAFF   CHAR(10),        
         4 CDRSAFF   CHAR(01),        
         4 LTTITAF   CHAR(15),        
         4 LTNMAFF   CHAR(50),        
         4 LTRUEAF   CHAR(50),        
         4 LTLOCAF   CHAR(50),        
         4 LTPAYAF   CHAR(50),        
         4 CDSEXAF   CHAR(01),        
         4 LTSEXAF   CHAR(10),        
         4 CDLGEAF   CHAR(01),        
         4 LTLGEAF   CHAR(15),        
         4 DANAIAF   CHAR(10),        
         4 CDECVAF   CHAR(01),        
         4 LTECVAF   CHAR(15),        
         4 NOTELAF   CHAR(13), ###########################        
         4 NOTEL2F   CHAR(13), ############################        
         4 NOTEL3F   CHAR(13), ########################        
         4 LTEMAIL   CHAR(50),        
         4 LTRUEAD   CHAR(50),        
         4 NOHA1AD   CHAR(06),        
         4 NOHA2AD   CHAR(06),        
         4 CDPOSAD   CHAR(06),        
         4 LTLOCAD   CHAR(50),        
         4 CDPAYAF   CHAR(03),        
         4 CDTYPRO   CHAR(02),        
         4 CDGEPRO   CHAR(02),        
         4 NOIDAFF_F7 FIXED(7),        
         4 RETOUR,        
          5 TBBOCHA(10) BIT (01),        
       3 DEVIS,        
         4 FIND_DEV  CHAR(1),        
      2 *              CHAR(0);        
         
 /*----------------------------------------------------REDEFINITIONS--*/        
 DCL  S1AFFIL_IR       CHAR( STG(KS1010J.INPUT .S1AFFIL_I))        
                      BASED(ADDR(KS1010J.INPUT .S1AFFIL_I));        
 DCL  S1ADAFF_IR       CHAR( STG(KS1010J.INPUT .S1ADAFF_I))        
                      BASED(ADDR(KS1010J.INPUT .S1ADAFF_I));        
 DCL  S1AFFIL_OR       CHAR( STG(KS1010J.OUTPUT.S1AFFIL_O))        
                      BASED(ADDR(KS1010J.OUTPUT.S1AFFIL_O));        
 DCL  S1ADAFF_OR       CHAR( STG(KS1010J.OUTPUT.S1ADAFF_O))        
                      BASED(ADDR(KS1010J.OUTPUT.S1ADAFF_O));        
 /*********************************************************************/        
 /* METHODES:                                                         */        
 /*                                                                   */        
 /* - CREATE_PROSPECT_NET : CREATION D'UN NOUVEL AFFILIE VIA LE NET   */        
 /*                         INPUT: NOIDAFF   = 0                      */        
 /*                                INFORMATIONS A INSERER             */        
 /*                         OUTPUT :                                  */        
 /*                                                                   */        
 /*********************************************************************/        
 /* CODES RETOURS:                                                    */        
 /*                                                                   */        
 /* - 001 : LA METHODE N'EXISTE PAS                                   */        
 /* - 002 : UN POINTEUR PCB N'EST PAS INITIALISE                      */        
 /* - 003 : LA DB MEMO EST FULL                                       */        
 /* - 004 : NOIDAFF N'EST PAS 0 ==> CREATION PROSPECT NET IMPOSSIBLE  */        
 /*********************************************************************/        
         
 DCL XSM702  ENTRY;           ####################################################        
 /*********************************************************************/        
 /* INTERFACE POUR ROUTINE XSM702 IMPRESSION DE N'IMPORTE QUEL DEVIS  */        
 /*-------------------------------------------------------------------*/        
 /* TDMXXX    DATE    ! COMMENTAIRE                                   */        
 /* ------ ---------- ! --------------------------------------------- */        
 /* TDMTHO 04/02/2005 : AJOUT DEFINITION DE CODE POUR CDAPPEL (W ET S)*/        
 /* TDM... ../../.... :                                               */        
 /*********************************************************************/        
 DCL 1     JSM186,        
 /*-------------------- E N T R E E ----------------------------------*/        
       2   PTRPCB,                     ##############################################################        
        3  DBPCB(10)     PTR ,         ##################################################        
                                       /* 1=DSM88                     */        
                                       /* 2=DC105                     */        
                                       /* 3=DS101                     */        
                                       /* 4=DS102                     */        
                                       /* 10=UTILISe PAR IB/PK        */        
        3  WLTNMSCR_PTR  PTR ,         ##################################################        
        3  WLTNMSCR2_PTR PTR ,         ##################################################        
       2   ENTREE,                     ##############################################################        
        3  CDAPPEL       CHAR(01),     ##############################################        
                                       /* T=TRANSACTION               */        
                                       /* R=RELANCE                   */        
                                       /* W=DEVIS INTERNET PAR MAIL   */        
                                       /* S=SOUSCRIPTION INTERNET     */        
        3  CDTYLET(10)   CHAR(01),     ##############################################        
                                       /* 1=LETTRE ACCOMPAGNEMENT     */        
                                       /* 2=LETTRE DEVIS(REMISE PRIX) */        
                                       /* 3=LETTRE RENON 1            */        
                                       /* 4=LETTRE RENON 2            */        
                                       /* 5=LETTRE PROPOSITON         */        
        3 KEYDEVIS,                    #############################################################        
         4 CDTYKEY       CHAR(1),      ###############################################        
         4 NOIDKEY       DEC FIXED(9), ##########################################        
         4 NOSQDEV       DEC FIXED(7), ##########################################        
         4 NOSQTXT       DEC FIXED(3), ##########################################        
        3  CDLGTRN       PIC'9',       ################################################        
        3  TBTYPAF       BIT(240),     ##############################################        
 /*-------------------- S O R T I E ----------------------------------*/        
       2   SORTIES,                    #############################################################        
         3 NOIDAFF       DEC FIXED(7), ##########################################        
         3 CDCMGES       CHAR(08),     ##############################################        
       2   RETOURS,        
        3  CDRTPGM       CHAR (6),     ##############################################        
        3  DBPTR         PTR,          ###################################################        
        3  LASTDLI       CHAR (10);    #############################################        
         
 DCL 01    JSM186_IB,        
       02  DIB11FPCB     PTR,          ##################################################        
       02  DIB11NPCB     PTR,          ##################################################        
       02  DIB11APCB     PTR,          ##################################################        
       02  TYAFFPO       CHAR(03),     ##############################################        
       02  TYPOLAV       CHAR(03),     ##############################################        
       02  LTOBJOP       CHAR(75),     ##############################################        
       02  FILLER        CHAR(50);        
         
 DCL XSM664     ENTRY;        #########################################        
 /*********************************************************************        
 *     INTERFACE ROUTINE XSM664 = PSM300 BATCH                        *        
 *********************************************************************/        
         
 DCL PRBATCH FILE RECORD OUTPUT;        
         
 DCL 1  JSM171 ##############,        
       2   PTRPCB,                     #########################################        
         3 IOPCB         PTR,        
         3 ALTRPCB       PTR,        
         3 TABPCB        PTR,        
         3 CLAUSPCB      PTR,        
         3 DSM60PCB      PTR,        
         3 DA106PCB      PTR,        
         3 DSM19PCB      PTR,        
         3 DSM01PCB      PTR,        
         3 DSM06PCB      PTR,        
         3 DS101PCB      PTR,        
         3 DS102PCB      PTR,        
         3 DS103PCB      PTR,        
         3 DA105PCB      PTR,        
         3 DBAT01PCB     PTR,        
         3 DBAT03PCB     PTR,        
         3 DBAT06PCB     PTR,        
         3 DAC02PCB      PTR,        
         3 DAC03PCB      PTR,        
         3 DIE01PCB      PTR,        
         3 DBAT02PCB     PTR,        
         3 DMS02PCB      PTR,        
         3 DSA03PCB      PTR,        
         3 DMS05PCB      PTR,        
         3 DS113PCB      PTR,        
         3 DMS03PCB      PTR,        
         3 DSM22PCB      PTR,        
         3 DMD01PCB      PTR,        
         3 DMD02PCB      PTR,        
         3 DCO01PCB      PTR,        
         3 DSM20PCB      PTR,        
         3 DSM09PCB      PTR,        
         3 DA201PCB      PTR,        
         3 DD201PCB      PTR,        
         3 DD106PCB      PTR,        
         3 DD105PCB      PTR,        
         3 DS124PCB      PTR,        
         3 DSM61PCB      PTR,        
         3 DI105PCB      PTR,        
         3 DI106PCB      PTR,        
         3 DT105PCB      PTR,        
         3 DT106PCB      PTR,        
         3 DT201PCB      PTR,        
         3 DT202PCB      PTR,        
         3 DCR03PCB      PTR,        
         3 DCR04PCB      PTR,        
         3 DSA01PCB      PTR,        
         3 DSM62PCB      PTR,        
         3 DSM63PCB      PTR,        
         3 DSM64PCB      PTR,        
         3 DSM65PCB      PTR,        
         3 DSM66PCB      PTR,        
         3 DSM67PCB      PTR,        
         3 DSM68PCB      PTR,        
         3 DSM69PCB      PTR,        
         3 DMS01PCB      PTR,        
         3 DS137PCB      PTR,        
         3 DSM43PCB      PTR,        
         3 DA202PCB      PTR,        
         3 DA203PCB      PTR,        
         3 DS119PCB      PTR,        
         3 DSM93PCB      PTR,        
         3 DIB01PCB      PTR,        
         3 DIB02PCB      PTR,        
         3 DIB03PCB      PTR,        
         3 DIB11PCB      PTR,        
         3 DT505PCB      PTR,        
         3 DSMB1PCB      PTR,        
         3 DSMB2PCB      PTR,        
         3 TABGPCB       PTR,        
         3 DA105GPCB     PTR,        
         3 DS101GPCB     PTR,        
         3 DSM22GPCB     PTR,        
         3 DSMA1PCB      PTR,        
         3 DSMB0PCB      PTR,        
         3 DSMB9PCB      PTR,        
         3 DIB05PCB      PTR,        
         3 DD501PCB      PTR,        
         3 DS134PCB      PTR,        
         3 RESERVE(122)  PTR,        
       2 NOIDAFF           FIXED(7),        
       2 NOIDPOL           FIXED(8),        
       2 NOIDSIN           FIXED(9),        
       2 CDCMGES           CHAR(8),        
       2 CDOPTRN           CHAR(5),        
       2 MEMOCMD,        
        3 CDNATOP             CHAR(1),       #######################################        
        3 CDTYPOP             CHAR(1),       ###################################        
        3 CDOBJOP             CHAR(3),       ###################################        
       2 NOSQMEM           FIXED BIN(15),    ##################################        
       2 WLTNMSCR          CHAR(2000),        
       2 WLTNMSCR2         CHAR(10000),        
       2 NBLIGNE           FIXED(5),        
       2 CDSCTRN           CHAR(01),    ################################        
       2 NORFPRT           CHAR(08),    ################################        
       2 CDRTPGM           CHAR(02),    ################################        
       2 CDTTAPP           CHAR(02),    ################################        
       2 LASTDLI           CHAR(08),        
       2 NBVAR             FIXED(5),        
       2 LTOBJOP           CHAR(75),        
       2 LTSCTRN           CHAR(04),    ################################        
       2 CDSIGNA           CHAR(01),    ##########################################        
       2 CDSIGSV           CHAR(04),    ##########################################        
       2 NOIDCLI           CHAR(08),        
       2 LTINTKN           CHAR(20),    ##########################################        
       2 CDIMPDV           CHAR(01),    ##########################################        
       2 RESERVE           CHAR(46);    ##########################################        
 DCL CDOBJOP_R1   FIXED BIN(15) DEF JSM171.CDOBJOP;        
 DCL PTRPCB_TAB(200) PTR BASED(ADDR(JSM171.PTRPCB));        
 /*********************************************************************/        
 /*                                                                   */        
 /*   INTERFACE POUR ENVOI D'UN MESSAGE                               */        
 /*   1 DESTINATAIRE OU 1 TABLE DE DESTINATAIRES                      */        
 /*   ==========================================                      */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1    JSM037,        
 /*------------------------- I N P U T -------------------------------*/        
      2   PTRPCB,                         ##############################################################        
       3  IO_PCB           PTR,           ################################################        
       3  C105PCB          PTR,           ################################################        
       3  SM12PCB          PTR,           ################################################        
       3  SM18PCB          PTR,           ################################################        
       3  SM19PCB          PTR,           ################################################        
       3  SM60PCB          PTR,           ################################################        
       3  SM22PCB          PTR,           ################################################        
       3  S124MPCB         PTR,           ################################################        
       3  SM61PCB          PTR,           ################################################        
       3  SM62PCB          PTR,           ################################################        
       3  SM63PCB          PTR,           ################################################        
       3  SM64PCB          PTR,           ################################################        
       3  SM65PCB          PTR,           ################################################        
       3  SM66PCB          PTR,           ################################################        
       3  SM67PCB          PTR,           ################################################        
       3  SM68PCB          PTR,           ################################################        
       3  SM69PCB          PTR,           ################################################        
       3  SM01PCB          PTR,           ################################################        
       3  A106PCB          PTR,           ################################################        
       3  T106PCB          PTR,           ################################################        
       3  D106PCB          PTR,           ################################################        
       3  I106PCB          PTR,           ################################################        
       3  SA03PCB          PTR,           ################################################        
       3  MS05PCB          PTR,           ################################################        
       3  AC03PCB          PTR,           ################################################        
       3  MD02PCB          PTR,           ################################################        
       3  SMB2PCB          PTR,           ################################################        
       3  S103PCB          PTR,           ################################################        
       3  SMA1PCB          PTR,           ################################################        
       3  SMB0PCB          PTR,           ################################################        
       3  SM75PCB          PTR,           ################################################        
       3  SMB4PCB          PTR,           ################################################        
       3  SMB6PCB          PTR,           ################################################        
      2   SMAPCR           BIT (1),       ############################################        
         
 /*------------------------ O U T P U T -----------------------------*/        
      2   RETURN_CODE,                    #########################################################        
       3  NOLETTR          FIXED DEC(11), ######################################        
       3  CDRTPGM          CHAR (6),      ###########################################        
       3  DBPTR            PTR,           ################################################        
       3  LASTDLI          CHAR (10),     ##########################################        
       3  NOIDREF          CHAR (12),     ##########################################        
       3  NOSQMEM          FIXED BIN(31), ######################################        
         
 /*------------------------             -----------------------------*/        
      2   CDTYINP          CHAR (01),     ##########################################        
                                          /* I=INTERFACE F=FICHIER   */        
      2   NBLIGNI          PIC '999',     ##########################################        
                                          /* 0 SI MESSAGE COURT      */        
      2   HEADER,        
       3  CDTYPMS          CHAR (01),     ##########################################        
                                          /* POUR MESSAGERIE OU MEMOS*/        
                                          /* M MESSAGERIE NORMALE    */        
                                          /* T MESSAGERIE LONGUE     */        
                                          /* E LETTRE 72 CARAC/CO    */        
                                          /* F LETTRE 165 CARAC/COL  */        
                                          /* G LETTRE 165 CARAC/COL  */        
       3  DAVISMS          PIC '(6)9',    #########################################        
       3  NOIDTAB          CHAR (08),     ##########################################        
                                       /* -SOIT UNE TABLE DE GESTION.*/        
                                       /* -SOIT UN NO GEST. : PXXXXX */        
                                       /* -SOIT UNE AUTRE MESSAGERIE */        
       3  CDCMGES          CHAR (08),  ##########################################        
                                       /* EXEMPLE : ' 1706004'       */        
       3  LTMESSA          CHAR (40),  ##########################################        
                                       /* EGALEMENT INSCRIT AU MEMO  */        
       3  CDMMDST          CHAR (12),  ##########################################        
                                       /* MM AFF. SMAP: APXXXXX      */        
                                       /* MM AFF. MEGA: AJJMMAASQ    */        
                                       /* MM POL.     : PNNNNNNNN    */        
                                       /* MM SIN.     : SKKSSSSSSSMM */        
                                       /* MM GES.     : GPXXXXX      */        
                                       /* MM FAM MS   : FNNNNNNN     */        
       3  CDSCTRN          CHAR (01),  ##########################################        
       3  CDPARMT          CHAR (01),  ##########################################        
       3  CDLGLTT          CHAR (01),  ##########################################        
       3  CDIMPME          CHAR (01),  ##########################################        
      2   TBLIGNI,        
       3  LIGNI (100)      CHAR (165), #########################################        
                                       /* CARACTERE DE SAUT + TEXTE  */        
      2   CDTYPOL          CHAR (02),  ##########################################        
      2   NOIDFAM          PIC '(7)9', #########################################        
      2   NOIDAFF          PIC '(7)9', #########################################        
      2   NOIDPOL          PIC '(8)9', #########################################        
      2   NOIDSIN          PIC '(9)9', #########################################        
      2   SWOBJAT          CHAR(01),   ###########################################        
                                       /* 'M'=REC MAILBOX FICHIER    */        
                                       /* 'D'=REC MAILBOX DOCUMENTUM */        
                                       /* 'T'=NEW R12 (ETHIAS/MY ET.)*/        
                                       /* 'N'=NEW R12 (GEDI)         */        
      2   LTREPAT          CHAR (30),  ##########################################        
      2   OBJAT(20),                   ###########################################################        
       3  NOOBJAT      DEC FIXED(13),  ##########################################        
       3  NOSEQAT      BIN FIXED(15),  ##########################################        
       3  LTEXTAT          CHAR (10),  ##########################################        
       3  LTNMDOC          CHAR (40),  ##########################################        
      2   CDTYPDO          CHAR (14),  ##########################################        
      2   LTTYPDO          CHAR (40);  ##########################################        
 /*********************************************************************/        
              /* INTERFACE VERS XSM307    */        
 DCL XSM307     ENTRY;        ##############################################        
         
 DCL XA2N53  ENTRY OPTIONS(FETCHABLE); #################################        
 /*********************************************************************/        
 /*                                                                   */        
 /* INTERFACE ROUTINE XA2N53                                          */        
 /*                                                                   */        
 /*********************************************************************/        
 DCL 1     JA2N53,        
 /*-------------------- E N T R E E ----------------------------------*/        
       2   ALTPCB       PTR,           ####################################################        
       2   DS146        PTR,           ####################################################        
       2   DSM80        PTR,           ####################################################        
       2   DSM07        PTR,           ####################################################        
       2   DSMB9        PTR,           ####################################################        
       2   DATAPTR,                    #############################################################        
         3 SEGMENT(50)  PTR,           ####################################################        
       2   NOIDAFF      DEC FIXED(7),  ###########################################        
       2   CDCMGES      CHAR(08),      ###############################################        
       2   CDSCTRN      CHAR(01),      ###############################################        
       2   NOIDPOL      CHAR(12),      ###############################################        
       2   CDRSCTL      CHAR(01),      ###############################################        
       2   CDLTACC      CHAR(01),      ###############################################        
       2   CDLTPRI      CHAR(01),      ###############################################        
       2   CDLTPRO      CHAR(01),      ###############################################        
       2   CDLTREN      CHAR(01),      ###############################################        
       2   LTOBJOP_W,        
         3 NOSQINT      CHAR(05),      ############################################        
         3 NOSQSUJ      CHAR(05),      ############################################        
         3 CDCNTVC      CHAR(03),      ############################################        
         3 CDCAC        CHAR(15),      ############################################        
         3 CDOPER       CHAR(03),      ############################################        
         3 CDPRODU      CHAR(07),      ############################################        
         3 CDTYPPR      CHAR(03),      ############################################        
         3 CDLETTR      CHAR(03),      ############################################        
         3 CDCANAL      CHAR(09),      ############################################        
         3 CDTTAPP      CHAR(02),      ############################################        
         3 NOSEQRB      CHAR(03),      ############################################        
         3 CDSGGES      CHAR(01),      ############################################        
         3 CDCOUGE      CHAR(04),      ############################################        
         3 CDDEVIS      CHAR(11),      ############################################        
                                       /* NO PROD DEVIS BO INTRANET*/        
         3 CDRSCTL      CHAR(01),      ############################################        
                                       /* TP IMPRES. VENANT FIRST L/C */        
       2   EMAILID,        
        3  EMAILTO  CHAR(50),      ###################################################        
        3  EMAILCC  CHAR(50),      ###################################################        
        3  EMAILFL  CHAR(50),      ###################################################        
        3  EMAILSB  CHAR(50),      ###################################################        
       2   CDPRNET  CHAR(08),      ###################################################        
       2   CDTYIMP  CHAR(01),      ###################################################        
       2   LTPLQVH  CHAR(12),      ###################################################        
       2   CDCHPAI  CHAR(01),      ###################################################        
       2   CDFONCT  CHAR(01),      ###################################################        
                                   /* 1 = FONCTIONNAIRE PROSPECT      */        
                                   /* 2 = FONCTIONNAIRE CONTRAT ACTIF */        
                                   /*' '= PAS FONCTIONNAIRE           */        
 /*-------------------- S O R T I E ----------------------------------*/        
       2   RETOURS,        
         3 CDRTPGM       CHAR(6),      ###############################################        
         3 NOIDDOC       FIXED DEC(7), ##########################################        
         3 DBPTR         PTR,          ###################################################        
         3 LASTDLI       CHAR (08);    #############################################        
         
         
 DCL XSM532  ENTRY;           ####################################################        
 /*********************************************************************/        
 /*                                                                   */        
 /*   INTERFACE POUR MAJ DB STAT. VIA TWFI XSM532                     */        
 /*   ===========================================                     */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1    JSM131,        
 /*------------------------- I N P U T -------------------------------*/        
      2   PTRPCB,                         ###############################################################        
       3  ALTPCB           PTR,           #################################################        
      2   PARAM,                          ################################################################        
       3  CDSCTRN          CHAR  (1),     ###########################################        
       3  CDEVTRN          CHAR  (1),     ###########################################        
       3  NBTYSTA          PIC '9',       #############################################        
       3  TBTYSTA (18),                   #########################################################        
        4 CDTYSTA          CHAR  (5),     ###########################################        
        4 DAOPGES          FIXED DEC (7), #######################################        
        4 LTIDCLE          CHAR  (56),    ##########################################        
        4 NOIDCPT          FIXED BIN (15),######################################        
        4 MTVAINC          FIXED BIN (31),######################################        
         
 /*------------------------ O U T P U T ------------------------------*/        
      2   RETURN_CODE,                    ##########################################################        
       3  CDRTPGM          CHAR (6),      ############################################        
       3  DBPTR            PTR,           #################################################        
       3  LASTDLI          CHAR (10);     ###########################################        
 /*********************************************************************/        
         
         
 KS1005J.PTRPCB.DEU02PCB = GA2016J.DEU02PCB;###########################        
 KS1005J.PTRPCB.DS101PCB = GA2016J.DS101PCB;###########################        
 KS1005J.PTRPCB.DS102PCB = NULL();        
 KS1005J.PTRPCB.DS128PCB = NULL();        
 KS1005J.PTRPCB.DS132PCB = NULL();        
 KS1005J.PTRPCB.DS134PCB = NULL();        
 KS1005J.PTRPCB.DS137PCB = GA2016J.DS137PCB;##############################        
         
 KS1010J.DEU02PCB = GA2016J.DEU02PCB ;        
 KS1010J.DC105PCB = GA2016J.DC105PCB ; #####################        
 KS1010J.DS101PCB = GA2016J.DS101PCB ;        
 KS1010J.DS101$PCB = NULL();        
 KS1010J.DS102PCB = NULL();        
 KS1010J.DS104PCB = NULL();        
 KS1010J.DS104$PCB = NULL();        
 KS1010J.DS105PCB = NULL();        
 KS1010J.DS105$PCB = NULL();        
 KS1010J.DS106PCB = NULL();        
 KS1010J.DS106BPCB = NULL();        
 KS1010J.DS108PCB = NULL();        
 KS1010J.DS108$PCB = NULL();        
 KS1010J.DS125PCB = NULL();        
 KS1010J.DS125$PCB = NULL();        
 KS1010J.DS128PCB = NULL();        
 KS1010J.DS132PCB = NULL();        
 KS1010J.DS134PCB = NULL();        
 KS1010J.DS137PCB = GA2016J.DS137PCB ;        
 KS1010J.DSM22PCB = NULL();        
         
 /* NRB - TDMOHL - GENERATION LE 05/06/2008 - 12:55        LGTH=00274 */        
 /*****************************************************/        
 /*  TABLE MAIN :                                     */        
 /*****************************************************/        
         
 DCL  1 TBSM_MAIN ,                         #############################################################        
                                            /*TB!  !DSM25   !C1TAB    */        
                                            /*TB!  !DDO03   !C1TAB    */        
                                            /*TB!  !DIB15   !C1TAB    */        
                                            /*TB!  !DCR01   !CRTABLE  */        
                                            /*TB!  !DLG01   !TABLE    */        
                                            /*TB!  !DGZ02   !GZTABLE  */        
                                            /*TB!  !DNC02   !NCTABLE  */        
 /*K*/ 2 TBTXCOD  CHAR(4),                  /*CD!  !CODE TABLE        */        
 /*K*/ 2 TBTXA01  CHAR(20),                 /*CD!  !ARGUMENT          */        
       2 TBTXL01  CHAR(250);                ####################################################        
         
         
    DCL 1 SSA_C1TAB,        
         2 FIL1         CHAR (8)       INIT ('C1TAB  '),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KC1TAB  '),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (24),        
         2 FIL4         CHAR (1)       INIT (')');        
         
   /* DC105 */        
 /* NRB - TDMNAP - GENERATION LE 16/05/2007 - 18:25        LGTH=00270 */        
 /*****************************************************/        
 /*  STABLE MAIN :                                    */        
 /*****************************************************/        
         
 DCL  1 STBSM_MAIN ,                        ############################################################        
                                            /*TB!  !DSM25   !C1STAB   */        
                                            /*TB!  !DDO03   !C1STAB   */        
                                            /*TB!  !DIB15   !C1STAB   */        
                                            /*TB!  !DCR01   !CRSTABL  */        
                                            /*TB!  !DPH01   !PHSTABL  */        
                                            /*TB!  !DLG01   !STABLE   */        
                                            /*TB!  !DGZ02   !GZSTABL  */        
                                            /*TB!  !DNC02   !NCSTABL  */        
 /*K*/ 2 TBTXA02  CHAR(20),                 /*CD!  !SOUS-ARGUMENT     */        
       2 TBTXL02  CHAR(200),                ####################################################        
       2 $FILLER$ CHAR(050);                ####################################################        
         
    DCL 1 SSA_C1STAB,        
         2 FIL1         CHAR (8)       INIT ('C1STAB '),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KC1STAB '),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (20),        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMCLO - Generation le 14/11/2001 - 13:59        Lgth=00274 */        
         
         /*-----------------------------------------------------------*/        
         /*-- ENVIRONNEMENT DE TRAVAIL                                */        
         /*-----------------------------------------------------------*/        
 DCL  1 TBSM_SM00 ,                   #############################################################        
                                      /*TB!  !DSM25   !C1TAB          */        
                                      /*TB!  !DDO03   !C1TAB          */        
                                      /*TB!  !DCR01   !CRTABLE        */        
                                      /*--!  !L'1 *                   */        
 /*K*/ 2 TBTXCOD  CHAR(4),            /*CD!  !CODE TABLE              */        
 /*K*/ 2 TBTXA01  CHAR(20),           /*CD!  !ARGUMENT                */        
       2 CDEVTRN  CHAR(1),            ######################################################        
       2 FILLER1  CHAR(1),            ######################################################        
       2 CDSUIVI  CHAR(1),            ######################################################        
       2 FILLER2  CHAR(1),            ######################################################        
       2 CDDVTRN  CHAR(1),            ######################################################        
       2 FILLER3  CHAR(1),            ######################################################        
       2 CDPGTRN  CHAR(1),            ######################################################        
       2 FILLER4  CHAR(243);          ####################################################        
         
 /* NRB - TDMLUT - Generation le 06/06/2002 - 10:18        Lgth=00274 */        
 /*-------------------------------------------------------------------*/        
 /*-- TABLE DES MOTIFS DE RESILIATIONS                                */        
 /*-------------------------------------------------------------------*/        
 DCL  1 TBSM_SMRS ,                  #############################################################        
                                     /*TB!  !DSM25   !C1TAB           */        
                                     /*TB!  !DDO03   !C1TAB           */        
                                     /*TB!  !DCR01   !CRTABLE         */        
                                     /*TB!  !DLG01   !TABLE           */        
                                     /*--!  !=DESCRIPTION ARGUMENT    */        
 /*K*/ 2 TBTXCOD  CHAR(4),           /*CD!  !CODE TABLE               */        
 /*K*/ 2 TBTXA01  CHAR(20),          /*CD!  !ARGUMENT LG 2            */        
       2 LTNMDES(3)  CHAR(40),       ##################################################        
       2 FILLER  CHAR(129),          #####################################################        
       2 CDEGARG  CHAR(1);           ######################################################        
 /* NRB - TDMLEN - Generation le 23/11/2000 - 15:08        Lgth=00274 */        
 DCL  1 TABLE_CPIE ,                    ############################################################        
                                        /*TB!  !DSM25   !C1TAB        */        
                                        /*--!  ! COMPAGNIE ASSURANCE  */        
                                        /*--!  ! COMPOSTEUR POLICES   */        
 /*K*/ 2 TBTXCOD  CHAR(4),              /*CD!  !CODE TABLE            */        
 /*K*/ 2 TBTXA01  CHAR(20),             /*CD!  !ARGUMENT              */        
       2 LTNMCIE  CHAR(40),             #####################################################        
       2 FILLER2  CHAR(7),              ######################################################        
       2 LTADCIE  CHAR(30),             #####################################################        
       2 LTLOCIE  CHAR(25),             #####################################################        
       2 CDCPCIE  CHAR(6),              ######################################################        
       2 FILLER3  CHAR(3),              ######################################################        
       2 CDTLCIE  CHAR(9),              ######################################################        
       2 FILLER4  CHAR(25),             #####################################################        
       2 CDFXCIE  CHAR(9),              ######################################################        
       2 FILLER5  CHAR(29),             #####################################################        
       2 NOIDGES  PIC'(7)9',            ####################################################        
       2 FILLER6  CHAR(1),              ######################################################        
       2 DAMODIF  PIC'(7)9',            ####################################################        
       2 FILLER7  CHAR(51),             #####################################################        
       2 CDEGARG  CHAR(1);              ######################################################        
 /* NRB - TDMROO - GENERATION LE 11/01/2005 - 08:57        LGTH=00274 */        
 /*-------------------------------------------------------------------*/        
 /*-- DICTIONNAIRE DES PROFESSIONS / EMPLOYEURS / ACTIVITES COMPL.    */        
 /*-------------------------------------------------------------------*/        
 DCL  1 TBSM_CLPF ,                  #############################################################        
                                     /*TB!  !DSM25   !C1TAB           */        
                                     /*TB!  !DCR01   !CRTABLE         */        
                                     /*TB!  !DDO03   !C1TAB           */        
                                     /*TB!  !DLG01   !TABLE           */        
                                     /*--!  !L'06 ERRORNUMBER         */        
 /*K*/ 2 TBTXCOD  CHAR(4),           /*CD!  !CODE TABLE               */        
 /*K*/ 2 TBTXA01  CHAR(20),          /*CD!  !ARGUMENT                 */        
       2 LTPROFF(3)  CHAR(30),       ##################################################        
       2 CDPRFCT  CHAR(1),           ######################################################        
       2 CDPRFOB  CHAR(1),           ######################################################        
       2 FILLER  CHAR(157),          #####################################################        
       2 CDEGARG  CHAR(1);           ######################################################        
 /* NRB - TDMROO - GENERATION LE 12/10/2009 - 14:26        LGTH=00274 */        
 /*-------------------------------------------------------------------*/        
 /*-- DICTIONNAIRE DES ACTIVITES PROFESSIONELLES                      */        
 /*-------------------------------------------------------------------*/        
 DCL  1 TBSM_CLAP ,                  #############################################################        
                                     /*TB!  !DSM25   !C1TAB           */        
                                     /*TB!  !DCR01   !CRTABLE         */        
                                     /*TB!  !DDO03   !C1TAB           */        
                                     /*TB!  !DLG01   !TABLE           */        
                                     /*--!  !L'06 ERRORNUMBER         */        
 /*K*/ 2 TBTXCOD  CHAR(4),           /*CD!  !CODE TABLE               */        
 /*K*/ 2 TBTXA01  CHAR(20),          /*CD!  !ARGUMENT                 */        
       2 LTACPRO(3)  CHAR(30),       ##################################################        
       2 CDFONCT  CHAR(1),           ######################################################        
       2 FILLER  CHAR(158),          #####################################################        
       2 CDEGARG  CHAR(1);           ######################################################        
 /* NRB - TDMJOB - GENERATION LE 21/01/2009 - 09:45        LGTH=00274 */        
         
         /*-----------------------------------------------------------*/        
         /*--TABLE DE DEFINITION DES IMPRIMANTES LOCALES              */        
         /*-----------------------------------------------------------*/        
 DCL  1 TBTT_PRTT ,                  #############################################################        
                                     /*TB!  !DRH01   !RHTABLE         */        
                                     /*TB!  !DCT01   !CTTABLE         */        
                                     /*TB!  !DC201   !C2TABLE         */        
                                     /*TB!  !DC301   !C3TABLE         */        
                                     /*TB!  !DSM25   !C1TAB           */        
                                     /*TB!  !DCR01   !CRTABLE         */        
                                     /*TB!  !DDO03   !C1TAB           */        
                                     /*TB!  !DCI02   !CITAB           */        
                                     /*TB!  !AEDBTAB1!TABLE           */        
                                     /*TB!  !DLG01   !TABLE           */        
                                     /*TB!  !DLP03   !TABLE           */        
                                     /*TB!  !DND01   !NDTAB           */        
                                     /*TB!  !DP101   !P1TABLE         */        
 /*K*/ 2 TBTXCOD  CHAR(4),           /*CD!  !CODE TABLE               */        
 /*K*/ 2 TBTXA01  CHAR(20),          /*CD!  !ARGUMENT                 */        
       2 CDTYPRT  CHAR(1),           ######################################################        
       2 LTLOCPR  CHAR(30),          #####################################################        
       2 CDTYAPP(10)  CHAR(2),       ##################################################        
       2 FILLER2  CHAR(64),          #####################################################        
       2 CDALIPF  CHAR(8),           ######################################################        
       2 CDALIPN  CHAR(8),           ######################################################        
       2 CDTYPES  CHAR(1),           ######################################################        
       2 CDTYPRM  CHAR(8),           ######################################################        
       2 CDTYPR2  CHAR(8),           ######################################################        
       2 CDLTERF  CHAR(8),           ######################################################        
       2 CDLTERN  CHAR(8),           ######################################################        
       2 CDCMDPR  CHAR(5),           ######################################################        
       2 CDTYLTF  CHAR(1),           ######################################################        
       2 CDTYLTN  CHAR(1),           ######################################################        
                                     /*--!  !D = IMPRESSION DIFFEREE  */        
       2 CDRESEF  CHAR(6),           ######################################################        
       2 CDRESEN  CHAR(6),           ######################################################        
       2 LTNMVXF  CHAR(6),           ######################################################        
       2 LTNMVXN  CHAR(6),           ######################################################        
       2 CDEMPRT  CHAR(1),           ######################################################        
       2 CD2BACS  CHAR(1),           ######################################################        
       2 CDUPLEX  CHAR(1),           ######################################################        
                                     /*--!  !N OU '': PAS DE R/V      */        
                                     /*--!  !Y: R/V (BAC PRINCIPAL)   */        
                                     /*--!  !M: R/V (BAC MANUEL)      */        
       2 FIL1  CHAR(1),              #########################################################        
       2 CDIMPIX  CHAR(1),           ######################################################        
       2 CDALIPD  CHAR(8),           ######################################################        
       2 CDTYPRD  CHAR(8),           ######################################################        
       2 CDLTERD  CHAR(8),           ######################################################        
       2 CDTYLTD  CHAR(1),           ######################################################        
       2 CDRESED  CHAR(6),           ######################################################        
       2 LTNMVXD  CHAR(6),           ######################################################        
       2 CDPRT67  CHAR(3),           ######################################################        
       2 CDBCVXF  CHAR(1),           ######################################################        
       2 CDBCVXN  CHAR(1),           ######################################################        
       2 CDBCVXD  CHAR(1),           ######################################################        
       2 FILLER  CHAR(6),            #######################################################        
       2 CDEGARG  CHAR(1);           ######################################################        
 /* NRB - TDMAMB - GENERATION LE 09/03/2006 - 09:42        LGTH=00274 */        
         
         /* --------------------------------------------------------- */        
         /*  TABLE DES BUREAUX REGIONAUX     POUR SMICA               */        
         /* --------------------------------------------------------- */        
 DCL  1 TBSM_CABU ,                 #############################################################        
                                    /*--!  !                          */        
 /*K*/ 2 TBTXCOD  CHAR(4),          /*CD!  !CODE TABLE                */        
 /*K*/ 2 TBTXA01  CHAR(20),         /*CD!  !ARGUMENT                  */        
       2 LTBUREA(3)  CHAR(40),      ##################################################        
       2 CDINSTN  CHAR(1),          ######################################################        
       2 CDINSTS  CHAR(1),          ######################################################        
       2 CDINSTA  CHAR(1),          ######################################################        
       2 CDLGBFR  CHAR(1),          ######################################################        
       2 CDLGBNL  CHAR(1),          ######################################################        
       2 CDLGBDE  CHAR(1),          ######################################################        
       2 CDLGBEN  CHAR(1),          ######################################################        
       2 CDBUPER  CHAR(2),          ######################################################        
       2 CDRFPRT  CHAR(3),          ######################################################        
       2 CDPRBAN  CHAR(1),          ######################################################        
       2 CDRFPRT1  CHAR(3),         #####################################################        
       2 CDRFPRT2  CHAR(3),         #####################################################        
       2 CDRFPRT3  CHAR(3),         #####################################################        
       2 CDRFPRT4  CHAR(3),         #####################################################        
       2 CDRFPRT5  CHAR(3),         #####################################################        
       2 CDRFPRT6  CHAR(3),         #####################################################        
       2 CDRFPRT7  CHAR(3),         #####################################################        
       2 CDRFPRT8  CHAR(3),         #####################################################        
       2 FILLER  CHAR(93);          ######################################################        
         
 /* NRB - TDMMAS - GENERATION LE 13/10/2006 - 11:35        LGTH=00074 */        
 /*****************/        
 /* SCRATCH NIV 1 */        
 /*****************/        
         
 DCL  1 XIWNET ,                      ################################################################        
                                      /*DB!  !DCI54   !XIWNET         */        
                                      /*DB!  !DGZ50   !XIWNET         */        
                                      /*DB!  !DAE89   !XIWNET         */        
 /*K*/ 2 NOIDCLI  DEC FIXED(7),       /*NO!  !NO. CLIENT              */        
       2 SQIDSCR  DEC FIXED(3),       #################################################        
       2 CDEVTRN  CHAR(1),            ######################################################        
       2 CDSCTRN  CHAR(1),            ######################################################        
       2 LTSCTRN  CHAR(4),            ######################################################        
       2 CDLGTRN  CHAR(1),            ######################################################        
       2 CDUTTRN  CHAR(8),            ######################################################        
       2 CDRFPRT  CHAR(3),            ######################################################        
       2 CDCMGES  CHAR(8),            ######################################################        
       2 CDDVTRN  CHAR(1),            ######################################################        
       2 CDPGTRN  CHAR(1),            ######################################################        
       2 SQIDCLI  DEC FIXED(7),       #################################################        
       2 FILLER  CHAR(36);            ######################################################        
         
 DCL 1 SSA_XIWNET,        
         2 FIL1         CHAR (8)       INIT ('XIWNET'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KXIWNET'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        FIXED (7),        
         2 FIL4         CHAR (1)       INIT (')');        
         /* DB SCRATCH */        
 /* NRB - TDMMAS - GENERATION LE 13/10/2006 - 11:35        LGTH=04007 */        
 /*****************/        
 /* SCRATCH NIV 2 */        
 /*****************/        
         
 DCL  1 XIWNET2 ,                        ###############################################################        
                                         /*DB!  !DCI54   !XIWNET2     */        
                                         /*DB!  !DGZ50   !XIWNET2     */        
                                         /*DB!  !DAE89   !XIWNET2     */        
 /*K*/ 2 NOIDSCR  DEC FIXED(3),          /*NO!  !NO. SESSION          */        
 /*K*/ 2 NULVSCR  PIC'9',                /*NO!  !NIVEAU DE LA SESSION */        
 /*K*/ 2 CDTYSCR  CHAR(2),               /*CD!  !TYPE DE SCRATCH      */        
 /*K*/ 2 SQNMSCR  PIC'99',               /*SQ!  !NO. SUITE            */        
       2 LTNMSCR  CHAR(4000);            ###################################################        
         
 DCL 1 SSA_XIWNET2,        
         2 FIL1         CHAR (8)       INIT ('XIWNET2'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KXIWNET2'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE1       FIXED(3),        
         2 VALUE2       PIC '9',        
         2 VALUE3       CHAR (2),        
         2 VALUE4       PIC '99',        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMTHO - Generation le 17/03/2004 - 11:28        Lgth=00600 */        
 /*********************************************************************/        
 /*  SEGMENT DB DEVIS                                                 */        
 /*  SMDV001        SMDEVIS_001        D201001                        */        
 /*  SMDV002        SMDEVIS_002        D202001                        */        
 /*  SMDV003        SMDEVIS_003        IB                             */        
 /*  SMDV004        SMDEVIS_004        IB2                            */        
 /*  SMDV005        SMDEVIS_005        IB3                            */        
 /*  SMDV006        SMDEVIS_006        SMPK100/SMPK001(D201001)       */        
 /*  SMDV007        SMDEVIS_007        MS                             */        
 /*  SMDV008        SMDEVIS_008        SA                             */        
 /*  SMDV009        SMDEVIS_009        D203013 (BATEAU)               */        
 /*  SMDV010        SMDEVIS_010        D203013 (BATEAU)               */        
 /*  SMDV011        SMDEVIS_011        D203013 (BATEAU)               */        
 /*  SMDV012        SMDEVIS_012        A2 (AUTO VEHICULE)             */        
 /*  SMDV013        SMDEVIS_013        A2 (AUTO VEHICULE)             */        
 /*  SMDV014        SMDEVIS_014        A2 (AUTO ACCESSOIRE)           */        
 /*  SMDV015        SMDEVIS_015        A2 (AUTO ANTECEDANT)           */        
 /*  SMDV016        SMDEVIS_016        MS605                          */        
 /*  SMDV022        SMDEVIS_022        VI                             */        
 /*********************************************************************/        
 DCL  1 SMDEVIS ,                       ###############################################################        
 /*K*/ 2 CDTYKEY  CHAR(1),              /*CD!  !TYPE DE CLE           */        
                                        /*--!  !A = AFFILER           */        
                                        /*--!  !D = DATE              */        
                                        /*--!  !P = OLICE             */        
 /*K*/ 2 NOIDKEY  DEC FIXED(9),         /*NO!  !CLE DU DEVIS          */        
                                        /*--!  !SI A :NUMERO AFFILIER */        
                                        /*--!  !SI D : XXSAAMMJJ(DATE */        
                                        /*--!  ! SI  A2: XX = 00      */        
                                        /*--!  !     IB: XX = 01      */        
                                        /*--!  !     PK: XX = 02      */        
                                        /*--!  !     FI: XX = 03      */        
                                        /*--!  !     VI: XX = 04      */        
                                        /*--!  !SI P :NUMERO DE POLICE*/        
 /*K*/ 2 NOSQDEV  DEC FIXED(7),         /*NO!  !NUMERO DE DEVIS       */        
                                        /*--!  !SI A :NUMERO DEVIS    */        
                                        /*--!  !     :VERSION DEVIS   */        
                                        /*--!  !SI D :NUMERO DEVIS    */        
                                        /*--!  !     :VERSION DEVIS   */        
                                        /*--!  !SI P :VERSION DEVIS   */        
 /*K*/ 2 NOSQTXT  DEC FIXED(3),         /*NO!  !NUMERO DU COPY        */        
       2 CDTYPRO  CHAR(7),              ######################################################        
       2 CDSBPRO  CHAR(7),              ######################################################        
       2 CDVEPRO  CHAR(3),              ######################################################        
       2 NOSQINT  PIC'(5)9',            ####################################################        
       2 NOSQSUJ  PIC'(5)9',            ####################################################        
       2 DATEMAJ  CHAR(4),              ######################################################        
       2 TIMEMAJ  CHAR(4),              ######################################################        
       2 TBEGCOD  CHAR(2),              ######################################################        
       2 DATAFIXE  CHAR(8),             #####################################################        
       2 DATA  CHAR(543);               #######################################################        
    DCL 1 SSA_SMDEVIS,        
         2 FIL1         CHAR (8)       INIT ('SMDEVIS'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KSMDEVIS'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE1       CHAR(01) ,        
         2 VALUE2       FIXED DEC(9) ,        
         2 VALUE3       FIXED DEC(7) ,        
         2 VALUE4       FIXED DEC(3) ,        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMEUR - GENERATION LE 08/04/2010 - 13:38        LGTH=00600 */        
 /*********************************/        
 /*  SEGMENT DB DEVIS A2 GENERAL  */        
 /*********************************/        
                                /*--!  !SI A :NUMERO AFFILIER         */        
                                /*--!  !SI I :DATE DU DEVIS           */        
                                /*--!  !SI D :DATE DU DEVIS           */        
 DCL  1 SMDEVIS_012 ,           ###########################################################        
 /*K*/ 2 CDTYKEY  CHAR(1),      /*CD!  !TYPE DE CLE                   */        
                                /*--!  !A = AFFILER                   */        
                                /*--!  !D = DATE                      */        
 /*K*/ 2 NOIDKEY  DEC FIXED(9), /*NO!  !SI A :NUMERO AFFILIE  (7)     */        
                                /*--!  !SI D :DATE DU DEVIS           */        
 /*K*/ 2 NOSQDEV  DEC FIXED(7), /*NO!  !NUMERO DE DEVIS               */        
                                /*--!  !SI A :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
                                /*--!  !SI D :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
 /*K*/ 2 NOSQTXT  DEC FIXED(3), /*NO!  !NUMERO DU COPY                */        
       2 CDTYPRO  CHAR(7),      ######################################################        
       2 CDSBPRO  CHAR(7),      ######################################################        
       2 CDVEPRO  CHAR(3),      ######################################################        
       2 NOSQINT  PIC'(5)9',    ####################################################        
       2 NOSQSUJ  PIC'(5)9',    ####################################################        
       2 DATEMAJ  DEC FIXED(7), #################################################        
       2 TIMEMAJ  DEC FIXED(6), #################################################        
       2 TBEGCDV(16)  BIT(1),   ###################################################        
                                /*--!  !02 : PRESENCE ACCESSOIRES     */        
                                /*--!  !03 : PRESENCE ANTECEDENTS     */        
                                /*--!  !04 : PRESENCE CONDUCTEUR      */        
                                /*--!  !05 : CONTENTIEUX/RAPPEL       */        
                                /*--!  !06 : PRESENCE INFO PROPOSITION*/        
                                /*--!  !07 : DEVIS INTRANET           */        
                                /*--!  !08 : MODULO FAMILY            */        
                                /*--!  !09 : PRESENCE INFOS TARIFAIRES*/        
       2 TBEGREM(16)  BIT(1),   ###################################################        
       2 NOTXTEV  BIN FIXED(15),################################################        
       2 DAPERMI  DEC FIXED(7), #################################################        
       2 CDDVDEV  CHAR(1),      ######################################################        
       2 CDCMGES  DEC FIXED(7), #################################################        
       2 CDCMPRO  PIC'9',       #######################################################        
       2 NOPOORI  DEC FIXED(8), #################################################        
       2 NOPOCRE  DEC FIXED(8), #################################################        
       2 NOIDAFF  DEC FIXED(7), #################################################        
       2 LTNMAFF  CHAR(30),     #####################################################        
       2 CDRSAFF  CHAR(1),      ######################################################        
       2 LTRUEAF  CHAR(25),     #####################################################        
       2 NOHA1AF  BIN FIXED(15),################################################        
       2 NOHA2AF  CHAR(4),      ######################################################        
       2 LTLOCAF  CHAR(25),     #####################################################        
       2 CDCPOAF  CHAR(6),      ######################################################        
       2 CDLGAFF  CHAR(1),      ######################################################        
       2 DANAIAF  DEC FIXED(7), #################################################        
       2 CDCATAF  CHAR(3),      ######################################################        
       2 LTNOMCD  CHAR(20),     #####################################################        
       2 LTPRECD  CHAR(15),     #####################################################        
       2 LTRUECD  CHAR(30),     #####################################################        
       2 CDRSCCD  CHAR(1),      ######################################################        
       2 LTLOCCD  CHAR(25),     #####################################################        
       2 CDCPOCD  CHAR(6),      ######################################################        
       2 DANAICD  DEC FIXED(7), #################################################        
       2 TBEGDOC(16)  BIT(1),   ###################################################        
                                /*--!  ! 2 = IMPRES LETTRE ACCOMP.    */        
                                /*--!  ! 3 = IMPRES PROPOSITION       */        
                                /*--!  ! 4 = IMPRES LETTRE RENON      */        
                                /*--!  ! 5 = IMPRES CV PROVISOIRE     */        
                                /*--!  ! 6 = IMPRES LETTRE FRANCHISE  */        
                                /*--!  ! 7 = IMPRES EN DOC1           */        
       2 CDCATVH  CHAR(3),      ######################################################        
       2 CDCATCV  CHAR(2),      ######################################################        
       2 CDUSVEH  CHAR(2),      ######################################################        
       2 CDUSPRO  PIC'9',       #######################################################        
       2 NBKMPRO  DEC FIXED(3), #################################################        
       2 CDFRAAV  CHAR(1),      ######################################################        
       2 CDFFRAV  PIC'9',       #######################################################        
       2 CDFDHAV  PIC'9',       #######################################################        
       2 CDTAXAV  PIC'9',       #######################################################        
       2 CDTVASN  CHAR(1),      ######################################################        
       2 LTPLQVH  CHAR(12),     #####################################################        
       2 CDTABBM  CHAR(1),      ######################################################        
       2 CDINAMI  CHAR(1),      ######################################################        
       2 CDGAZOI  CHAR(1),      ######################################################        
       2 ANCSTVH  DEC FIXED(3), #################################################        
       2 NBPR1TR  PIC'999V9',   ###################################################        
       2 NBPR2TR  PIC'999V9',   ###################################################        
       2 LTCHAVH  CHAR(30),     #####################################################        
       2 LTMRQVH  CHAR(20),     #####################################################        
       2 NUPDSVH  PIC'99V9',    ####################################################        
       2 CDPUIVH  CHAR(1),      ######################################################        
       2 NUPUIVH  DEC FIXED(5), #################################################        
       2 NUCYLVH  DEC FIXED(5), #################################################        
       2 VACATVH  DEC FIXED(9), #################################################        
       2 VAACTVH  DEC FIXED(9), #################################################        
       2 VAACCVH  DEC FIXED(9), #################################################        
       2 VAFACVH  DEC FIXED(9), #################################################        
       2 VAOBJVH  DEC FIXED(9), #################################################        
       2 TBEGCOV(16)  BIT(1),   ###################################################        
                                /*--!  !01 : MAGISTRAT                */        
                                /*--!  !02 : FONCTIONNAIRE            */        
                                /*--!  !03 : FONCT. AVEC CONTRAT      */        
                                /*--!  !04 : CODE ANTIVOL 1           */        
                                /*--!  !05 : CODE ANTIVOL 2           */        
                                /*--!  !06 : PLUS 1 SINISTRE          */        
                                /*--!  !07 : DOMICILIATION            */        
                                /*--!  !08 : AUTRE CONDUC. - 26 ANS   */        
                                /*--!  !09 : CONDUCTEUR PASSIF        */        
                                /*--!  !10 : CLIENT FIDELISE          */        
                                /*--!  !11 : TMC ASSUREE              */        
                                /*--!  !12 : NOUVEAU TARIF G. ANNEXES */        
                                /*--!  !13 : REMPLACEMENT VEHICULE    */        
                                /*--!  !14 : IAV APRES IAA            */        
                                /*--!  !15 : MODULO TEACHER           */        
                                /*--!  !16 : MODULO SENIOR            */        
       2 CDTYPVH  DEC FIXED(5), #################################################        
       2 CDCKCHA  PIC'99',      ######################################################        
       2 DAFICIR  DEC FIXED(7), #################################################        
       2 ECRCSOU  PIC'99',      ######################################################        
       2 ECDMSOU  PIC'99',      ######################################################        
       2 ECRCACT  PIC'99',      ######################################################        
       2 ECANSOU  PIC'99',      ######################################################        
       2 TBEGGAR(16)  BIT(1),   ###################################################        
       2 TBEGCOG(16)  BIT(1),   ###################################################        
                                /*--!  !04 TARIF TEC FAMILLE          */        
                                /*--!  !05 FRANCHISE PENALISANTE      */        
                                /*--!  !06 MAILING PROMO DM 2006      */        
                                /*--!  !09 TJ2 INTERDIT               */        
                                /*--!  !10 TARIF HORECA               */        
                                /*--!  !11 FRANCHISES HORECA          */        
                                /*--!  !12 PAS GENERER P791/P792      */        
                                /*--!  !13 JEUNE CONDUCTEUR RENSEIGNE */        
       2 CDTYPTA  CHAR(1),      ######################################################        
       2 CDDEROG  CHAR(2),      ######################################################        
       2 CDPADIV  CHAR(2),      ######################################################        
       2 DAPROCV  DEC FIXED(7), #################################################        
       2 DAECHPR  PIC'9999',    ####################################################        
       2 CDTIMFX  DEC FIXED(3), #################################################        
       2 TBTYPPO(16)  BIT(1),   ###################################################        
                                /*--!  ! 1 : PROPOSITION              */        
       2 NOAGTAV  CHAR(6),      ######################################################        
       2 CDFORGA  CHAR(1),      ######################################################        
       2 CDDRIVE  CHAR(1),      ######################################################        
       2 NBKMCPT  DEC FIXED(11),################################################        
       2 CDADCOU  CHAR(1),      ######################################################        
       2 NOINSPO  CHAR(3),      ######################################################        
       2 CDGRPAF  CHAR(7),      ######################################################        
       2 DAENTMS  DEC FIXED(15),################################################        
       2 NBANCON  CHAR(2),      ######################################################        
       2 CDTYCAC  CHAR(7),      ######################################################        
       2 CDTYDEV  CHAR(2),      ######################################################        
       2 CDDMSEG  CHAR(2),      ######################################################        
       2 CDRCSEG  CHAR(2),      ######################################################        
       2 CDVOSEG  CHAR(2),      ######################################################        
       2 CDREGDM  CHAR(1),      ######################################################        
       2 CDGRPJE  CHAR(1),      ######################################################        
       2 CDPRAPP  CHAR(7),      ######################################################        
       2 CDLGDEV  CHAR(1),      ######################################################        
       2 CDQUACD  CHAR(1),      ######################################################        
       2 NBEXREN  CHAR(1),      ######################################################        
       2 CDCTRRI  CHAR(1),      ######################################################        
       2 CDACTCO  CHAR(15),     #####################################################        
       2 CDEURTX  CHAR(7),      ######################################################        
       2 CDCADIV  CHAR(4),      ######################################################        
       2 CDCIRLI  CHAR(2),      ######################################################        
       2 LTUSARE  CHAR(30),     #####################################################        
       2 CDFRDMA  CHAR(2),      ######################################################        
       2 CDFRVOL  CHAR(2),      ######################################################        
       2 LTQUATI  CHAR(12),     #####################################################        
       2 CDENVFM  CHAR(1),      ######################################################        
       2 CDART15  CHAR(1),      ######################################################        
       2 CDALARM  CHAR(1),      ######################################################        
       2 CDPROMO  CHAR(1),      ######################################################        
       2 ECJKSOU  CHAR(1),      ######################################################        
       2 MTTMCVH  DEC FIXED(7), #################################################        
       2 CDIDSEG  CHAR(1),      ######################################################        
       2 CDDVDOC1  CHAR(1),     #####################################################        
       2 NOIDDOC  CHAR(3),      ######################################################        
       2 CDIDTRF  CHAR(1),      ######################################################        
       2 FILLER  CHAR(2);       #######################################################        
         
         
 DCL   NOIDDOC_R  FIXED DEC(05)      BASED(ADDR(SMDEVIS_012.NOIDDOC));        
         
 DCL SMDEVIS_R12 LIKE SMDEVIS_012;        
 /* NRB - TDMLEN - GENERATION LE 13/08/2009 - 16:50        LGTH=00600 */        
 /*********************************        
 *  SEGMENT DB DEVIS A2 GARANTIES *        
 *********************************/        
 DCL  1 SMDEVIS_013 ,               ###########################################################        
 /*K*/ 2 CDTYKEY  CHAR(1),          /*CD!  !TYPE DE CLE               */        
                                    /*--!  !A = AFFILER               */        
                                    /*--!  !D = DATE                  */        
 /*K*/ 2 NOIDKEY  DEC FIXED(9),     /*NO!  !SI A :NUMERO AFFILIE  (7) */        
                                    /*--!  !SI D :DATE DU DEVIS (7)   */        
 /*K*/ 2 NOSQDEV  DEC FIXED(7),     /*NO!  !NUMERO DE DEVIS           */        
                                    /*--!  !SI A :NUMERO DEVIS     (4)*/        
                                    /*--!  !     :VERSION DEVIS    (3)*/        
                                    /*--!  !SI D :NUMERO DEVIS     (4)*/        
                                    /*--!  !     :VERSION DEVIS    (3)*/        
 /*K*/ 2 NOSQTXT  DEC FIXED(3),     /*NO!  !NUMERO DU COPY            */        
       2 CDTYPRO  CHAR(7),          ######################################################        
       2 CDSBPRO  CHAR(7),          ######################################################        
       2 CDVEPRO  CHAR(3),          ######################################################        
       2 NOSQINT  PIC'(5)9',        ####################################################        
       2 NOSQSUJ  PIC'(5)9',        ####################################################        
       2 DATEMAJ  DEC FIXED(7),     #################################################        
       2 TIMEMAJ  DEC FIXED(6),     #################################################        
       2 TBEGCDV(16)  BIT(1),       ###################################################        
       2 TBEGREM(16)  BIT(1),       ###################################################        
       2 DATAFIX  CHAR(6),          ######################################################        
       2 TBGARAN(10),        
        3 CDGARAS  CHAR(3),         #####################################################        
        3 DAEFGAR  DEC FIXED(7),    ################################################        
        3 DAXPGAR  DEC FIXED(7),    ################################################        
        3 CDTFGAR  CHAR(2),         #####################################################        
        3 NUVSTRF  PIC'99',         #####################################################        
        3 PRBASGA  DEC FIXED(11),   ###############################################        
        3 TBEGCOD(24)  BIT(1),      ##################################################        
                                    /*--!  ! 1 SI CAS + C => S        */        
                                    /*--!  ! 2 SI TARIF FORCE         */        
                                    /*--!  ! 3 SI A2DEVER PRESENT     */        
        3 NUMJDIV  DEC FIXED(5,2),  ##############################################        
        3 NUMJLEA  DEC FIXED(3),    ################################################        
        3 NUMJPDG  DEC FIXED(3),    ################################################        
         
        3 NURDCEX  DEC FIXED(3),    ################################################        
        3 NURDCLI  DEC FIXED(3),    ################################################        
        3 NURDPLU  DEC FIXED(3),    ################################################        
        3 NURDFRA  DEC FIXED(3),    ################################################        
        3 NURDLOI  DEC FIXED(3),    ################################################        
        3 NURDGAZ  DEC FIXED(3),    ################################################        
        3 NURDDIV  DEC FIXED(5,2),  ##############################################        
       2 NBSINRC  PIC'99',          ######################################################        
       2 NBSINDM  PIC'99',          ######################################################        
       2 TBEGPAR(16)  BIT(1),       ###################################################        
                                    /*--!  ! 1 RESIDE AVEC PARENTS    */        
                                    /*--!  ! 2 TITULAIRE 2 AUTRES POL.*/        
                                    /*--!  ! 3 ENFANT A CHARGE        */        
                                    /*--!  ! 4 STAGE                  */        
                                    /*--!  ! 5 STARTER                */        
       2 CDOPTIN  CHAR(5),          ######################################################        
       2 CDCIBCL  CHAR(2),          ######################################################        
       2 FILLER  CHAR(70);          ######################################################        
 DCL SMDEVIS_R13 LIKE SMDEVIS_013;        
 /* NRB - TDMOHL - Generation le 31/08/2001 - 07:06        Lgth=00600 */        
 /************************************        
 *  SEGMENT DB DEVIS A2 ACCESSOIRES  *        
 *************************************/        
 DCL  1 SMDEVIS_014 ,              ###########################################################        
 /*K*/ 2 CDTYKEY  CHAR(1),         /*CD!  !TYPE DE CLE                */        
                                   /*--!  !A = AFFILER                */        
                                   /*--!  !D = DATE                   */        
 /*K*/ 2 NOIDKEY  DEC FIXED(9),    /*NO!  !SI A :NUMERO AFFILIE  (7)  */        
                                   /*--!  !SI D :DATE DU DEVIS (7)    */        
 /*K*/ 2 NOSQDEV  DEC FIXED(7),    /*NO!  !NUMERO DE DEVIS            */        
                                   /*--!  !SI A :NUMERO DEVIS     (4) */        
                                   /*--!  !     :VERSION DEVIS    (3) */        
                                   /*--!  !SI D :NUMERO DEVIS     (4) */        
                                   /*--!  !     :VERSION DEVIS    (3) */        
 /*K*/ 2 NOSQTXT  DEC FIXED(3),    /*NO!  !NUMERO DU COPY             */        
       2 CDTYPRO  CHAR(7),         ######################################################        
       2 CDSBPRO  CHAR(7),         ######################################################        
       2 CDVEPRO  CHAR(3),         ######################################################        
       2 NOSQINT  PIC'(5)9',       ####################################################        
       2 NOSQSUJ  PIC'(5)9',       ####################################################        
       2 DATEMAJ  DEC FIXED(7),    #################################################        
       2 TIMEMAJ  DEC FIXED(6),    #################################################        
       2 TBEGCDV(16)  BIT(1),      ###################################################        
       2 TBEGREM(16)  BIT(1),      ###################################################        
       2 DATAFIX  CHAR(6),         ######################################################        
       2 TBACCVH(10)  DEC FIXED(7),#############################################        
       2 TBACCSP(14),        
        3 LTACCSP  CHAR(30),       ####################################################        
        3 VAACCSP  DEC FIXED(7),   ################################################        
       2 FILLER  CHAR(27);         ######################################################        
 /* NRB - TDMBIE - Generation le 13/06/2003 - 17:03        Lgth=00600 */        
 /***********************************        
 *  SEGMENT DB DEVIS ANTECEDENTS A2 *        
 ************************************/        
                                /*--!  !SI A :NUMERO AFFILIER         */        
                                /*--!  !SI I :DATE DU DEVIS           */        
                                /*--!  !SI D :DATE DU DEVIS           */        
 DCL  1 SMDEVIS_015 ,           ###########################################################        
 /*K*/ 2 CDTYKEY  CHAR(1),      /*CD!  !TYPE DE CLE                   */        
                                /*--!  !A = AFFILER                   */        
                                /*--!  !D = DATE                      */        
 /*K*/ 2 NOIDKEY  DEC FIXED(9), /*NO!  !SI A :NUMERO AFFILIE  (7)     */        
                                /*--!  !SI D :DATE DU DEVIS           */        
 /*K*/ 2 NOSQDEV  DEC FIXED(7), /*NO!  !NUMERO DE DEVIS               */        
                                /*--!  !SI A :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
                                /*--!  !SI D :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
 /*K*/ 2 NOSQTXT  DEC FIXED(3), /*NO!  !NUMERO DU COPY                */        
       2 CDTYPRO  CHAR(7),      ######################################################        
       2 CDSBPRO  CHAR(7),      ######################################################        
       2 CDVEPRO  CHAR(3),      ######################################################        
       2 NOSQINT  PIC'(5)9',    ####################################################        
       2 NOSQSUJ  PIC'(5)9',    ####################################################        
       2 DATEMAJ  DEC FIXED(7), #################################################        
       2 TIMEMAJ  DEC FIXED(6), #################################################        
       2 TBEGCDV(16)  BIT(1),   ###################################################        
       2 TBEGREM(16)  BIT(1),   ###################################################        
       2 DATAFIX  CHAR(6),      ######################################################        
       2 CDANTCO  CHAR(1),      ######################################################        
       2 NBSINRC  DEC FIXED(3), #################################################        
       2 NBSINVO  DEC FIXED(3), #################################################        
       2 NBSINDM  DEC FIXED(3), #################################################        
       2 NBIVVOL  DEC FIXED(3), #################################################        
       2 NBINTOX  DEC FIXED(3), #################################################        
       2 NBDEFUI  DEC FIXED(3), #################################################        
       2 NBFRASS  DEC FIXED(3), #################################################        
       2 NBDECPE  DEC FIXED(3), #################################################        
       2 CDPRASS  CHAR(1),      ######################################################        
       2 CDPORES  CHAR(1),      ######################################################        
       2 CDIDRES  CHAR(1),      ######################################################        
       2 TABCMP(3),        
        3 NOIDCMP  CHAR(4),     #####################################################        
        3 DAXPCMP  DEC FIXED(7),################################################        
        3 NOPOCMP  CHAR(12),    ####################################################        
                                /*--!  ! 1=RC 2=RISQ.ANN. 3=CAS       */        
       2 CDIMPRE  CHAR(1),      ######################################################        
       2 CDCMGES  DEC FIXED(7), #################################################        
       2 CDREFCI  CHAR(1),      ######################################################        
       2 CDMOTRE  CHAR(2),      ######################################################        
       2 CDMOTAN  CHAR(2),      ######################################################        
       2 ECRCDEC  CHAR(2),      ######################################################        
       2 CDENVRE  CHAR(1),      ######################################################        
       2 FILLER  CHAR(450);     #####################################################        
 /* NRB - TDMTHO - GENERATION LE 05/05/2006 - 15:26        LGTH=00600 */        
 /***********************************************************        
 *  SEGMENT DB DEVIS A2 INFOS COMPLEMENTAIRES PROPOSITIONS  *        
 ***********************************************************/        
 DCL  1 SMDEVIS_018 ,           ###########################################################        
 /*K*/ 2 CDTYKEY  CHAR(1),      /*CD!  !TYPE DE CLE                   */        
                                /*--!  !A = AFFILIE                   */        
                                /*--!  !D = DATE                      */        
 /*K*/ 2 NOIDKEY  DEC FIXED(9), /*NO!  !SI A :NUMERO AFFILIE  (7)     */        
                                /*--!  !SI D :DATE DU DEVIS (7)       */        
 /*K*/ 2 NOSQDEV  DEC FIXED(7), /*NO!  !NUMERO DE DEVIS               */        
                                /*--!  !SI A :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
                                /*--!  !SI D :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
 /*K*/ 2 NOSQTXT  DEC FIXED(3), /*NO!  !NUMERO DU COPY                */        
       2 CDTYPRO  CHAR(7),      ######################################################        
       2 CDSBPRO  CHAR(7),      ######################################################        
       2 CDVEPRO  CHAR(3),      ######################################################        
       2 NOSQINT  PIC'(5)9',    ####################################################        
       2 NOSQSUJ  PIC'(5)9',    ####################################################        
       2 DATEMAJ  DEC FIXED(7), #################################################        
       2 TIMEMAJ  DEC FIXED(6), #################################################        
       2 TBEGCDV(16)  BIT(1),   ###################################################        
       2 TBEGREM(16)  BIT(1),   ###################################################        
       2 DATAFIX  CHAR(6),      ######################################################        
       2 DAEFFPO  DEC FIXED(7), #################################################        
       2 NODOMPO  DEC FIXED(12),################################################        
       2 NOCPTDB  DEC FIXED(12),################################################        
       2 NOIDDXC  CHAR(12),     #####################################################        
       2 DAPERCO  DEC FIXED(7), #################################################        
       2 NOPERCO  CHAR(10),     #####################################################        
       2 DANAITI  DEC FIXED(7), #################################################        
       2 CDQUATI  CHAR(1),      ######################################################        
       2 CDRSTIT  CHAR(1),      ######################################################        
       2 CDLGTIT  CHAR(1),      ######################################################        
       2 LTNOMTI  CHAR(20),     #####################################################        
       2 LTPRETI  CHAR(15),     #####################################################        
       2 LTRUETI  CHAR(30),     #####################################################        
       2 CDCPOTI  CHAR(6),      ######################################################        
       2 LTLOCTI  CHAR(25),     #####################################################        
       2 CDPAYTI  CHAR(3),      ######################################################        
       2 NOTELTI  CHAR(16),     #####################################################        
       2 DAPERTI  DEC FIXED(7), #################################################        
       2 NOPERTI  CHAR(10),     #####################################################        
       2 LTPROTI  CHAR(15),     #####################################################        
       2 CDRSPRE  CHAR(1),      ######################################################        
       2 CDLGPRE  CHAR(1),      ######################################################        
       2 LTNOMPR  CHAR(20),     #####################################################        
       2 LTPREPR  CHAR(15),     #####################################################        
       2 LTRUEPR  CHAR(30),     #####################################################        
       2 CDCPOPR  CHAR(6),      ######################################################        
       2 LTLOCPR  CHAR(25),     #####################################################        
       2 CDPAYPR  CHAR(3),      ######################################################        
       2 DAPERPR  DEC FIXED(7), #################################################        
       2 NOPERPR  CHAR(10),     #####################################################        
       2 JEUNECO(3),        
        3 LTNMCON  CHAR(20),    ####################################################        
        3 LTPRCON  CHAR(15),    ####################################################        
        3 DATENAI  DEC FIXED(7),################################################        
        3 DAPERMI  DEC FIXED(5),################################################        
        3 CDQUACO  CHAR(1),     #####################################################        
        3 CDSUPPL  CHAR(1),     #####################################################        
       2 DAECHCT  CHAR(4),      ######################################################        
       2 FILLER  CHAR(97);      ######################################################        
 /* NRB - TDMSOX - GENERATION LE 10/06/2010 - 16:19        LGTH=00600 */        
 /***************************************        
 *  SEGMENT DB DEVIS NOUVELLE ERGONOMIE *        
 ***************************************/        
                                /*--!  !SI A :NUMERO AFFILIE          */        
                                /*--!  !SI I :DATE DU DEVIS           */        
                                /*--!  !SI D :DATE DU DEVIS           */        
 DCL  1 SMDEVIS_047 ,           ###########################################################        
 /*K*/ 2 CDTYKEY  CHAR(1),      /*CD!  !TYPE DE CLE                   */        
                                /*--!  !A = AFFILE                    */        
                                /*--!  !D = DATE                      */        
 /*K*/ 2 NOIDKEY  DEC FIXED(9), /*NO!  !SI A :NUMERO AFFILIE  (7)     */        
                                /*--!  !SI D :DATE DU DEVIS           */        
 /*K*/ 2 NOSQDEV  DEC FIXED(7), /*NO!  !NUMERO DE DEVIS               */        
                                /*--!  !SI A :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
                                /*--!  !SI D :NUMERO DEVIS     (4)    */        
                                /*--!  !     :VERSION DEVIS    (3)    */        
 /*K*/ 2 NOSQTXT  DEC FIXED(3), /*NO!  !NUMERO DU COPY                */        
       2 CDTYPRO  CHAR(7),      ######################################################        
       2 CDSBPRO  CHAR(7),      ######################################################        
       2 CDVEPRO  CHAR(3),      ######################################################        
       2 NOSQINT  PIC'(5)9',    ####################################################        
       2 NOSQSUJ  PIC'(5)9',    ####################################################        
       2 DATEMAJ  DEC FIXED(7), #################################################        
       2 TIMEMAJ  DEC FIXED(6), #################################################        
       2 TBEGCDV(16)  BIT(1),   ###################################################        
       2 TBEGREM(16)  BIT(1),   ###################################################        
       2 DATAFIX  CHAR(6),      ######################################################        
       2 CDIDPRO  CHAR(3),      ######################################################        
       2 NUVSPRO  PIC'99',      ######################################################        
       2 CDANSSI  CHAR(2),      ######################################################        
       2 NBSI5AN  DEC FIXED(3), #################################################        
       2 CDASANT  CHAR(2),      ######################################################        
       2 CDCLFID  CHAR(1),      ######################################################        
       2 CDCIBCL  CHAR(2),      ######################################################        
       2 CDPKVIR  CHAR(3),      ######################################################        
       2 CDOMETH  CHAR(1),      ######################################################        
       2 VATMCVH  DEC FIXED(7), #################################################        
       2 CDOLDVH  CHAR(1),      ######################################################        
       2 CDECOVH  CHAR(2),      ######################################################        
       2 NBKMAVH  DEC FIXED(3), #################################################        
       2 TBDETG2(10),        
        3 CDGARAS  CHAR(3),     #####################################################        
        3 CDFRANS  CHAR(2),     #####################################################        
        3 CDTYFRS  CHAR(1),     #####################################################        
        3 CDTARJE  CHAR(1),     #####################################################        
        3 CDMOMJR  CHAR(2),     #####################################################        
        3 DAEFMJR  DEC FIXED(7),################################################        
        3 NBDUMJR  PIC'99',     #####################################################        
       2 TBJEUCD(2),        
        3 CDRSSCD  CHAR(1),     #####################################################        
        3 LTNOMCD  CHAR(20),    ####################################################        
        3 LTPRECD  CHAR(15),    ####################################################        
        3 DANAICD  DEC FIXED(7),################################################        
        3 LTRUECD  CHAR(30),    ####################################################        
        3 CDCPOCD  CHAR(6),     #####################################################        
        3 LTLOCAD  CHAR(25),    ####################################################        
       2 CDPROFS  CHAR(2),      ######################################################        
       2 CDGEPRO  CHAR(2),      ######################################################        
       2 FILLER  CHAR(160);     #####################################################        
 /* NRB - TDMWEL - Generation le 21/02/2002 - 16:15        Lgth=02010 */        
 /* NRB - TDMSAU - Generation le 27/03/2000 - 09:51        Lgth=02010 */        
 /*******************        
 *  SEGMENT SCRATCH *        
 *******************/        
 DCL  1 SMSCRAT ,                           ###############################################################        
                                            /*DB!  !DCR10   !SMSCRAT  */        
                                            /*DB!  !DDO09   !SMSCRAT  */        
 /*K*/ 2 NOIDSCR  CHAR(10),                 /*CD!  !NOM DE LA SCRATCH */        
       2 LTNMSCR  CHAR(2000);               ###################################################        
         
         
  DCL 1 SSA_SMSCRAT,        
         2 FIL1         CHAR (8)       INIT ('SMSCRAT'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KSMSCRAT'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (10),        
         2 FIL4         CHAR (1)       INIT (')');        
  /*DCL   LTNMSCR_R        CHAR (2000)      DEF SMSCRAT.LTNMSCR ; */        
  DCL   LTNMSCR_R CHAR (2000) BASED(ADDR(SMSCRAT.LTNMSCR)) ;        
         
 /********************************************        
 *                    SPA                    *        
 ********************************************/        
 /*---------------------------------------------------------- SCENARI */        
 /*  DFINITION DES VARIABLES D'INITIALISATION DU SCENARIO             */        
 /*  ----------------------------------------------------             */        
              /* BLOCAGE CODE OPERATION */        
              /* NOUVEAU CANEVAS */        
         
 /*---------------------------------------------------------- SPAAREA */        
 DCL     SPA001_P            PTR;        
 DCL 1   SPA001_R            BASED(SPA001_P),        
      2  CDPOSTE             CHAR (4),        
      2  LTPOSTE             CHAR (25),        
      2  RESERVE             CHAR (1);        
 DCL 1   SCENARI             BASED(SPA001_P),        
      2  NOPGACT             CHAR (1),       #########################################        
      2  NOPGPRV(6)          CHAR (1),       #########################################        
      2  NUMIDLL(6)          BIN FIXED(15),  ####################################        
      2  TBCATOP             CHAR (06),      ########################################        
      2  CDTYSEL             CHAR (01),      ########################################        
      2  NBPAGE1             PIC '99',       #########################################        
      2  TBSCENA (16)        BIT (1);        ##########################################        
         
 DCL     SPA002_P            PTR;        
 DCL 1   SCENA02             BASED(SPA002_P),        
      2  NOIDCLI             CHAR (08),      ########################################        
      2  NOIDSCR             PIC '9999',     #######################################        
      2  RFSIGNA             CHAR (08);      ########################################        
         
 SPA001_P = ADDR(SPA.LTOPTR2);        
 SPA002_P = ADDR(SPA.LTRUE1A);        
         
 DCL DADESIN_SPA_F          FIXED DEC(7) BASED (ADDR(SPA.DADESIN_C));        
         
 DCL 1   SPA        BASED(GA2016J.SPA_PTR),        
         
         
     /*  PARTIE FIXE  */        
         
      2  LL_SPA              BIN FIXED(15),        
      2  XXXX                CHAR (4),        
      2  TRANSAC             CHAR (8),        
      2  MSG_SPA             CHAR (1),      ##########################################        
      2  CDTYECR             CHAR (01),     ###############################        
      2  CDRTTSS             CHAR (02),     ########################################        
      2  NORFPRT             CHAR (08),     ##################################        
      2  CDSCTRN             CHAR (01),     #########################################        
      2  CDATTRN             CHAR (02),     ########################################        
      2  LTSCTRN             CHAR (04),     ####################################        
      2  CDEVTRN             CHAR (01),     #########################################        
      2  CDUTTRN             CHAR (08),     #########################################        
      2  CDOPTRN             CHAR (05),     #################################        
      2  TBRETRN(6)          CHAR (08),     #####################################        
      2  TBFCACT(24)         BIT  (1),      ######################################        
      2  CMDEXEC             CHAR (01),     ########################################        
      2  LTOPTRN             CHAR (30),     ######################################        
      2  LTOPTR2             CHAR (30),     ######################################        
      2  TRANS1              CHAR (08),     #######################################        
      2  TRANS2              CHAR (08),     #######################################        
      2  CDLGTRN             PIC '9',       #######################################        
      2  NOIDAFF             FIXED (7),     ################################        
      2  LTNMAFF             CHAR (30),     ##############################        
      2  CDRSAFF             CHAR (1),      #######################################        
      2  CDSEXAF             CHAR (1),      ##############################        
      2  CDLGEAF             CHAR (1),      ###############################        
      2  CDPOGEO             FIXED(5),      #########################################        
      2  NORULOC             FIXED(7),      #########################################        
      2  LTRUE1A             CHAR (20),     ##################################        
      2  CDCPOAF             CHAR (06),     ##############################        
      2  LTLOCAF             CHAR (25),     ##################################        
      2  NOHA1AF             BIN FIXED(15), #############################        
      2  NOHA1FR             CHAR (01),     ##################################        
      2  NOHA2AF             CHAR (04),     #####################################        
      2  LTRUEAF             CHAR(25),      #######################        
      2  CDPAYAF             CHAR(03),      #############################        
      2  NOIDPOL             FIXED (8),     ################################        
      2  CDTYPOL             CHAR (2),      ##################################        
      2  CDLGPOL             CHAR (1),      ######################################        
      2  CDETAPO             CHAR (1),      ##########################################        
      2  LTNMALP             CHAR (06),     #####################################        
      2  NODOMPO             FIXED(11),     ######################################        
      2  NOCPTPO             FIXED(11),     #####################################        
      2  NOIDNAI             FIXED (7),     ##################################        
      2  NOIDPLQ             CHAR (5),      ################################        
      2  NOIDCHA             CHAR (20),     ################################        
      2  TBTYPAF             BIT (240),     ################################        
                                            /* 60 : CHOIX EURO  */        
      2  TBSEXAF (2)         CHAR (01),     #####################################        
      2  CDGRPCL             CHAR (01),     #####################################        
      2  CDCMGES             CHAR (08),     ####################################        
      2  CDCMPRO             CHAR (01),     #######################################        
      2  NOTL1AF             FIXED (3),     ######################################        
      2  NOTL2AF             FIXED (9),     ######################################        
      2  NOIDSIN             FIXED (9),     ######################################        
      2  NOPPAFF             FIXED (7),     ########################################        
      2  CDCATOP             CHAR (01),     ########################################        
      2  LTOPCOM             CHAR (30),     ########################################        
      2  TRANS3              CHAR (08),     ########################################        
      2  NOORAFF             FIXED (7),     ######################################        
      2  NOIDFAC             CHAR (03),     ####################################        
      2  DANAIAF             FIXED (10),    ###################################        
      2  NOIDFND             CHAR  (03),    #################################        
      2  NOIDMAT             CHAR  (11),    #####################################        
      2  NONATAF             FIXED (11),    ##############################        
      2  LTABRFP             CHAR  (30),    ##############################        
                                            /*  OU CAISSE ET TRANSIT*/        
                                            /* VOIR SPACODEF        */        
                                            /* OU GROUPE+MEDECIN    */        
                                            /* OU RENTE T1          */        
      2  CDEGCOU             CHAR  (01),    ########################################        
      2  TBEGCOD_AFF         BIT   (40),    ########################################        
      2  CDNATPA_RT          CHAR  (02),    ########################################        
                                            /* D5: NUMERO DU PROPRIET.*/        
      2  DAIMPPA_RT          FIXED (5),     #########################################        
      2  CDAPPPR             CHAR  (02),    #######################################        
      2  CDCATTR             CHAR (01),     ###############################        
      2  CDRFPRT             CHAR (03),     #########################################        
      2  NOAVECO             PIC'(3)9',     #########################################        
      2  NOIDFAM             FIXED (7),     ####################################        
                                            /* NO INTERVENANT PRODUCT.*/        
      2  CDTRASW             CHAR  (01),    #######################################        
      2  TBCDCLI             CHAR  (09),    #######################################        
      2  CDALCLI             CHAR  (01),    #######################################        
      2  CDLGFAM             CHAR  (01),    #######################################        
      2  CDLGRUE             CHAR  (01),    #######################################        
      2  NOIDREM             PIC '99',      ################################        
      2  NBSINPO             FIXED BIN(15), #################################        
      2  CDEVTRA             CHAR (01),     ####################################        
      2  NOAF1EX             FIXED(07),     #####################################        
      2  SW_MEMOSIN          CHAR (1),      ######################################        
      2  NOAF2EX             BIN FIXED (15),################################        
      2  ANSINPO             PIC '99',      #######################################        
      2  CDTYFND             CHAR  (01),    ####################################        
                                            /* EN SINISTRE, = A SI*/        
                                            /* PAIEMENT TYPE 89 */        
      2  DADESIN_C           CHAR  (04),    ####################################        
      2  NOIDCRT_SC          FIXED (7),     #####################################        
      2  NOIDSIN_RL          FIXED (9),     #######################################        
      2  CDTYPOL_RL          CHAR  (02),    ######################################        
      2  TBEGGES (8)         BIT   (01),    ######################################        
                                            /* 1=SUIVI GESTIONNAIRE */        
                                            /* 2=SUPER GESTIONNAIRE */        
                                            /* 3=COMMANDE DE MAJ    */        
                                            /* 4=CDE NON PROTEGEE   */        
                                            /* 5= ON=KERNEL CONVERTI*/        
                                            /* 6= ON=NOUVEAU CANEVAS*/        
                                            /* 7=DEVISE OUTPUT T.T. */        
                                            /* 8=CLAUSIER TYPE "U"  */        
      2  NORTMEM             CHAR  (02),    ############################        
      2  CDDVTRN             CHAR  (01),    ######################################        
      2  CDPGTRN             CHAR  (01),    ######################################        
      2  CDDVPOL             CHAR  (01),    ######################################        
      2  CDMODTT             CHAR  (01),    ######################################        
      2  NOTYPDC             PIC '99',      ########################################        
         
     /*  PARTIE VARIABLE : A L'USAGE D'UNE TRANSACTION APPELANTE */        
         
            /* SPA FIXE                         */        
 /*------------------------------------------------------------------*/        
 /*          UTILISE :          GA2016                               */        
 /*------------------------------------------------------------------*/        
 /* DCL 1    SPA                                                     */        
 /*------------------------------------------------------------------*/        
 /* ---- SPA COMPLEMENTAIRE LONGUEUR 200 --------------------------- */        
      2  MEMOCMD,                           ##############################################################        
       3 CDNATOP             CHAR(01),      #########################################        
       3 CDTYPOP             CHAR(01),      #########################################        
       3 CDOBJOP             CHAR(03),      #########################################        
      2  LTOBJOP             CHAR(75),      #########################################        
      2  NOSQMEM             BIN FIXED(15), ####################################        
      2  CDTTAPP             CHAR(2),       ##########################################        
      2  CDAPPEL             CHAR(1),       ##########################################        
      2  CDMMSEL             CHAR(3),       ##########################################        
      2  LTINTKN             CHAR(20),      #########################################        
                                            /* VOIR SPAAREAK         */        
      2  CDLASTK             CHAR(1),       ##########################################        
      2  NOIDRSQ             FIXED(05),     ########################################        
      2  NOLTGEN             CHAR(13),      #########################################        
      2  RSVSPAC             CHAR(75),      #########################################        
 /* ---------------------------------------------------------------- */        
      2  INFOS_USER, #####################################        
         3 NOIDUSR   PIC'(7)9',        
         3 NOSQUSR   PIC'99',        
         3 TYPUSER   CHAR(7),        
         3 CDLGUSR   CHAR(1),        
         3 TBEGUSR(16) BIT(1), ####################################        
         
         3 CDSTAT    CHAR(05),        
         3 LTSITE    CHAR(10),        
         3 CDAFGRP   CHAR(07),        
         3 CDMSETH   CHAR(01), ##################################        
         3 CDTYSOU   CHAR(5),        
      2   SPAS1096,        
 /*       sert au retour d'identification quand la personne n'est        
          pas encore affiliee , elle ne peut pas continuer ...        
          PS : ces donnees sont utilisees dans l'identification !!!  */        
       3   CDDEST            CHAR(05),    #########################################        
       3   NODEVI            CHAR(13),    #########################################        
                                          /* 00SAAMMJJnnnn           */        
       3   CDMODULO          CHAR(02),    #########################################        
       3   LTEMAIL           CHAR(50),        
       3   CDTYPRO           CHAR(2),     ##########################################        
       3   CDGEPRO           CHAR(2),     ##########################################        
       3   FILLSP1           CHAR(30),        
         
      2   SPAVAR,        
         
       3   LTOBJOP_016       CHAR(75), #########################################        
         
 /*       Infos identification : Uniquement si SPA.NOIDAFF > 0       */        
       3   IDENTI,        
        4   CDRSAFF          CHAR (1),        
        4   NOIDAFF          FIXED(7),        
        4   LTNMAFF          CHAR (30),        
        4   LTPRAFF          CHAR (15),        
        4   DANAIAF          PIC'(8)9', ########################################        
        4   CDSEXAF          CHAR (1),        
        4   CDLGEAF          CHAR (1),        
        4   LTRUEAF          CHAR (25),        
        4   NOHA1AF          BIN FIXED(15),        
        4   NOHA2AF          CHAR (04),        
        4   LTLOCAF          CHAR (25),        
        4   CDCPOAF          CHAR (06),        
        4   EMAILAF          CHAR (50),        
        4   CDTYPRO          CHAR(2),  ##########################################        
        4   CDGEPRO          CHAR(2),  ##########################################        
        4   DADEPER          PIC'(8)9', ########################################        
         
       3   CDTYPOP           CHAR(01), #########################################        
       3   CDLIMIT           CHAR(01), #########################################        
       3   CDBLOCK           CHAR(01), #########################################        
       3   NEWDEVI           CHAR(01), #########################################        
       3   NOIDDEV           CHAR(13), #########################################        
       3   DEVISAF           CHAR(13), #########################################        
       3   VERSDEV           FIXED(03),########################################        
       3   AUTORSO           CHAR(01), #########################################        
 /*   R_ETAPE = "A2016n" pour etre sr de raz la SPAVAR !!!          */        
       3   R_ETAPE           CHAR(06), #########################################        
       3   DAVALID           CHAR(10), #########################################        
       3   NBRELAN           PIC '9',  ##########################################        
         
       3   FILLSP2           CHAR(10),        
         
 /*       vehicule choisi en guidance WA2083                         */        
      2   SCENARIO_1,        
 /*       ===========                                                */        
       3   ANNCSTR           PIC'(4)9',   ########################################        
       3   MARDEBU           CHAR(40),    #########################################        
       3   TXTCARB           CHAR(08),    #########################################        
         
       3   NOIDMAR           FIXED(07),        
       3   NOIDMOD           FIXED(07),        
       3   NOIDTYP           FIXED(07),        
       3   LTMARQU           CHAR(40),        
       3   LTMODEL           CHAR(40),        
       3   LTTYPEV           CHAR(40),        
       3   NBRTRAN           FIXED(03),        
       3   NBTYPKW           FIXED(03),        
       3   CDTYOP3           CHAR(01),    ##########################################        
       3   CDTYDM3           CHAR(01),    ##########################################        
       3   PRIHTVA           FIXED(9,2),        
       3   NBRPORT           FIXED(03),        
       3   LTBOITE           CHAR(50),        
       3   LTCARBU           CHAR(50),        
       3   TYPCYLI           FIXED(05),        
       3   NBCVDIN           FIXED(03),        
       3   NBVITES           FIXED(03),        
       3   CDSPORT           CHAR(01),        
       3   POIDVID           FIXED(05),        
       3   TAXETMC           FIXED(9,2),        
       3   DAFINIM           PIC'(6)9',        
       3   CDECOV2           CHAR(01),     #########################################        
         
 /*       Options montes d'origine et accessoires supplementaires    */        
 /*       08.06.2010 New Tarifs : on ne passe plus sur cette page    */        
      2   SCENARIO_4,        
 /*       ===========                                                */        
 /*        
       3   TAB_OPT(100),        
        4   NOIDTXT          FIXED(07),        
        4   PRIOPTI          FIXED(09,2),        
 */        
 /*       les 14 accessoires/options e memoriser dans le devis    */        
       3   TAB_SUP(14),        
        4   LTOPTSU          CHAR(50),        
        4   PRIOPSU          FIXED(09,2),        
 /*       Options selectionnees                                      */        
 /*    3   SEL_OPT(100)      CHAR(01),          Y/N                  */        
       3   TOTALAC           FIXED(9,2),        
         
 /*       Infos conducteur                                           */        
      2   SCENARIO_5,        
 /*       ===========                                                */        
       3   DANAIPR           PIC'(8)9',      ############################        
       3   CDPOPRE           PIC'(4)9',        
       3   VACATVH           FIXED(9,2),        
       3   CDPOSRM           CHAR(1),        ##########################################        
       3   CDUSAVH           CHAR(1),        ##########################################        
       3   CDCDC26           CHAR(1),        ##########################################        
       3   CDASTMC           CHAR(1),        ##########################################        
       3   BOVHOCC           CHAR(1),        ##########################################        
       3   NBSINIS           PIC '99',       #########################################        
       3   DAPERMI           PIC'(8)9',      ########################################        
       3   BOAUTCP           CHAR(1),        ##########################################        
       3   CDTYPRO           CHAR(2),        ##########################################        
       3   CDGEPRO           CHAR(2),        ##########################################        
       3   BOHOREC           CHAR(1),        ##########################################        
       3   NBKMPAN           PIC'(6)9',      ########################################        
       3   AGEPREN           PIC'99',        ##########################################        
       3   STARTOK           CHAR(01),       #########################################        
 /*        Si CDJEUNE = 1=> voir donnees du scenario 8               */        
       3   CDJEUNE           PIC'9',         ###########################################        
       3   AGEPERM           PIC'99',        ##########################################        
         
 /*       Resultat devis auto                                        */        
      2   SCENARIO_6,        
 /*       ===========                                                */        
       3   CDPADIV           CHAR(02),       #########################################        
       3   CDBMDET           PIC'99',        ##########################################        
       3   CDCIBCL           CHAR(02),       #########################################        
       3   CDPROMO           CHAR(01),       #########################################        
                                             /* 1= eco + > 10.000kms */        
                                             /* 2= < 10.000kms       */        
                                             /* 3= < 10.000kms + eco */        
       3   NBKMAVH           PIC'999',       #########################################        
       3   RESULTAT_AUTO,        
        4   MTGARCI          FIXED(13,2),    ######################################        
        4   MTGACAS          FIXED(13,2),    ######################################        
        4   MTGACA1          FIXED(13,2),    ######################################        
        4   MTGAASS          FIXED(13,2),    ######################################        
         
 /*         mobility                                                 */        
        4   MTGAMOB          FIXED(13,2),    ######################################        
        4   MTGAMO1          FIXED(13,2),    ######################################        
        4   MTGAMO2          FIXED(13,2),    ######################################        
         
 /*         Montants mini omniums                                    */        
        4   MTGAOM1          FIXED(13,2),    ######################################        
        4   MTGAOM2          FIXED(13,2),    ######################################        
         
 /*         Montants des omniums pour chaque niveau de franchise     */        
        4   TB_OMNI(3),        
          5  MTGAOM3         FIXED(13,2),    ######################################        
          5  MTGAOM4         FIXED(13,2),    ######################################        
         
        4   TBPRIME(20),        
          5  CDTYGAR          CHAR(03),      ########################################        
          5  CDTFGAR          CHAR(02),      ########################################        
          5  NUVSTRF          PIC'99',       #########################################        
          5  MTPBMRD          FIXED(13,2),   #####################################        
         
       3   RESULTAT_AUTO_PROMO,        
        4   MTGARCI          FIXED(13,2),    ######################################        
        4   MTGACAS          FIXED(13,2),    ######################################        
        4   MTGACA1          FIXED(13,2),    ######################################        
        4   MTGAASS          FIXED(13,2),    ######################################        
         
 /*         mobility                                                 */        
        4   MTGAMOB          FIXED(13,2),    ######################################        
        4   MTGAMO1          FIXED(13,2),    ######################################        
        4   MTGAMO2          FIXED(13,2),    ######################################        
         
 /*         Montants mini omniums                                    */        
        4   MTGAOM1          FIXED(13,2),    ######################################        
        4   MTGAOM2          FIXED(13,2),    ######################################        
         
 /*         Montants des omniums pour chaque niveau de franchise     */        
        4   TB_OMNI(3),        
          5  MTGAOM3         FIXED(13,2),    ######################################        
          5  MTGAOM4         FIXED(13,2),    ######################################        
         
        4   TBPRIME(20),        
          5 CDTYGAR          CHAR(03),       #########################################        
          5 CDTFGAR          CHAR(02),       #########################################        
          5 NUVSTRF          PIC'99',        ##########################################        
          5 MTPBMRD          FIXED(13,2),    ######################################        
         
       3   RESULTAT_REM,        
        4   MTRMRCI          FIXED(13,2),    ######################################        
        4   MTRMVO1          FIXED(13,2),    ######################################        
        4   MTRMIN1          FIXED(13,2),    ######################################        
        4   MTRMBRI          FIXED(13,2),    ######################################        
        4   MTRMDM3          FIXED(13,2),    ######################################        
        4   MTRMDM4          FIXED(13,2),    ######################################        
         
        4   TBPRIME(10),        
          5 CDTYGAR          CHAR(03),       #########################################        
          5 CDTFGAR          CHAR(02),       #########################################        
          5 NUVSTRF          PIC'99',        ##########################################        
          5 MTPBMRD          FIXED(13,2),    ######################################        
         
 /*       Garanties choisies                                         */        
       3   SELECT_GAR,        
        4   CDSERCI          CHAR(01),       #########################################        
        4   CDSECAS          CHAR(01),       #########################################        
        4   CDSECA1          CHAR(01),       #########################################        
        4   CDSEASS          CHAR(01),       #########################################        
        4   CDTYPOM          CHAR(01),       #########################################        
                                             /* choisie : 1,2,3,4    */        
        4   CDNIVFR          CHAR(01),       #########################################        
                                             /* choisi 1,2,3         */        
                                             /* !!! si jeune         */        
        4   CDSEMOB          CHAR(01),       #########################################        
        4   CDSEMO1          CHAR(01),       #########################################        
         
 /*       pour la remorque                                           */        
        4   CDRMRCI          CHAR(01),       #########################################        
        4   CDRMVO1          CHAR(01),       #########################################        
        4   CDRMIN1          CHAR(01),       #########################################        
        4   CDRMBRI          CHAR(01),       #########################################        
        4   CDRMDM3          CHAR(01),       #########################################        
        4   CDRMDM4          CHAR(01),       #########################################        
         
 /*       Infos remorque                                             */        
      2   SCENARIO_7,        
 /*       ===========                                                */        
       3   LTMARRM           CHAR(15),        
       3   ANCSTRM           PIC'(4)9',        
       3   MTCATRM           FIXED(9,2),        
       3   MTACTRM           FIXED(9,2),        
       3   NUPDSRM           PIC'(5)9',        
         
 /*       Infos tarif jeune                                          */        
      2   SCENARIO_8,        
 /*       ===========                                                */        
       3   NBSINDM           PIC'99',        
       3   CDJEUFA           CHAR(01), #########################################        
       3   CDTY2PO           CHAR(01), #########################################        
       3   CDSTACO           CHAR(01), #########################################        
       3   CDENFCH           CHAR(01), #########################################        
       3   CDSTART           CHAR(01), #########################################        
         
 /*       souscription 1                                             */        
      2   SCENARIO_9,        
 /*       ===========                                                */        
       3   NUMCPIE           CHAR(5),  ##########################################        
       3   NOIDPOC           CHAR(15), #########################################        
       3   DAECHRC           CHAR(08), #########################################        
       3   CDRESRI           CHAR(01), #########################################        
       3   CDTYPRE           CHAR(01), #########################################        
       3   NUMSMRS           CHAR(06), #########################################        
         
 /*       souscription 2                                             */        
      2   SCENARIO_10,      #########################################################        
 /*       ===========                                                */        
       3   LTNOMCO           CHAR(30), #########################################        
       3   LTPRECO           CHAR(30), #########################################        
       3   DANAICO           CHAR(08), #########################################        
       3   LTEMPPR           CHAR(20), #########################################        
       3   CDTYPPR           CHAR(01), #########################################        
       3   CDCONAL           CHAR(1),  ##########################################        
       3   CDCONIV           CHAR(1),  ##########################################        
       3   CDCONFU           CHAR(1),  ##########################################        
       3   NBSINVO           PIC'9',   ###########################################        
       3   NBSINDM           PIC'9',   ###########################################        
       3   NBDEPER           PIC'9',   ###########################################        
         
 /*       souscription 3                                             */        
      2   SCENARIO_11,       #########################################################        
 /*       ===========                                                */        
       3   LTNMHA1           CHAR(30), #########################################        
       3   LTPRHA1           CHAR(30), #########################################        
       3   DANAIS1           PIC'(8)9',########################################        
       3   ANPERM1           CHAR(04), #########################################        
       3   CDQUHA1           CHAR(01), #########################################        
       3   LTQUHA1           CHAR(12), #########################################        
       3   LTNMHA2           CHAR(30), #########################################        
       3   LTPRHA2           CHAR(30), #########################################        
       3   DANAIS2           PIC'(8)9',########################################        
       3   ANPERM2           CHAR(04), #########################################        
       3   CDQUHA2           CHAR(01), #########################################        
       3   LTQUHA2           CHAR(12), #########################################        
       3   LTNMHA3           CHAR(30), #########################################        
       3   LTPRHA3           CHAR(30), #########################################        
       3   DANAIS3           PIC'(8)9',########################################        
       3   ANPERM3           CHAR(04), #########################################        
       3   CDQUHA3           CHAR(01), #########################################        
       3   LTQUHA3           CHAR(12), #########################################        
         
 /*       souscription 4                                             */        
      2   SCENARIO_12,       #########################################################        
 /*       ===========                                                */        
       3   NUPLQVH           CHAR(07), #########################################        
       3   LTCHAVH           CHAR(17), #########################################        
       3   NUPLQRM           CHAR(07), #########################################        
       3   LTCHARM           CHAR(17), #########################################        
       3   DAEFFRC           PIC'(8)9',########################################        
       3   DAEFFAU           PIC'(8)9',########################################        
       3   CDMODPA           CHAR(01), #########################################        
       3   NBKMCPT           FIXED(7), #########################################        
         
      2   FILLER             CHAR(112);        
         
 /********************************************************************/        
 /* CDPROMO : code promo permanente (nov 2009)                       */        
 /* 1 = 15% sur RC  et Omnium                                        */        
 /* si moins de 10000 kms/an                                         */        
 /*                                                                  */        
 /* 2 = 25% sur RC  et 15% sur Omnium                                */        
 /* si moins de 10000 kms/an ET vehicule eco                         */        
 /*                                                                  */        
 /* 3 = 10% sur RC                                                   */        
 /* si vehicule eco (et pas < 10000kms/an)                           */        
 /********************************************************************/        
             /* SPA VARIABLE                     */        
         
 /***************************/        
 /*    FICHIERS             */        
 /***************************/        
 DCL SYSPRINT FILE STREAM OUTPUT PRINT;        
         
 /***************************/        
 /*    DESCRIPTION DU MID   */        
 /***************************/        
 DCL 1 MIDC BASED(GA2016J.MID_PTR),        
 /* >>> HEADER DU MID         */        
      2   LL                  BIN FIXED(15),        
      2   Z1                  CHAR(1),        
      2   Z2                  CHAR(1),        
      2   HEADER,        
       3  TRANSAC             CHAR (08),  ############################        
       3  NOIDCLI             CHAR (08),  ############################        
       3  NOIDSCR             CHAR (04),  ############################        
       3  RFSIGNA             CHAR (08),  ############################        
       3  CDLGTRN             CHAR (01),  ############################        
       3  CDDVTRN             CHAR (01),  ############################        
       3  CLE                 CHAR (01),  ############################        
       3  CDOPTRN             CHAR (05),  ############################        
       3  CDIDSES             CHAR (01),  ############################        
       3  NODOACT             CHAR (02),  ############################        
       3  RESERVE             CHAR (07),  ############################        
 /*     HEADER DU MID     <<< */        
         
 /* ------------------------------------------------------------ */        
 /* DCL 1   MIDC   UTILISE : TA2016   TA2016   GA2016C           */        
 /* ------------------------------------------------------------ */        
  /* INFOS_STAT */        
 /*-----------------------------------------------------------*/        
 /*   MID    UTILISE POUR LES STATISTIQUES DU SITE ETHIAS     */        
 /*-----------------------------------------------------------*/        
 /* CKI 17.02.06 : SI MFS => AJOUT DANS INPUT JSM328M LONG 59 */        
 /*   (VOIR PPH102)                                           */        
 /*-----------------------------------------------------------*/        
      2  CDLGPAG     CHAR (01),        
      2  CDENTREE    CHAR (01),        
      2  CDTYPVI     CHAR (07),        
      2  NOPGACT     CHAR (16),        
      2  NOPGDEM     CHAR (16),        
      2  NOIDUSR     PIC '(07)9',        
      2  NOSQUSR     PIC '99',        
      2  BANNER      CHAR (09),        
         
   2  NUPLQVH          CHAR(07),             #############################################        
   2  LTCHAVH          CHAR(17),             #############################################        
   2  NUPLQRM          CHAR(07),             #############################################        
   2  LTCHARM          CHAR(17),             #############################################        
         
   2  JJEFFRC          CHAR(02),             #############################################        
   2  MMEFFRC          CHAR(02),             #############################################        
   2  AAEFFRC          CHAR(04),             #############################################        
         
   2  JJEFFAU          CHAR(02),             #############################################        
   2  MMEFFAU          CHAR(02),             #############################################        
   2  AAEFFAU          CHAR(04),             #############################################        
         
         
   2  NBKMCPT          CHAR(07);             #############################################        
         
         
 /***************************/        
 /*    DESCRIPTION DU MOD   */        
 /***************************/        
 DCL 1 PAGEC BASED(GA2016J.PAGE_PTR),        
 /* >>> HEADER PAGE 1       */        
      2  LL                 BIN FIXED(15),        
      2  ZZ                 BIN FIXED(15),        
      2  LPG                CHAR(02),        
      2  SCA                CHAR(02),        
      2  CDEXTOP            CHAR(08),  ##################################        
      2  NOIDSCR            CHAR(04),  ##################################        
      2  RFSIGNA            CHAR(08),  ##################################        
      2  CDLGTRN            CHAR(01),  ##################################        
      2  CDSCTRN            CHAR(01),  ##################################        
      2  LTSCTRN_A          CHAR(08),        
      2  LTSCTRN            CHAR(04),        
      2  LTOPTRN            CHAR(30),        
      2  CDOPTRN_A          CHAR(08),        
      2  CDOPTRN            CHAR(05),        
      2  BOMETRN            CHAR(01),        
      2  LTMETRN            CHAR(79),        
      2  RESERVE            CHAR(10),        
 /*     HEADER PAGE  1  <<< */        
 /* -------------------------------------------------------------- */        
 /* DCL 1   PAGEC     TRANSACTION: TA2016   TA2016   GA2016C       */        
 /* -------------------------------------------------------------- */        
 /* >>> HEADER 2 MOD      */        
      2  LTRFCSR            CHAR (07),  ####################################        
      2  NURFCSI            CHAR (03),  ####################################        
      2  NURFCSJ            CHAR (03),  ####################################        
      2  LTRFPOS            CHAR (07),  ####################################        
      2  NURFPSI            CHAR (03),  ####################################        
      2  NURFPSJ            CHAR (03),  ####################################        
      2  CDBTENT            CHAR (10),  ####################################        
      2  LTOPCDE            CHAR (60),  ####################################        
      2  RSERVE2            CHAR (60),  ####################################        
 /*     HEADER 2 MOD  <<< */        
      2 NOIDUSR         PIC'(7)9',        
      2 NOSQUSR         PIC '99',        
      2 NEWUSER         CHAR(1),        
      2 CDENTREE        CHAR (01),        
      2 NOIDPAG         CHAR(07),        
         
   2  NOIDDEV          CHAR(13),             #############################################        
   2  LTMARQU          CHAR(30),             #############################################        
   2  LTMODEL          CHAR(30),             #############################################        
   2  NUPLQVH          CHAR(07),             #############################################        
   2  LTCHAVH          CHAR(17),             #############################################        
   2  NUPUIVH          CHAR(03),             #############################################        
   2  TYPCYLI          CHAR(05),             #############################################        
   2  ANNCSTR          CHAR(04),             #############################################        
   2  NBPRTAV          CHAR(03),             #############################################        
   2  LTCARBU          CHAR(15),             #############################################        
   2  VACATVH          CHAR(10),             #############################################        
   2  VATAXIM          CHAR(10),             #############################################        
   2  CDUSAVH          CHAR(01),             #############################################        
   2  CDCDC26          CHAR(01),             #############################################        
   2  CDASTMC          CHAR(01),             #############################################        
         
   2  CDPOSRM          CHAR(01),             #############################################        
   2  LTMARRM          CHAR(15),             #############################################        
   2  NUPLQRM          CHAR(07),             #############################################        
   2  LTCHARM          CHAR(17),             #############################################        
   2  ANCSTRM          CHAR(04),             #############################################        
   2  MTCATRM          CHAR(10),             #############################################        
   2  MTACTRM          CHAR(10),             #############################################        
   2  NUPDSRM          CHAR(05),             #############################################        
         
   2  CDGARCI          CHAR(01),             #############################################        
   2  MTGARCI          CHAR(10),             #############################################        
   2  CDGACAS          CHAR(01),             #############################################        
   2  MTGACAS          CHAR(10),             #############################################        
   2  CDGACA1          CHAR(01),             #############################################        
   2  MTGACA1          CHAR(10),             #############################################        
   2  CDGAASS          CHAR(01),             #############################################        
   2  MTGAASS          CHAR(10),             #############################################        
         
   2  CDGAMOB          CHAR(01),             #############################################        
   2  MTGAMOB          CHAR(10),             #############################################        
   2  CDGAMO1          CHAR(01),             #############################################        
   2  MTGAMO1          CHAR(10),             #############################################        
         
   2  CDTYPOM          CHAR(01),             #############################################        
   2  CDNIVFR          CHAR(01),             ###############################################        
   2  TB_LTFR(03),        
    3  LTFRAGR         CHAR(05),             #############################################        
    3  LTFRNAG         CHAR(05),             #############################################        
   2  MTOMNIU          CHAR(10),             #############################################        
         
   2  CDPROMO          CHAR(01),             #############################################        
         
   2  CDRMRCI          CHAR(01),             #############################################        
   2  MTRMRCI          CHAR(10),             #############################################        
   2  CDRMVO1          CHAR(01),             #############################################        
   2  MTRMVO1          CHAR(10),             #############################################        
   2  CDRMIN1          CHAR(01),             #############################################        
   2  MTRMIN1          CHAR(10),             #############################################        
   2  CDRMBRI          CHAR(01),             #############################################        
   2  MTRMBRI          CHAR(10),             #############################################        
   2  CDRMDM3          CHAR(01),             #############################################        
   2  MTRMDM3          CHAR(10),             #############################################        
   2  CDRMDM4          CHAR(01),             #############################################        
   2  MTRMDM4          CHAR(10),             #############################################        
         
   2  JJEFFRC          CHAR(02),             #############################################        
   2  MMEFFRC          CHAR(02),             #############################################        
   2  AAEFFRC          CHAR(04),             #############################################        
         
   2  JJEFFAU          CHAR(02),             #############################################        
   2  MMEFFAU          CHAR(02),             #############################################        
   2  AAEFFAU          CHAR(04),             #############################################        
         
   2  NBKMPAN          CHAR(6),      ##############################################        
   2  NBKMCPT          CHAR(07);             #############################################        
         
 DCL  1  PAGECTXT       CHAR(STG(PAGEC)) BASED(ADDR(PAGEC));        
         
         
 /***************************************/        
 /*    DESCRIPTION DU MESSAGE D'ERREUR  */        
 /***************************************/        
 DCL 1 PAGEER BASED(GA2016J.PAGEER_PTR),        
         
 /************************************************************/        
 /*    PAGE D'ERREUR                                         */        
 /************************************************************/        
      2  LL                 BIN FIXED(15),        
      2  ZZ                 BIN FIXED(15),        
      2  LPG                CHAR (1),        
      2  LTOPTRN            CHAR(30),        
      2  LTMETRN            CHAR(79),        
      2  CDLGTRN            CHAR(01),   ##############################        
      2  LTRTPG1            CHAR(79),   ##############################        
      2  LTRTPG2            CHAR(79),   ##############################        
      2  LTRTPG3            CHAR(79);   ##############################        
         
         
 /*================== CONSTANTES ================================*/        
         
 DCL ON                  BIT(1)     VALUE('1'B);        
 DCL OFF                 BIT(1)     VALUE('0'B);        
 DCL NUM                 CHAR(10)   VALUE('0123456789');        
 DCL NUMB                CHAR(11)   VALUE('0123456789 ');        
 /********************************************************************/        
 /*     DECLARATION DES CARACTERES POUR TABLE 274                    */        
 /********************************************************************/        
         
 DCL MINUS274 CHAR (41)        
              VALUE ('abcdefghijklmnopqrstuvwxyzeee');        
         
      /*CARACTERES MINUSCULES EN CODE PAGE 274*/        
 /********************************************************************/        
 /*     DECLARATION DES CARACTERES POUR TABLE 500                    */        
 /********************************************************************/        
         
 DCL MINUS500 CHAR (41)        
              VALUE ('abcdefghijklmnopqrstuvwxyz{}@\');        
         
      /*CARACTERES MINUSCULES EN CODE PAGE 500*/        
 /********************************************************************/        
 /*     DECLARATION DES CARACTERES POUR TABLE 274 ET TABLE 500       */        
 /********************************************************************/        
         
 DCL MINUS CHAR (41);        
 DCL MAJUS CHAR (41)        
           VALUE ('ABCDEFGHIJKLMNOPQRSTUVWXYZEEEEUUUAAAIIOOC');        
         
                        /*CARACTERES MAJUSCULES + DECLARATION DE MINUS*/        
         
 /*================== VARIABLES =================================*/        
         
 DCL ERREUR       STATIC BIT(1)     INIT('0'B);        
         
 DCL CDRTPGM_W    STATIC CHAR (09)  INIT ('');        
         
 DCL (IND,I, J, K ,X, Y) FIXED BIN (31);        
         
 /**************************************************        
 * AUTRES DECLARATIONS                             *        
 **************************************************/        
         
 DCL INTER_C1            CHAR(1);        
 DCL INTER_P1            PIC'9'       DEF INTER_C1;        
 DCL INTER_C2            CHAR(2);        
 DCL INTER_P2            PIC'(2)9'    DEF INTER_C2;        
 DCL INTER_Z2            PIC'Z9';        
 DCL INTER_C3            CHAR(3);        
 DCL INTER_P3            PIC'(3)9'    DEF INTER_C3;        
 DCL INTER_Z3            PIC'ZZ9';        
 DCL INTER_F3            FIXED(03);        
 DCL INTER_C4            CHAR(4);        
 DCL INTER_P4            PIC'(4)9'    DEF INTER_C4;        
 DCL INTER_F4            FIXED(04);        
 DCL INTER_Z4            PIC'ZZZ9';        
 DCL INTER_C5            CHAR(5);        
 DCL INTER_P5            PIC'(5)9'    DEF INTER_C5;        
 DCL INTER_Z5            PIC'(4)Z9';        
 DCL INTER_F5            FIXED(05);        
 DCL INTER_C6            CHAR(6);        
 DCL INTER_P6            PIC'(6)9'    DEF INTER_C6;        
 DCL INTER_C7            CHAR(7);        
 DCL INTER_P7            PIC'(7)9'    DEF INTER_C7;        
 DCL INTER_Z7            PIC'ZZZZZZ9';        
 DCL INTER_F7            FIXED(07);        
 DCL INTER_C8            CHAR(8);        
 DCL INTER_P8            PIC'(8)9'    DEF INTER_C8;        
 DCL INTER_F8            FIXED(08);        
 DCL INTER_C9            CHAR(9);        
 DCL INTER_P9            PIC'(9)9'    DEF INTER_C9;        
 DCL INTER_F9            FIXED(09);        
 DCL INTER_P10           PIC'(10)9';        
 DCL INTER_C10           CHAR(10)     DEF INTER_P10;        
 DCL INTER_C11           CHAR(11);        
 DCL INTER_P11           PIC'(11)9'   DEF INTER_C11;        
 DCL INTER_F11           FIXED(11);        
 DCL INTER_F15           FIXED(15);        
 DCL W_LGEAF             PIC '9';        
 DCL W_CHAIN             CHAR(165)      VAR;        
 DCL W_CHAIN1            CHAR(50)       VAR;        
 DCL W_MTPLEIN           FIXED(15);        
 DCL W_MTPROMO           FIXED(15);        
 DCL W_MTBENEF           FIXED(15);        
 DCL W_MTTOTAL           FIXED(15);        
 DCL STAT_W              CHAR(08);        
 DCL CDRFPRT_W    STATIC CHAR (03)  INIT ('');        
         
 DCL LTPROPR_W           CHAR(30);        
 DCL LTACTIV_W           CHAR(30);        
         
 DCL IDENTAFF            CHAR(15);        
 DCL LIBELAFF            CHAR(20);        
 DCL LIBTXT              CHAR(40);        
         
 DCL 1 LTOBJOP_Z,        
      2  NOSQINT             CHAR(05), ######################################        
      2  NOSQSUJ             CHAR(05), ######################################        
      2  CDCNTVC             CHAR(03), ######################################        
      2  CDCAC               CHAR(15), ######################################        
      2  CDOPER              CHAR(03), ######################################        
      2  CDPRODU             CHAR(07), ######################################        
      2  CDTYPPR             CHAR(03), ######################################        
      2  CDLETTR             CHAR(03), ######################################        
      2  CDCANAL             CHAR(09), ######################################        
      2  CDTTAPP             CHAR(02), ######################################        
      2  NOSEQRB             CHAR(03), ######################################        
      2  CDSGGES             CHAR(01), ######################################        
      2  CDCOUGE             CHAR(04), ######################################        
      2  CDDEVIS             CHAR(11), ######################################        
      2  CDRSCTL             CHAR(01); ######################################        
 DCL 1  LTOBJOP_R   CHAR(STG(LTOBJOP_Z)) BASED(ADDR(LTOBJOP_Z));        
         
 /*================== CONSTANTES ================================*/        
 DCL LTALARM (4,2)       CHAR(15);        
 LTALARM(1,1) = 'Pas d''alarme';        
 LTALARM(1,2) = 'Geen alarm';        
 LTALARM(2,1) = 'VV1';        
 LTALARM(2,2) = 'VV1';        
 LTALARM(3,1) = 'VV2';        
 LTALARM(3,2) = 'VV2';        
 LTALARM(4,1) = 'd''origine';        
 LTALARM(4,2) = 'origineel';        
         
 /********************************************        
 * DECLARATION DES PCB                       *        
 ********************************************/        
 /*---------------------------------------------------------- PCBINIT */        
 /*------------------------------------------------------ END PCBINIT */        
 /*-------------------------------------------------------- FCTINIVA */        
    DCL  CEETDLI ENTRY OPTIONS (ASM);        
    DCL  PLITDLI ENTRY;        
    DCL  GN    CHAR(4)               VALUE ('GN  ');        
    DCL  GU    CHAR(4)               VALUE ('GU  ');        
    DCL  GHU   CHAR(4)               VALUE ('GHU ');        
    DCL  GNP   CHAR(4)               VALUE ('GNP ');        
    DCL  GHN   CHAR(4)               VALUE ('GHN ');        
    DCL  GHNP  CHAR(4)               VALUE ('GHNP');        
    DCL  GCV   CHAR(4)               VALUE ('GCV ');        
    DCL  ISRT  CHAR(4)               VALUE ('ISRT');        
    DCL  DLET  CHAR(4)               VALUE ('DLET');        
    DCL  REPL  CHAR(4)               VALUE ('REPL');        
    DCL  CHNG  CHAR(4)               VALUE ('CHNG');        
    DCL  LOG   CHAR(4)               VALUE ('LOG ');        
    DCL  STAT  CHAR(4)               VALUE ('STAT');        
    DCL  ROLL  CHAR(4)               VALUE ('ROLL');        
    DCL  ROLB  CHAR(4)               VALUE ('ROLB');        
    DCL  PURG  CHAR(4)               VALUE ('PURG');        
    DCL  CMD   CHAR(4)               VALUE ('CMD ');        
    DCL  GCMD  CHAR(4)               VALUE ('GCMD');        
    DCL  CHKP  CHAR(4)               VALUE ('CHKP');        
    DCL  XRST  CHAR(4)               VALUE ('XRST');        
    DCL  DEQ   CHAR(4)               VALUE ('DEQ ');        
    DCL  ONE   FIXED BIN (31)        VALUE (0001B);        
    DCL  TWO   FIXED BIN (31)        VALUE (0010B);        
    DCL  THREE FIXED BIN (31)        VALUE (0011B);        
    DCL  FOUR  FIXED BIN (31)        VALUE (0100B);        
    DCL  FIVE  FIXED BIN (31)        VALUE (0101B);        
    DCL  SIX   FIXED BIN (31)        VALUE (0110B);        
    DCL  SEVEN FIXED BIN (31)        VALUE (0111B);        
    DCL  EIGHT FIXED BIN (31)        VALUE (1000B);        
    DCL  NINE  FIXED BIN (31)        VALUE (1001B);        
 /*----------------------------------------------------- END FCTINIVA */        
 /*-------------------------------------------------------- TPPCBMSK */        
   DCL ALTPCB PTR;        
    DCL  1  ALT      BASED(ALTPCB),        
           2  LTERM                CHAR(8),        
           2  RESERVED             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  DATEIMS              FIXED(7),        
           2  TIMEIMS              FIXED(7,1),        
           2  SEQUENCE             BIN FIXED(31),        
           2  MODNAME              CHAR(8),        
           2  USERFIELD            CHAR(8);        
 /*---------------------------------------------------- END TPPCBMSK */        
 ALTPCB= GA2016J.ALTPCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DC105PCB             PTR;        
    DCL  LKEY_DC105 FIXED BINARY(31,0);        
         
    DCL  1  DC105           BASED(DC105PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DC105 REFER(DC105.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DC105PCB= GA2016J.DC105PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA215PCB             PTR;        
    DCL  LKEY_DA215 FIXED BINARY(31,0);        
         
    DCL  1  DA215           BASED(DA215PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA215 REFER(DA215.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DA215PCB= GA2016J.DA215PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA215$PCB             PTR;        
         
    DCL  LKEY_DA215$ FIXED BINARY(31,0);        
         
    DCL  1  DA215$           BASED(DA215$PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA215$ REFER(DA215$.KEYLEN)        
 );        
 /*---------------------------------------------------- END DBPCBMSK */        
 DA215$PCB= GA2016J.DA215$PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA2152PCB             PTR;        
         
    DCL  LKEY_DA2152 FIXED BINARY(31,0);        
         
    DCL  1  DA2152           BASED(DA2152PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA2152 REFER(DA2152.KEYLEN)        
 );        
 /*---------------------------------------------------- END DBPCBMSK */        
 DA2152PCB= GA2016J.DA2152PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA216PCB             PTR;        
    DCL  LKEY_DA216 FIXED BINARY(31,0);        
         
    DCL  1  DA216           BASED(DA216PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA216 REFER(DA216.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DA216PCB= GA2016J.DA216PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA223PCB             PTR;        
    DCL  LKEY_DA223 FIXED BINARY(31,0);        
         
    DCL  1  DA223           BASED(DA223PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA223 REFER(DA223.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DA223PCB= GA2016J.DA223PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DEU02PCB             PTR;        
    DCL  LKEY_DEU02 FIXED BINARY(31,0);        
         
    DCL  1  DEU02           BASED(DEU02PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DEU02 REFER(DEU02.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DEU02PCB= GA2016J.DEU02PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DXI10PCB             PTR;        
    DCL  LKEY_DXI10 FIXED BINARY(31,0);        
         
    DCL  1  DXI10           BASED(DXI10PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DXI10 REFER(DXI10.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DXI10PCB= GA2016J.DXI10PCB;        
         
 /* TDMTHO 20/02/2008 */        
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DSM80PCB             PTR;        
    DCL  LKEY_DSM80 FIXED BINARY(31,0);        
         
    DCL  1  DSM80           BASED(DSM80PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DSM80 REFER(DSM80.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DSM80PCB= GA2016J.DSM80PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DS146PCB             PTR;        
    DCL  LKEY_DS146 FIXED BINARY(31,0);        
         
    DCL  1  DS146           BASED(DS146PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DS146 REFER(DS146.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DS146PCB= GA2016J.DS146PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DSM88PCB             PTR;        
    DCL  LKEY_DSM88 FIXED BINARY(31,0);        
         
    DCL  1  DSM88           BASED(DSM88PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DSM88 REFER(DSM88.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DSM88PCB= GA2016J.DSM88PCB;        
         
 /* TDMTHO 10/09/2008 */        
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DSMB9PCB             PTR;        
    DCL  LKEY_DSMB9 FIXED BINARY(31,0);        
         
    DCL  1  DSMB9           BASED(DSMB9PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DSMB9 REFER(DSMB9.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DSMB9PCB= GA2016J.DSMB9PCB;        
         
 /********************************************        
 * GESTION DES ERREURS                       *        
 ********************************************/        
 DCL 1   MESS_TRACE  STATIC,                ################################################        
      2  LL_TR              BIN FIXED(15)   INIT(44),        
      2  ZZ_TR              BIN FIXED(15)   INIT(0),        
      2  TRACE              CHAR(40);        
 DCL 1   TB_TRACE(100) STATIC,        
      2  FLAG_TRACE         CHAR(01),        
      2  MSGE_TRACE         CHAR(40);        
 DCL     ITRACE             BIN FIXED (31)  STATIC;        
 DCL     ERR_MSG     STATIC CHAR(79);        
 DCL     PTRMSG             PTR;        
 DCL 1   ERR_DBA            BASED(PTRMSG),        
      2  FILL1              CHAR(12),        
      2  FILL2              CHAR(04),        
      2  DBD_DBA            CHAR(08),        
      2  FILL3              CHAR(08),        
      2  CALL_DBA           CHAR(10),        
      2  FILL4              CHAR(05),        
      2  KEY_DBA            CHAR(24),        
      2  FILL5              CHAR(05),        
      2  ST_DBA             CHAR(02),        
      2  FILL6              CHAR(01);        
 TB_TRACE(*)='';        
 ITRACE=0;        
 PTRMSG=ADDR(ERR_MSG);        
         
         
 /* VARIABLE PERMETTANT D'AFFICHER LA DATE ET L'HEURE DE COMPILATION */        
         
 /* VARIABLE MAX CHECK POINT : NBR MAX. DE LOTS AUTORISE AVANT CHKPT */        
 /*------------------------------------------------------------ DEBUG */        
 PT: PROC;        
 /******************************/        
 /*       MEMO TRACE           */        
 /******************************/        
 JWB001.TBTRACE_I = JWB001.TBTRACE_I+1;        
 IF JWB001.TBTRACE_I > 100        
    THEN DO;        
         JWB001.TBTRACE_I = 1;        
         JWB001.FLAG_TRACE(*) = '';        
         END;        
 JWB001.FLAG_TRACE(JWB001.TBTRACE_I) = '*';        
 JWB001.MSGE_TRACE(JWB001.TBTRACE_I) = TRACE;        
                               IF JWB001.CDTRACE > 0 THEN        
      PUT SKIP EDIT(TRACE)(A);        
 $END PT;        
         
 DEBUG: PROC;        
 /**************************************/        
 /*       PRINTING   TRACE             */        
 /**************************************/        
 DCL KT BIN FIXED(31);        
 PUT FILE(SYSPRINT) EDIT('- PROGRAM TRACE: -')        
                        (SKIP(3),A)        
                        ('------------------')        
                        (SKIP,A);        
 DO KT=1 TO 100;        
    IF JWB001.MSGE_TRACE(KT)^=''        
       THEN PUT FILE(SYSPRINT)        
            EDIT(JWB001.FLAG_TRACE(KT),        
                 JWB001.MSGE_TRACE(KT))        
                                   (SKIP,A,A);        
 END;        
 PUT FILE(SYSPRINT) EDIT('------------------')        
                        (SKIP,A);        
 $END DEBUG;        
 /*-------------------------------------------------------- END DEBUG */        
 /*-------------------------------------------------------------------*/        
 ERR_DL1:PROC REORDER;        
 /********************************************************************/        
 /*                                                                  */        
 /*                PROCEDURE DL1 : ERREUR DATA BASE                  */        
 /*                                                                  */        
 /********************************************************************/        
 JWB001.CDRTPGM = 'ERR_DL1';        
 PUT PAGE EDIT('A2016C',  ' - VERSION DU : * 18.AUG.10 16.17.32 * - ',        
         
               'LAST SV CALL = ',JWB001.LSTCALL,        
               'LAST DB CALL = ',JWB001.LSTSERV)        
              (SKIP,A, A,(2) (SKIP,A,A));        
         
         
 CALL DEBUG;        
         
 $END ERR_DL1;        
 /*-------------------------------------------------------------------*/        
                        /* ERREUR DE DATA BASE - 'ERR_DL1' + JWB001  */        
 ON ERROR SNAP        
    BEGIN ;        
          ON ERROR SYSTEM;        
          PUT PAGE EDIT('A2016C', ' - VERSION DU : * 18.AUG.10 16.17.32        
 * - ',        
          ' ON ERROR CONDITION',        
          'ONCODE    = ',ONCODE,        
          'ONLOC     = ',ONLOC,        
          'ONSOURCE  = ',ONSOURCE)        
          (SKIP,A,A,        
           SKIP,A,        
           SKIP,A,F(5),        
           SKIP,A,A(10),        
           SKIP,A,A);        
         
           PUT SKIP EDIT('LAST SERV CALL = ',JWB001.LSTCALL,        
                         'LAST DB2  CALL = ',JWB001.LSTSERV)        
              (SKIP,A,A);        
         
         
          CALL DEBUG;        
          SIGNAL ERROR;        
    END;        
 /*-------------------------------------------------------------------*/        
      /* ERREUR PLI - SANS IOPCB, AVEC JWB001      */        
 /*********************************************************************/        
 /* TDMXXX !   DATE   ! DESCRIPTION DE LA MODIF                       */        
 /* ------ ! -------- ! ----------------------------------------------*/        
 /* TDMOHL ! 22042002 ! AJOUT INCLUDE PCBINIVA,FCTINIVA               */        
 /* TDMOHL ! 28042003 ! CHANGE INCLUDE FCTINIVA -> FCTINIVA           */        
 /* TDMOHL ! 15112004 ! AJOUT DECLARATION XEU100                      */        
 /*********************************************************************/        
 ERRORMSG: PROC(ERRORNUMBER,LANGAGECODE,ERRORMESSAGE) REORDER;        
 /***********************************/        
 /* RECHERCHE D'UN MESSAGE D'ERREUR */        
 /***********************************/        
         
 DCL ERRORNUMBER    CHAR(*),        
     LANGAGECODE    PIC '9',        
     ERRORMESSAGE   CHAR(*);        
         
 DCL XEU100 ENTRY OPTIONS(FETCHABLE);        
         
 /*---------------------------------------------------------- PCBINIT */        
 /*------------------------------------------------------ END PCBINIT */        
 /*-------------------------------------------------------- FCTINIVA */        
    DCL  CEETDLI ENTRY OPTIONS (ASM);        
    DCL  PLITDLI ENTRY;        
    DCL  GN    CHAR(4)               VALUE ('GN  ');        
    DCL  GU    CHAR(4)               VALUE ('GU  ');        
    DCL  GHU   CHAR(4)               VALUE ('GHU ');        
    DCL  GNP   CHAR(4)               VALUE ('GNP ');        
    DCL  GHN   CHAR(4)               VALUE ('GHN ');        
    DCL  GHNP  CHAR(4)               VALUE ('GHNP');        
    DCL  GCV   CHAR(4)               VALUE ('GCV ');        
    DCL  ISRT  CHAR(4)               VALUE ('ISRT');        
    DCL  DLET  CHAR(4)               VALUE ('DLET');        
    DCL  REPL  CHAR(4)               VALUE ('REPL');        
    DCL  CHNG  CHAR(4)               VALUE ('CHNG');        
    DCL  LOG   CHAR(4)               VALUE ('LOG ');        
    DCL  STAT  CHAR(4)               VALUE ('STAT');        
    DCL  ROLL  CHAR(4)               VALUE ('ROLL');        
    DCL  ROLB  CHAR(4)               VALUE ('ROLB');        
    DCL  PURG  CHAR(4)               VALUE ('PURG');        
    DCL  CMD   CHAR(4)               VALUE ('CMD ');        
    DCL  GCMD  CHAR(4)               VALUE ('GCMD');        
    DCL  CHKP  CHAR(4)               VALUE ('CHKP');        
    DCL  XRST  CHAR(4)               VALUE ('XRST');        
    DCL  DEQ   CHAR(4)               VALUE ('DEQ ');        
    DCL  ONE   FIXED BIN (31)        VALUE (0001B);        
    DCL  TWO   FIXED BIN (31)        VALUE (0010B);        
    DCL  THREE FIXED BIN (31)        VALUE (0011B);        
    DCL  FOUR  FIXED BIN (31)        VALUE (0100B);        
    DCL  FIVE  FIXED BIN (31)        VALUE (0101B);        
    DCL  SIX   FIXED BIN (31)        VALUE (0110B);        
    DCL  SEVEN FIXED BIN (31)        VALUE (0111B);        
    DCL  EIGHT FIXED BIN (31)        VALUE (1000B);        
    DCL  NINE  FIXED BIN (31)        VALUE (1001B);        
 /*----------------------------------------------------- END FCTINIVA */        
         
 /*******************************************/        
 /* DB DES TABLES                           */        
 /*******************************************/        
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DBTABPCB             PTR;        
    DCL  LKEY_TAB FIXED BINARY(31,0);        
         
    DCL  1  TAB           BASED(DBTABPCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_TAB REFER(TAB.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DBTABPCB = JWB001.DBTABLE.DBTABPCB;        
         
 /******************/        
 /* SEGMENT TABLE  */        
 /******************/        
 /* NRB - TDMOHL - GENERATION LE 22/05/2007 - 14:28        LGTH=00274 */        
 /*****************************************************/        
 /*  TABLE MAIN :                                     */        
 /*****************************************************/        
         
 DCL  1 TBGI_MAIN ,                         #############################################################        
                                            /*TB!  !DPH01   !PHTABLE  */        
                                            /*TB!  !DRH01   !RHTABLE  */        
                                            /*TB!  !DND01   !NDTAB    */        
                                            /*TB!  !DSM25   !C1TAB    */        
                                            /*TB!  !DDO03   !C1TAB    */        
                                            /*TB!  !DIB15   !C1TAB    */        
                                            /*TB!  !DCR01   !CRTABLE  */        
                                            /*TB!  !DLG01   !TABLE    */        
                                            /*TB!  !DCT01   !CTTABLE  */        
                                            /*TB!  !DC201   !C2TABLE  */        
                                            /*TB!  !DCI02   !CITAB    */        
                                            /*TB!  !DSMC0   !C1TAB    */        
                                            /*TB!  !DAV01   !AVTABLE  */        
                                            /*TB!  !DCD01   !CDTAB    */        
                                            /*TB!  !DCL01   !CLTABLE  */        
                                            /*TB!  !DCP11   !CPTAB    */        
                                            /*TB!  !DCO39   !COTAB    */        
                                            /*TB!  !DC101   !C1TAB    */        
                                            /*TB!  !DC102   !C1TAB    */        
                                            /*TB!  !DC103   !C1TAB    */        
                                            /*TB!  !DC301   !C3TABLE  */        
                                            /*TB!  !DDP01   !DPTAB    */        
                                            /*TB!  !DGA01   !GATABLE  */        
                                            /*TB!  !DGI01   !GITABLE  */        
                                            /*TB!  !DGZ02   !GZTABLE  */        
                                            /*TB!  !DLP03   !LPTABLE  */        
                                            /*TB!  !DNC02   !NCTABLE  */        
                                            /*TB!  !DPS01   !PSTABLE  */        
                                            /*TB!  !DP101   !P1TABLE  */        
                                            /*TB!  !DRD01   !RDTABLE  */        
                                            /*TB!  !DSP01   !SPTABLE  */        
                                            /*TB!  !DSW02   !SWTAB    */        
                                            /*TB!  !DXI01   !XITABLE  */        
                                            /*TB!  !DFP24   !FPTABLE  */        
       2 TBTXCOD  CHAR(4),                  ######################################################        
       2 TBTXA01  CHAR(20),                 #####################################################        
       2 TBTXL01  CHAR(250);                ####################################################        
         
         
    DCL 1 SSA_C1TAB,        
         2 FIL1         CHAR (8)       INIT ('C1TAB  '),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KC1TAB  '),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (24),        
         2 FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMVAN - Generation le 11/04/2000 - 09:20        Lgth=00274 */        
 /******************************************        
 *  SEGMENT TABLE                          *        
 *  MESSAGES D'ERREUR                      *        
 ******************************************/        
         
 DCL  1 TBGI_T004 ,                    #############################################################        
 /*K*/ 2 TBTXCOD  CHAR(4),             /*CD!  !CODE TABLE             */        
 /*K*/ 2 TBTXA01  CHAR(20),            /*CD!  !ARGUMENT DE LA TABLE   */        
       2 LTMEERR(3)  CHAR(66),         ##################################################        
       2 $FILLER$ CHAR(052);           ####################################################        
 /* NRB - TDMOHL - GENERATION LE 17/10/2006 - 09:33        LGTH=00274 */        
 /*-------------------------------------------------------------------*/        
 /*-- DICTIONNAIRE DES MESSAGES D'ERREUR                              */        
 /*-------------------------------------------------------------------*/        
 DCL  1 TBGI_W004 ,                  #############################################################        
                                     /*TB!  !DSM25   !C1TAB           */        
                                     /*TB!  !DCR01   !CRTABLE         */        
                                     /*TB!  !DPH01   !PHTABLE         */        
                                     /*TB!  !DDO03   !C1TAB           */        
                                     /*TB!  !DLG01   !TABLE           */        
                                     /*TB!  !DND01   !NDTAB           */        
                                     /*TB!  !DRH01   !RHTABLE         */        
                                     /*TB!  !DC201   !C2TABLE         */        
                                     /*TB!  !AEDBTAB1!TABLE           */        
                                     /*TB!  !DGZ02   !GZTABLE         */        
                                     /*TB!  !DC301   !C3TABLE         */        
                                     /*--!  !L'06 ERRORNUMBER         */        
 /*K*/ 2 TBTXCOD  CHAR(4),           /*CD!  !CODE TABLE               */        
 /*K*/ 2 TBTXA01  CHAR(20),          /*CD!  !CODE MSG = KKPPPNNNIL    */        
                                     /*--!  !KK  = PROJET             */        
                                     /*--!  !PPP = NO PROGRAMME       */        
                                     /*--!  !NNN = NO MESSAGE         */        
                                     /*--!  !I   = NO SCENARIO        */        
                                     /*--!  !L   = LANGUE (F/N/A/E)   */        
       2 LTMEERR  CHAR(79),          #####################################################        
       2 FILLER  CHAR(170),          #####################################################        
       2 CDEGARG  CHAR(1);           ######################################################        
         
 /*******************************************/        
 /* AUTRES DECLARATIONS                     */        
 /*******************************************/        
 DCL CLAUSE        CHAR(7);        
 DCL METAPCB_W     PTR;        
 DCL CDDFSEG_W     CHAR (8);        
 DCL CDTABLE_W     CHAR (4);        
 DCL CDLGTRN_W     PIC '9';        
 DCL (I,J,L,M,K)   FIXED BIN(31);        
         
 /* SAUVER L'ENVIRONNEMENT */        
         
 METAPCB_W = IEU001.METAPCB;        
 CDDFSEG_W = IEU001.CDDFSEG;        
 CDLGTRN_W = LANGAGECODE;        
         
 IEU001.METAPCB = JWB001.DBTABLE.METAPCB;        
 SSA_C1TAB.FIL1 = JWB001.DBTABLE.LTSGTAB;        
 SSA_C1TAB.FIL3 = 'K' !! SUBSTR(JWB001.DBTABLE.LTSGTAB,1,7);        
 IEU001.CDDFSEG = JWB001.DBTABLE.CDDFTAB;        
         
 ERRORMESSAGE = '';        
 IF ERRORNUMBER = '' THEN        
      ERRORNUMBER = 'UNSPECI';        
         
 DO WHILE (ERRORMESSAGE = '');        
 CDTABLE_W = SUBSTR(JWB001.DBTABLE.CDDFTAB,4,4);        
 IF CDTABLE_W = 'W004' THEN        
      DO;        
      SSA_C1TAB.VALUE = 'W004' !! SUBSTR(ERRORNUMBER,1,9)        
                               !! TRANSLATE(CDLGTRN_W,'FNAE','1234');        
      CALL XEU100(IEU001,FOUR,GU,TAB,TBGI_W004,SSA_C1TAB);        
      END;        
 ELSE DO;        
      SSA_C1TAB.VALUE = CDTABLE_W !! ERRORNUMBER;        
      CALL XEU100(IEU001,FOUR,GU,TAB,TBGI_T004,SSA_C1TAB);        
      END;        
         
 SELECT (IEU001.CDRTPGM);        
   WHEN('  ')        
     IF CDTABLE_W = 'W004' THEN        
          DO;        
          ERRORMESSAGE = TBGI_W004.LTMEERR;        
          IF ERRORMESSAGE = '' THEN        
               ERRORMESSAGE = ERRORNUMBER;        
          END;        
     ELSE DO;        
          IF CDLGTRN_W < 1 ! CDLGTRN_W > 3 THEN        
               ERRORMESSAGE = TBGI_T004.LTMEERR(1);        
          ELSE IF TBGI_T004.LTMEERR(CDLGTRN_W) = '' THEN        
                    ERRORMESSAGE = TBGI_T004.LTMEERR(1);        
               ELSE ERRORMESSAGE = TBGI_T004.LTMEERR(CDLGTRN_W);        
          IF ERRORMESSAGE = '' THEN        
               ERRORMESSAGE = ERRORNUMBER;        
          END;        
   WHEN ('DBAPGE')        
             DO;        
             IF CDTABLE_W = 'W004' THEN        
                  DO;        
                  IF CDLGTRN_W = 1 THEN        
                       ERRORMESSAGE = ERRORNUMBER;        
                  ELSE CDLGTRN_W = 1;        
                  END;        
             ELSE ERRORMESSAGE = ERRORNUMBER;        
             IEU001.CDRTPGM = ' ';        
             END;        
   OTHERWISE DO;        
             CALL ERR_DL1;        
             RETURN;        
             END;        
   END;        
 END;        
         
 /* RETABLIR L'ENVIRONNEMMENT */        
         
 IEU001.METAPCB = METAPCB_W;        
 IEU001.CDDFSEG = CDDFSEG_W;        
         
 L=LENGTH(ERRORMESSAGE);        
 M=L;        
 K=INDEX(ERRORMESSAGE,'#');        
 IF K^=0 & SUBSTR(ERRORMESSAGE,K+7)=''  THEN        
      DO;        
      CLAUSE=SUBSTR(ERRORMESSAGE,K,7);        
      J=INDEX(CLAUSE,' ');        
      IF J=0 & VERIFY(SUBSTR(ERRORMESSAGE,K+8,L-(K+8)),' ')=0 THEN        
           DO;        
           SPA.TBFCACT(2)='1'B;        
           SPA.LTOPCOM=SUBSTR(CLAUSE,2,2)!!'#' !!SUBSTR(CLAUSE,4);        
           SUBSTR(ERRORMESSAGE,K)='';        
           DO J=L TO 1 BY -1        
              WHILE(SUBSTR(ERRORMESSAGE,J,1)=' ');        
           END;        
           IF JWB001.CDEVCLI = '3' THEN        
                SUBSTR(ERRORMESSAGE,J+1)=' (F2:...)'!!HEX3F;        
           ELSE SUBSTR(ERRORMESSAGE,J+1)=' (F2:...)';        
           END;        
      END;        
 ELSE IF JWB001.CDEVCLI = '3' THEN        
           DO;        
           DO I=L BY -1 TO 1 WHILE(SUBSTR(ERRORMESSAGE,I,1) = ' ');        
              M=M-1;                                                            
           END;                                                                 
           SELECT(M);                                                           
             WHEN(0)ERRORMESSAGE=HEX403F;                                       
             WHEN(L);                                                           
             OTHER SUBSTR(ERRORMESSAGE,M+1)=HEX3F;                              
           END;                                                                 
           END;        
 $END ERRORMSG;        
                        /* RECHERCHE MESSAGE D'ERREUR DANS DB TABLES */        
         
 /*-----------------------------------------------*/        
         
 /*******************************        
 *     RACINE DU SCENARIO       *        
 *******************************/        
         
 IF SPA.CDPGTRN ='5' THEN        
  DO;        
   MINUS = MINUS500;        
  END;        
 ELSE        
  DO;        
   MINUS = MINUS274;        
  END;        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
       PUT SKIP EDIT('SPA.MSG_SPA:',SPA.MSG_SPA)(A);        
       PUT SKIP EDIT('SCENARI.NOPGACT:',SCENARI.NOPGACT)(A);        
       PUT SKIP EDIT('MIDC.CDOPTRN:',MIDC.CDOPTRN)(A);        
       PUT SKIP EDIT('SPA.CDOPTRN:',SPA.CDOPTRN)(A);        
       PUT SKIP EDIT('SPAVAR.CDTYPOP:',SPAVAR.CDTYPOP)(A);        
   END;        
         
 IF JWB001.CDTRACE=9        
 THEN DO;        
   PUT SKIP EDIT('--------------------------')(A);        
   PUT SKIP EDIT('!RACINE/CDRTPGM:'!!JWB001.CDRTPGM,'!')(A);        
   PUT SKIP EDIT('!RACINE/BOACCES:',SCENARI.TBSCENA(2),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOVALID:',SCENARI.TBSCENA(4),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOUPDTE:',SCENARI.TBSCENA(7),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOSUITE:',SCENARI.TBSCENA(8),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOSWTCH:',SCENARI.TBSCENA(9),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOSCROL:',SCENARI.TBSCENA(5),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOERRAC:',SCENARI.TBSCENA(3),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOREPOS:',SCENARI.TBSCENA(6),'        !')(A);        
         
   PUT SKIP EDIT('--------------------------')(A);        
 END;        
         
 SELECT(JWB001.LTNMMTH);        
    WHEN('SCENA_INIT')   CALL F1;        
    WHEN('CTX_GET')      CALL F2;        
    WHEN('CTX_SAVE')     CALL F3;        
    WHEN('CTRL_ACCES')   CALL F4;        
    WHEN('PAGE_DFT')     CALL F5;        
    WHEN('PAGE_INIT')    CALL F6;        
    WHEN('PAGE_SCROLL')  CALL F7;        
    WHEN('PAGE_XML')     CALL F8;        
    WHEN('PAGEC_XML')    CALL F9;        
    WHEN('VALID_SYN')    CALL FA;        
    WHEN('VALID_CTX')    CALL FB;        
    WHEN('UPDATE_DB')    CALL FC;        
    WHEN('SWITCH_SC')    CALL FD;        
    WHEN('TEST_SCROLL')  CALL FE;        
    WHEN('CTX_CLEAR')    CALL FF;        
    WHEN('TEST_PF1 ')    CALL FG;        
    WHEN('TEST_BOUTON')  CALL FH;        
    OTHER        
       DO;        
       JWB001.CDRTPGM = 'A2016C' !! '01';        
       IF JWB001.CDTRACE >= 3 THEN        
         DO;        
           PUT SKIP LIST( '!!! NOM DE METHODE NON REPERTORIE !!!');        
           PUT SKIP LIST('CONTENU DE L''INTERFACE GA2016C:');        
           PUT SKIP EDIT('METHODE =',JWB001.LTNMMTH) (A,A);        
         END;        
       END;        
 END;        
         
 IF JWB001.CDTRACE=9        
 THEN DO;        
   PUT SKIP EDIT('------------------------------')(A);        
   PUT SKIP EDIT('!END RACINE/CDRTPGM:'!!JWB001.CDRTPGM,'!')(A);        
   PUT SKIP EDIT('!END RACINE/BOACCES:',SCENARI.TBSCENA(2),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOVALID:',SCENARI.TBSCENA(4),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOUPDTE:',SCENARI.TBSCENA(7),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOSUITE:',SCENARI.TBSCENA(8),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOSWTCH:',SCENARI.TBSCENA(9),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOSCROL:',SCENARI.TBSCENA(5),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOERRAC:',SCENARI.TBSCENA(3),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOREPOS:',SCENARI.TBSCENA(6),'        !')(        
 A);        
   PUT SKIP EDIT('------------------------------')(A);        
 END;        
 /*-----------------------------------------------*/        
         
 F1: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F1';        
         
     CALL PT;        
 /**********************************************        
 * VERIFIER L'EXISTENCE DU SCENARIO            *        
 * CHARGER LA ZONE DE COMMUNICATION 'WKSCENA'  *        
 **********************************************/        
 SCENARI.NUMIDLL(LEVEL) = STG(MIDC);    ########################################        
         
 SCENARI.TBSCENA(2) = ON;        
         
 SCENARI.TBSCENA(4) = ON;        
         
 SCENARI.TBSCENA(7) = OFF;        
         
 SCENARI.TBSCENA(8) = OFF;        
         
 SCENARI.TBSCENA(9) = OFF;        
         
 SCENARI.TBSCENA(5) = OFF;        
         
 SCENARI.TBSCENA(3) = OFF;        
         
 SCENARI.TBSCENA(6) = OFF;        
         
 SCENARI.TBSCENA(1) = ON;        
         
 SCENARI.TBSCENA(11) = OFF;        
         
 SELECT(MIDC.CDLGTRN);        
   WHEN('1','F') SPA.CDLGTRN = 1;        
   WHEN('2','N') SPA.CDLGTRN = 2;        
   OTHER;        
 END;        
         
 CALL $DATES_TIMES;        
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
 PUT SKIP LIST('Scenario_1.ANNCSTR=',SCENARIO_1.ANNCSTR);        
 PUT SKIP LIST('Scenario_1.NOIDMAR=',SCENARIO_1.NOIDMAR);        
 PUT SKIP LIST('Scenario_1.NOIDMOD=',SCENARIO_1.NOIDMOD);        
 PUT SKIP LIST('Scenario_1.NOIDTYP=',SCENARIO_1.NOIDTYP);        
 PUT SKIP LIST('Scenario_1.LTMARQU=',SCENARIO_1.LTMARQU);        
 PUT SKIP LIST('Scenario_1.LTMODEL=',SCENARIO_1.LTMODEL);        
 PUT SKIP LIST('Scenario_1.LTTYPEV=',SCENARIO_1.LTTYPEV);        
 PUT SKIP LIST('SCENARIO_1.NBRTRAN=',SCENARIO_1.NBRTRAN);        
 PUT SKIP LIST('SCENARIO_1.NBTYPKW=',SCENARIO_1.NBTYPKW);        
 PUT SKIP LIST('SCENARIO_1.PRIHTVA=',SCENARIO_1.PRIHTVA);        
 PUT SKIP LIST('SCENARIO_1.NBRPORT=',SCENARIO_1.NBRPORT);        
 PUT SKIP LIST('SCENARIO_1.TYPCYLI=',SCENARIO_1.TYPCYLI);        
 PUT SKIP LIST('SCENARIO_1.NBCVDIN=',SCENARIO_1.NBCVDIN);        
 PUT SKIP LIST('SCENARIO_1.LTBOITE=',SCENARIO_1.LTBOITE);        
 PUT SKIP LIST('SCENARIO_1.NBVITES=',SCENARIO_1.NBVITES);        
 PUT SKIP LIST('SCENARIO_1.CDSPORT=',SCENARIO_1.CDSPORT);        
 PUT SKIP LIST('SCENARIO_1.POIDVID=',SCENARIO_1.POIDVID);        
 PUT SKIP LIST('Scenario_5.DANAIPR=',SCENARIO_5.DANAIPR);        
 PUT SKIP LIST('Scenario_5.CDPOPRE=',SCENARIO_5.CDPOPRE);        
 PUT SKIP LIST('Scenario_5.VACATVH=',SCENARIO_5.VACATVH);        
 PUT SKIP LIST('Scenario_5.CDJEUNE=',SCENARIO_5.CDJEUNE);        
 PUT SKIP LIST('Scenario_5.CDUSAVH=',SCENARIO_5.CDUSAVH);        
 PUT SKIP LIST('Scenario_5.CDCDC26=',SCENARIO_5.CDCDC26);        
 PUT SKIP LIST('Scenario_5.CDASTMC=',SCENARIO_5.CDASTMC);        
 PUT SKIP LIST('Scenario_5.CDPOSRM=',SCENARIO_5.CDPOSRM);        
 PUT SKIP LIST('Scenario_5.BOHOREC=',SCENARIO_5.BOHOREC);        
 PUT SKIP LIST('Scenario_5.BOVHOCC=',SCENARIO_5.BOVHOCC);        
 PUT SKIP LIST('Scenario_5.NBSINIS=',SCENARIO_5.NBSINIS);        
 PUT SKIP LIST('Scenario_5.BOAUTCP=',SCENARIO_5.BOAUTCP);        
 PUT SKIP LIST('Scenario_5.CDTYPRO=',SCENARIO_5.CDTYPRO);        
 PUT SKIP LIST('Scenario_5.CDGEPRO=',SCENARIO_5.CDGEPRO);        
 PUT SKIP LIST('Scenario_5.NBKMPAN=',SCENARIO_5.NBKMPAN);        
 PUT SKIP LIST('Scenario_5.AGEPREN=',SCENARIO_5.AGEPREN);        
 PUT SKIP LIST('Scenario_5.CDJEUNE=',SCENARIO_5.CDJEUNE);        
 PUT SKIP LIST('Scenario_6.CDPROMO=',SCENARIO_6.CDPROMO);        
 PUT SKIP LIST('Scenario_6.CDPADIV=',SCENARIO_6.CDPADIV);        
 PUT SKIP LIST('Scenario_6.CDBMDET=',SCENARIO_6.CDBMDET);        
 PUT SKIP LIST('Scenario_6.CDCIBCL=',SCENARIO_6.CDCIBCL);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGARCI=',        
                SCENARIO_6.RESULTAT_AUTO.MTGARCI);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGACAS=',        
                SCENARIO_6.RESULTAT_AUTO.MTGACAS);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGACA1=',        
                SCENARIO_6.RESULTAT_AUTO.MTGACA1);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGAASS=',        
                SCENARIO_6.RESULTAT_AUTO.MTGAASS);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGAOM1=',        
                SCENARIO_6.RESULTAT_AUTO.MTGAOM1);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGAOM2=',        
                SCENARIO_6.RESULTAT_AUTO.MTGAOM2);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGAOM3=',        
                SCENARIO_6.RESULTAT_AUTO.MTGAOM3);        
 PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.MTGAOM4=',        
                SCENARIO_6.RESULTAT_AUTO.MTGAOM4);        
 DO I = 1 TO 20;        
   PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.TBPRIME(I).CDTYGAR=',        
                  SCENARIO_6.RESULTAT_AUTO.TBPRIME(I).CDTYGAR);        
   PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.TBPRIME(I).CDTFGAR=',        
                  SCENARIO_6.RESULTAT_AUTO.TBPRIME(I).CDTFGAR);        
   PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.TBPRIME(I).NUVSTRF=',        
                  SCENARIO_6.RESULTAT_AUTO.TBPRIME(I).NUVSTRF);        
   PUT SKIP LIST('Scenario_6.RESULTAT_AUTO.TBPRIME(I).MTPBMRD=',        
                  SCENARIO_6.RESULTAT_AUTO.TBPRIME(I).MTPBMRD);        
 END;        
 PUT SKIP LIST('Scenario_6.RESULTAT_REM.MTRMRCI=',        
                SCENARIO_6.RESULTAT_REM.MTRMRCI);        
 PUT SKIP LIST('Scenario_6.RESULTAT_REM.MTRMVO1=',        
                SCENARIO_6.RESULTAT_REM.MTRMVO1);        
 PUT SKIP LIST('SCENARIO_6.RESULTAT_REM.MTRMIN1=',        
                SCENARIO_6.RESULTAT_REM.MTRMIN1);        
 PUT SKIP LIST('SCENARIO_6.RESULTAT_REM.MTRMBRI=',        
                SCENARIO_6.RESULTAT_REM.MTRMBRI);        
 PUT SKIP LIST('SCENARIO_6.RESULTAT_REM.MTRMDM3=',        
                SCENARIO_6.RESULTAT_REM.MTRMDM3);        
 PUT SKIP LIST('SCENARIO_6.RESULTAT_REM.MTRMDM4=',        
                SCENARIO_6.RESULTAT_REM.MTRMDM4);        
 DO I = 1 TO 10;        
   PUT SKIP LIST('Scenario_6.RESULTAT_REM.TBPRIME(I).CDTYGAR=',        
                  SCENARIO_6.RESULTAT_REM.TBPRIME(I).CDTYGAR);        
   PUT SKIP LIST('Scenario_6.RESULTAT_REM.TBPRIME(I).CDTFGAR=',        
                  SCENARIO_6.RESULTAT_REM.TBPRIME(I).CDTFGAR);        
   PUT SKIP LIST('Scenario_6.RESULTAT_REM.TBPRIME(I).NUVSTRF=',        
                  SCENARIO_6.RESULTAT_REM.TBPRIME(I).NUVSTRF);        
   PUT SKIP LIST('Scenario_6.RESULTAT_REM.TBPRIME(I).MTPBMRD=',        
                  SCENARIO_6.RESULTAT_REM.TBPRIME(I).MTPBMRD);        
 END;        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDSERCI=',        
                SCENARIO_6.SELECT_GAR.CDSERCI);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDSECAS=',        
                SCENARIO_6.SELECT_GAR.CDSECAS);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDSECA1=',        
                SCENARIO_6.SELECT_GAR.CDSECA1);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDSEASS=',        
                SCENARIO_6.SELECT_GAR.CDSEASS);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDSEMOB=',        
                SCENARIO_6.SELECT_GAR.CDSEMOB);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDSEMO1=',        
                SCENARIO_6.SELECT_GAR.CDSEMO1);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDTYPOM=',        
                SCENARIO_6.SELECT_GAR.CDTYPOM);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDNIVFR=',        
                SCENARIO_6.SELECT_GAR.CDNIVFR);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDRMRCI=',        
                SCENARIO_6.SELECT_GAR.CDRMRCI);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDRMVO1=',        
                SCENARIO_6.SELECT_GAR.CDRMVO1);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDRMIN1=',        
                SCENARIO_6.SELECT_GAR.CDRMIN1);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDRMBRI=',        
                SCENARIO_6.SELECT_GAR.CDRMBRI);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDRMDM3=',        
                SCENARIO_6.SELECT_GAR.CDRMDM3);        
 PUT SKIP LIST('SCENARIO_6.SELECT_GAR.CDRMDM4=',        
                SCENARIO_6.SELECT_GAR.CDRMDM4);        
 PUT SKIP LIST('SCENARIO_7.LTMARRM = ',SCENARIO_7.LTMARRM);        
 PUT SKIP LIST('SCENARIO_7.ANCSTRM = ',SCENARIO_7.ANCSTRM);        
 PUT SKIP LIST('SCENARIO_7.MTCATRM = ',SCENARIO_7.MTCATRM);        
 PUT SKIP LIST('SCENARIO_7.MTACTRM = ',SCENARIO_7.MTACTRM);        
 PUT SKIP LIST('SCENARIO_7.NUPDSRM = ',SCENARIO_7.NUPDSRM);        
 PUT SKIP LIST('SCENARIO_8.NBSINDM',SCENARIO_8.NBSINDM);        
 PUT SKIP LIST('SCENARIO_8.CDJEUFA',SCENARIO_8.CDJEUFA);        
 PUT SKIP LIST('SCENARIO_8.CDTY2PO',SCENARIO_8.CDTY2PO);        
 PUT SKIP LIST('SCENARIO_8.CDSTACO',SCENARIO_8.CDSTACO);        
 PUT SKIP LIST('SCENARIO_8.CDENFCH',SCENARIO_8.CDENFCH);        
 PUT SKIP LIST('SCENARIO_8.CDSTART',SCENARIO_8.CDSTART);        
   END;        
     TRACE = 'GA2016C ===> ' !! 'END F1';        
         
     CALL PT;        
 $END F1;        
 /*-----------------------------------------------*/        
 F2: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F2';        
         
     CALL PT;        
 /***************************************************/        
 /* RECHARGER LA RUBRIQUE COLLECTEE PAR LA GUIDANCE */        
 /***************************************************/        
         
     TRACE = 'GA2016C ===> ' !! 'END F2';        
         
     CALL PT;        
 $END F2;        
 /*-----------------------------------------------*/        
 F3: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F3';        
         
     CALL PT;        
 /********************************************        
 * INVOQUER LA GUIDANCE                      *        
 ********************************************/        
         
     TRACE = 'GA2016C ===> ' !! 'END F3';        
         
     CALL PT;        
 $END F3;        
 /*-----------------------------------------------*/        
 F4: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F4';        
         
     CALL PT;        
 /********************************************        
 * CONTROLE D'ACCES AUX RESSOURCES           *        
 ********************************************/        
 SCENARI.TBSCENA(2) = OFF;        
         
         
     TRACE = 'GA2016C ===> ' !! 'END F4';        
         
     CALL PT;        
 $END F4;        
 /*-----------------------------------------------*/        
 F5: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F5';        
         
     CALL PT;        
 /********************************************        
 * PAGEC : VALEURS PAR DEFAUT                *        
 ********************************************/        
 IF JWB001.RETOUR !        
    (JWB001.CDEVCLI ^='3' &  SPA.MSG_SPA = '1')  THEN        
      DO;        
      CALL F6_2;        
      PAGEC = MIDC, BY NAME;        
      END;        
 ELSE DO;        
      SUBSTR(PAGECTXT,09,STG(PAGEC) - 8) = ' ';        
      END;        
         
 PAGEC.LL        = STG(PAGEC);        
 PAGEC.LTSCTRN_A = LOW(2) !! SPA.CDATTRN !! LOW(4);        
         
     TRACE = 'GA2016C ===> ' !! 'END F5';        
         
     CALL PT;        
 $END F5;        
 /*-----------------------------------------------*/        
         
 F6: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F6';        
         
     CALL PT;        
 /********************************        
 * PAGEC : CHARGEMENT PAGEC      *        
 ********************************/        
 /* PUT SKIP LIST('INFOS_USER.CDAFGRP = ',INFOS_USER.CDAFGRP); */        
 CDRTPGM_W = '';        
 ERREUR    = OFF;        
         
 CALL F6_2; #############################        
         
         
 IF ERREUR        
   THEN DO;        
          CALL ERRORMSG(CDRTPGM_W,SPA.CDLGTRN,PAGEC.LTMETRN);        
        END;        
         
     TRACE = 'GA2016C ===> ' !! 'END F6';        
         
     CALL PT;        
 $END F6;        
         
 /*-----------------------------------------------*/        
         
 F6_2: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F6_2';        
         
     CALL PT;        
 /***************************        
 * PAGEC : AFFICHAGE PAGE   *        
 ***************************/        
         
 PAGEC.NOIDUSR = SPA.NOIDUSR;        
 PAGEC.NOSQUSR = SPA.NOSQUSR;        
 PAGEC.NOIDDEV = SPAVAR.DEVISAF;        
         
 PAGEC.LTMARQU = SUBSTR(SCENARIO_1.LTMARQU,1,30);        
 PAGEC.LTMODEL = SUBSTR(SCENARIO_1.LTMODEL,1,30);        
 PAGEC.NUPLQVH = SCENARIO_12.NUPLQVH;        
 PAGEC.LTCHAVH = SCENARIO_12.LTCHAVH;        
 INTER_F3 = SCENARIO_1.NBTYPKW;        
 INTER_Z3 = INTER_F3;        
 PAGEC.NUPUIVH = INTER_Z3;        
 INTER_F5 = SCENARIO_1.TYPCYLI;        
 INTER_Z5 = INTER_F5;        
 PAGEC.TYPCYLI = INTER_Z5;        
 INTER_P4      = SCENARIO_1.ANNCSTR;        
 PAGEC.ANNCSTR = INTER_C4;        
 INTER_P3 = SCENARIO_1.NBRTRAN;        
 INTER_Z3 = INTER_P3;        
 PAGEC.NBPRTAV = INTER_Z3;        
         
 PAGEC.LTCARBU = SUBSTR(SCENARIO_1.LTCARBU,1,15);        
         
 INTER_F15 = SCENARIO_5.VACATVH * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 PAGEC.VACATVH = INTER_C10;        
         
         
 IF SCENARIO_5.CDASTMC = 'Y'        
   THEN DO;        
          INTER_F15 = SCENARIO_1.TAXETMC * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEC.VATAXIM = INTER_C10;        
        END;        
   ELSE PAGEC.VATAXIM = '';        
         
 PAGEC.CDUSAVH = SCENARIO_5.CDUSAVH;        
 PAGEC.CDCDC26 = SCENARIO_5.CDCDC26;        
 PAGEC.CDASTMC = SCENARIO_5.CDASTMC;        
         
 PAGEC.CDPOSRM = SCENARIO_5.CDPOSRM;        
 IF SCENARIO_5.CDPOSRM = 'Y' THEN        
   DO;        
     PAGEC.LTMARRM = SCENARIO_7.LTMARRM;        
     PAGEC.NUPLQRM = SCENARIO_12.NUPLQRM;        
     PAGEC.LTCHARM = SCENARIO_12.LTCHARM;        
     PAGEC.ANCSTRM = SCENARIO_7.ANCSTRM;        
     INTER_F15 = SCENARIO_7.MTCATRM * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEC.MTCATRM = INTER_C10;        
     INTER_F15 = SCENARIO_7.MTACTRM * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEC.MTACTRM = INTER_C10;        
     PAGEC.NUPDSRM = SCENARIO_7.NUPDSRM;        
   END;        
 ELSE        
   DO;        
     PAGEC.LTMARRM = '';        
     PAGEC.NUPLQRM = '';        
     PAGEC.LTCHARM = '';        
     PAGEC.ANCSTRM = '';        
     PAGEC.MTCATRM = '';        
     PAGEC.MTACTRM = '';        
     PAGEC.NUPDSRM = '';        
   END;        
 /*        
 W_MTPLEIN = 0;        
 W_MTPROMO = 0;        
 W_MTBENEF = 0;        
 */        
 PAGEC.CDPROMO = SCENARIO_6.CDPROMO;        
         
 IF SCENARIO_6.SELECT_GAR.CDSERCI = 'Y' THEN        
   DO;        
     PAGEC.CDGARCI = 'Y';        
     IF SCENARIO_6.CDPROMO ^= ''        
       THEN INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGARCI * 100;        
       ELSE INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGARCI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEC.MTGARCI = INTER_C10;        
   END;        
 ELSE        
   DO;        
     PAGEC.CDGARCI = 'N';        
     PAGEC.MTGARCI = '';        
   END;        
         
 IF SCENARIO_6.SELECT_GAR.CDSECAS = 'Y'        
   THEN DO;        
          PAGEC.CDGACAS = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACAS * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEC.MTGACAS = INTER_C10;        
        END;        
   ELSE DO;        
          PAGEC.CDGACAS = 'N';        
          PAGEC.MTGACAS = '';        
        END;        
 IF SCENARIO_6.SELECT_GAR.CDSECA1 = 'Y'        
   THEN DO;        
          PAGEC.CDGACA1 = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACA1 * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEC.MTGACA1 = INTER_C10;        
        END;        
   ELSE DO;        
          PAGEC.CDGACA1 = 'N';        
          PAGEC.MTGACA1 = '';        
        END;        
 IF SCENARIO_6.SELECT_GAR.CDSEASS = 'Y'        
   THEN DO;        
          PAGEC.CDGAASS = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAASS * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEC.MTGAASS = INTER_C10;        
        END;        
   ELSE DO;        
          PAGEC.CDGAASS = 'N';        
          PAGEC.MTGAASS = '';        
        END;        
         
 /*mobilite */        
         
 IF SCENARIO_6.SELECT_GAR.CDSEMOB= 'Y'        
   THEN DO;        
          PAGEC.CDGAMOB = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAMOB * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEC.MTGAMOB = INTER_C10;        
        END;        
   ELSE DO;        
          PAGEC.CDGAMOB = 'N';        
          PAGEC.MTGAMOB = '';        
        END;        
 /*mobilite plus  */        
         
 IF SCENARIO_6.SELECT_GAR.CDSEMO1 = 'Y'        
   THEN DO;        
          PAGEC.CDGAMO1 = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAMO1* 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEC.MTGAMO1 = INTER_C10;        
        END;        
   ELSE DO;        
          PAGEC.CDGAMO1 = 'N';        
          PAGEC.MTGAMO1 = '';        
        END;        
         
 PAGEC.CDTYPOM = SCENARIO_6.SELECT_GAR.CDTYPOM;        
 PAGEC.CDNIVFR = '';        
 PAGEC.MTOMNIU = '';        
 PAGEC.TB_LTFR(1).LTFRAGR = '    0';        
 PAGEC.TB_LTFR(2).LTFRAGR = '  450';        
 PAGEC.TB_LTFR(3).LTFRAGR = '  900';        
         
 PAGEC.TB_LTFR(1).LTFRNAG = '  450';        
 PAGEC.TB_LTFR(2).LTFRNAG = '  900';        
 PAGEC.TB_LTFR(3).LTFRNAG = ' 1350';        
         
 /* Une omnium ? */        
 SELECT(SCENARIO_6.SELECT_GAR.CDTYPOM);        
   WHEN('1') DO; ##########################        
     IF SCENARIO_6.CDPROMO = ''        
       THEN INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.MTGAOM1 * 100;        
       ELSE INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM1 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEC.MTOMNIU = INTER_C10;        
   END;        
   WHEN('2') DO; ###############################        
     IF SCENARIO_6.CDPROMO = ''        
       THEN INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.MTGAOM2 * 100;        
       ELSE INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM2 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEC.MTOMNIU = INTER_C10;        
   END;        
   WHEN('3') DO; ##########################################        
     PAGEC.CDNIVFR = SCENARIO_6.SELECT_GAR.CDNIVFR;        
         
     SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
       WHEN('1') DO;        
         IF SCENARIO_6.CDPROMO = ''        
           THEN INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM3 * 100;        
           ELSE INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM3 * 100;        
       END;        
       WHEN('2') DO;        
         IF SCENARIO_6.CDPROMO = ''        
           THEN INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM3 * 100;        
           ELSE INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM3 * 100;        
       END;        
       WHEN('3') DO;        
         IF SCENARIO_6.CDPROMO = ''        
           THEN INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM3 * 100;        
           ELSE INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM3 * 100;        
       END;        
       OTHER INTER_F15 = 0;        
     END;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEC.MTOMNIU = INTER_C10;        
   END;        
   WHEN('4') DO; ###############################################        
     PAGEC.CDNIVFR = SCENARIO_6.SELECT_GAR.CDNIVFR;        
         
     SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
       WHEN('1') DO;        
         IF SCENARIO_6.CDPROMO = ''        
           THEN INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM4 * 100;        
           ELSE INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM4 * 100;        
       END;        
       WHEN('2') DO;        
         IF SCENARIO_6.CDPROMO = ''        
           THEN INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM4 * 100;        
           ELSE INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM4 * 100;        
       END;        
       WHEN('3') DO;        
         IF SCENARIO_6.CDPROMO = ''        
           THEN INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM4 * 100;        
           ELSE INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM4 * 100;        
       END;        
       OTHER INTER_F15 = 0;        
     END;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEC.MTOMNIU = INTER_C10;        
   END;        
   OTHER;        
 END;        
         
 PAGEC.CDRMRCI = 'N';        
 PAGEC.MTRMRCI = '';        
 PAGEC.CDRMVO1 = 'N';        
 PAGEC.MTRMVO1 = '';        
 PAGEC.CDRMIN1 = 'N';        
 PAGEC.MTRMIN1 = '';        
 PAGEC.CDRMBRI = 'N';        
 PAGEC.MTRMBRI = '';        
 PAGEC.CDRMDM3 = 'N';        
 PAGEC.MTRMDM3 = '';        
 PAGEC.CDRMDM4 = 'N';        
 PAGEC.MTRMDM4 = '';        
         
 IF SCENARIO_5.CDPOSRM = 'Y' THEN        
   DO;        
     IF SCENARIO_6.SELECT_GAR.CDRMRCI = 'Y' THEN        
       DO;        
         PAGEC.CDRMRCI = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMRCI * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEC.MTRMRCI = INTER_C10;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMVO1 = 'Y' THEN        
       DO;        
         PAGEC.CDRMVO1 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMVO1 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEC.MTRMVO1 = INTER_C10;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMIN1 = 'Y' THEN        
       DO;        
         PAGEC.CDRMIN1 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMIN1 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEC.MTRMIN1 = INTER_C10;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMBRI = 'Y' THEN        
       DO;        
         PAGEC.CDRMBRI = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMBRI * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEC.MTRMBRI = INTER_C10;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMDM3 = 'Y' THEN        
       DO;        
         PAGEC.CDRMDM3 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM3 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEC.MTRMDM3 = INTER_C10;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMDM4 = 'Y' THEN        
       DO;        
         PAGEC.CDRMDM4 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM4 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEC.MTRMDM4 = INTER_C10;        
       END;        
   END;        
         
 IF SCENARIO_12.DAEFFRC > 0        
   THEN DO;        
          PAGEC.JJEFFRC = SUBSTR(SCENARIO_12.DAEFFRC,1,2);        
          PAGEC.MMEFFRC = SUBSTR(SCENARIO_12.DAEFFRC,3,2);        
          PAGEC.AAEFFRC = SUBSTR(SCENARIO_12.DAEFFRC,5,4);        
        END;        
   ELSE DO;        
          PAGEC.JJEFFRC = '';        
          PAGEC.MMEFFRC = '';        
          PAGEC.AAEFFRC = '';        
        END;        
 IF SCENARIO_12.DAEFFAU > 0        
   THEN DO;        
          PAGEC.JJEFFAU = SUBSTR(SCENARIO_12.DAEFFAU,1,2);        
          PAGEC.MMEFFAU = SUBSTR(SCENARIO_12.DAEFFAU,3,2);        
          PAGEC.AAEFFAU = SUBSTR(SCENARIO_12.DAEFFAU,5,4);        
        END;        
   ELSE DO;        
          PAGEC.JJEFFAU = '';        
          PAGEC.MMEFFAU = '';        
          PAGEC.AAEFFAU = '';        
        END;        
         
 INTER_F15 = SCENARIO_5.NBKMPAN;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V00$',0,10);        
 PAGEC.NBKMPAN = SUBSTR(INTER_C10,5,6);        
         
 INTER_F15 = SCENARIO_12.NBKMCPT;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V00$',0,10);        
 PAGEC.NBKMCPT = SUBSTR(INTER_C10,4,7);        
         
     TRACE = 'GA2016C ===> ' !! 'END F6_2';        
         
     CALL PT;        
 $END F6_2;        
 /*-----------------------------------------------*/        
         
 F7: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F7';        
         
     CALL PT;        
 /********************************************        
 * PAGEC : SCROLLING                         *        
 ********************************************/        
     TRACE = 'GA2016C ===> ' !! 'END F7';        
         
     CALL PT;        
 $END F7;        
 /*-----------------------------------------------*/        
         
 F8: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F8';        
         
     CALL PT;        
 /********************************************        
 * PAGEC : PRESENTATION XML                  *        
 ********************************************/        
         
     TRACE = 'GA2016C ===> ' !! 'END F8';        
         
     CALL PT;        
 $END F8;        
 /*-----------------------------------------------*/        
         
 F9: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'F9';        
         
     CALL PT;        
 /********************************************        
 * PAGEC : PRESENTATION XML                  *        
 ********************************************/        
         
     TRACE = 'GA2016C ===> ' !! 'END F9';        
         
     CALL PT;        
 $END F9;        
 /*-----------------------------------------------*/        
         
 FA: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FA';        
         
     CALL PT;        
 /********************************************        
 * VALIDATION SYNTAXIQUE                     *        
 ********************************************/        
 CALL FE;        
 IF SCENARI.TBSCENA(9) THEN RETURN;        
         
 ERREUR = OFF;        
 CDRTPGM_W = '';        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     PUT SKIP LIST('MIDC.CLE = ',MIDC.CLE);        
         
     PUT SKIP LIST('MIDC.NUPLQVH',MIDC.NUPLQVH);        
     PUT SKIP LIST('MIDC.LTCHAVH',MIDC.LTCHAVH);        
     PUT SKIP LIST('MIDC.NUPLQRM',MIDC.NUPLQRM);        
     PUT SKIP LIST('MIDC.LTCHARM',MIDC.LTCHARM);        
     PUT SKIP LIST('MIDC.JJEFFRC',MIDC.JJEFFRC);        
     PUT SKIP LIST('MIDC.MMEFFRC',MIDC.MMEFFRC);        
     PUT SKIP LIST('MIDC.AAEFFRC',MIDC.AAEFFRC);        
     PUT SKIP LIST('MIDC.JJEFFAU',MIDC.JJEFFAU);        
     PUT SKIP LIST('MIDC.MMEFFAU',MIDC.MMEFFAU);        
     PUT SKIP LIST('MIDC.AAEFFAU',MIDC.AAEFFAU);        
     PUT SKIP LIST('MIDC.NBKMCPT',MIDC.NBKMCPT);        
   END;        
         
 /* Controler le MID */        
 /* ---------------- */        
         
 CALL FA_1;        
         
 IF ERREUR        
   THEN DO;        
          JWB001.CDRTPGM = CDRTPGM_W;        
          RETURN;        
        END;        
         
     TRACE = 'GA2016C ===> ' !! 'END FA';        
         
     CALL PT;        
 $END FA;        
 /*-----------------------------------------------*/        
 FA_1: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FA_1';        
         
     CALL PT;        
 /************************        
 * VALIDATION SYNTAXIQUE *        
 ************************/        
         
 IF MIDC.LTCHAVH ^= '' THEN DO;        
    SCENARIO_12.LTCHAVH = MIDC.LTCHAVH;        
 END;        
 ELSE DO;        
      CDRTPGM_W = 'A2016C' !! '006';        
      ERREUR = ON;        
      RETURN;        
      END;        
         
 /* Kilom}tres au compteur */        
 IF MIDC.NBKMCPT ^= '' THEN        
   DO;        
     INTER_F15 = 0;        
     INTER_F15 = F_MTCTF(MIDC.NBKMCPT,0);        
     IF ERREUR        
       THEN DO;        
              CDRTPGM_W = 'A2016C' !! '007';        
              RETURN;        
            END;        
       ELSE SCENARIO_12.NBKMCPT = INTER_F15;        
   END;        
 ELSE SCENARIO_12.NBKMCPT = 0;        
         
     TRACE = 'GA2016C ===> ' !! 'END FA_1';        
         
     CALL PT;        
 $END FA_1;        
 /*-----------------------------------------------*/        
 FB: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FB';        
         
     CALL PT;        
 /********************************************        
 * VALIDATION CONTEXTUELLE                   *        
 ********************************************/        
 ERREUR = OFF;        
 CDRTPGM_W = '';        
         
 CALL FE;        
 IF SCENARI.TBSCENA(9) THEN RETURN;        
         
         
 CALL FB_1;        
         
 IF ERREUR THEN        
   DO;        
     JWB001.CDRTPGM = CDRTPGM_W;        
     RETURN;        
   END;        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     PUT SKIP LIST('SCENARIO_12.NUPLQVH',SCENARIO_12.NUPLQVH);        
     PUT SKIP LIST('SCENARIO_12.LTCHAVH',SCENARIO_12.LTCHAVH);        
     PUT SKIP LIST('SCENARIO_12.NUPLQRM',SCENARIO_12.NUPLQRM);        
     PUT SKIP LIST('SCENARIO_12.LTCHARM',SCENARIO_12.LTCHARM);        
     PUT SKIP LIST('SCENARIO_12.DAEFFRC',SCENARIO_12.DAEFFRC);        
     PUT SKIP LIST('SCENARIO_12.DAEFFAU',SCENARIO_12.DAEFFAU);        
     PUT SKIP LIST('SCENARIO_12.NBKMCPT',SCENARIO_12.NBKMCPT);        
   END;        
         
 SCENARI.TBSCENA(7) = ON; ##################################################        
         
 SCENARI.TBSCENA(8) = ON; ##########################################        
         
 SCENARI.TBSCENA(9) = ON;        
         
         
         
     TRACE = 'GA2016C ===> ' !! 'END FB';        
         
     CALL PT;        
 $END FB;        
 /*-----------------------------------------------*/        
 FB_1: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FB_1';        
         
     CALL PT;        
 /********************************************        
 * VALIDATION CONTEXTUELLE                   *        
 ********************************************/        
         
 SCENARIO_12.NUPLQVH = MIDC.NUPLQVH;        
 SCENARIO_12.LTCHAVH = MIDC.LTCHAVH;        
 SCENARIO_12.NUPLQRM = MIDC.NUPLQRM;        
 SCENARIO_12.LTCHARM = MIDC.LTCHARM;        
         
 /* Date d'effet garantie RC */        
 INTER_C8 = MIDC.JJEFFRC !! MIDC.MMEFFRC !! MIDC.AAEFFRC;        
 IF VERIFY(INTER_C8,NUM) > 0        
   THEN DO;        
          CDRTPGM_W = 'A2016C' !! '001';        
          ERREUR = ON;        
          RETURN;        
        END;        
 CALL F_CTRL_DA(INTER_C8,'2');        
 IF ERREUR        
   THEN DO;        
          CDRTPGM_W = 'A2016C' !! '001';        
          RETURN;        
        END;        
 IF KGI011J_RO.SAAMMJJ_P7 <= #DATE_SAAMMJJ        
   THEN DO;        
          CDRTPGM_W = 'A2016C' !! '001';        
          ERREUR = ON;        
          RETURN;        
        END;        
 SCENARIO_12.DAEFFRC = KGI011J_RO.JJMMAAAA_P8;        
         
 /* Date d'effet garantie AU */        
 INTER_C8 = MIDC.JJEFFAU !! MIDC.MMEFFAU !! MIDC.AAEFFAU;        
 IF VERIFY(INTER_C8,NUM) > 0        
   THEN DO;        
          CDRTPGM_W = 'A2016C' !! '002';        
          ERREUR = ON;        
          RETURN;        
        END;        
 CALL F_CTRL_DA(INTER_C8,'2');        
 IF ERREUR        
   THEN DO;        
          CDRTPGM_W = 'A2016C' !! '002';        
          RETURN;        
        END;        
 IF KGI011J_RO.SAAMMJJ_P7 <= #DATE_SAAMMJJ        
   THEN DO;        
          CDRTPGM_W = 'A2016C' !! '002';        
          ERREUR = ON;        
          RETURN;        
        END;        
 SCENARIO_12.DAEFFAU = KGI011J_RO.JJMMAAAA_P8;        
         
         
     TRACE = 'GA2016C ===> ' !! 'END FB_1';        
         
     CALL PT;        
 $END FB_1;        
 /*-----------------------------------------------*/        
 FC: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC';        
         
     CALL PT;        
 /********************************************        
 * UPDATE DES DB                             *        
 ********************************************/        
 /*        
 PUT SKIP LIST('INFOS_USER.CDAFGRP = ',INFOS_USER.CDAFGRP);        
 */        
         
 CALL $DATES_TIMES;        
 IF SPAVAR.IDENTI.CDLGEAF = 'N'        
   THEN W_LGEAF = '2';        
 ELSE W_LGEAF = '1';        
         
 INTER_P7 = SPAVAR.IDENTI.NOIDAFF;        
 JS1003.NOIDAFN = INTER_C7;        
 JS1003.NOIDAFO = '';        
 CALL XS1038(JS1003);        
         
 /* Maj nouvelle version devis identifi{ avec        
    infos souscription */        
 CALL FC_1;        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     PUT SKIP LIST('SPAVAR.CDBLOCK',SPAVAR.CDBLOCK);        
   END;        
         
 IF ^ERREUR THEN        
   DO;        
     CALL FC_2; ######################################        
   END;        
         
         
 IF ^ERREUR THEN        
   DO;        
     CALL FC_3;  ########################################################        
   END;        
         
 IF SPAVAR.CDBLOCK = 'Y' THEN        
   DO;        
     SPAVAR.CDTYPOP = 'B';        
     RETURN;        
   END;        
         
 IF ^ERREUR & SPA.CDOPTRN ^= 'A2ADS' THEN        
   DO;        
     CALL FC_5; ######################################        
   END;        
         
         
 IF ^ERREUR THEN        
   DO;        
     CALL FC_4; #########################################################        
   END;        
         
         
 IF ^ERREUR &  SPA.CDOPTRN = 'A2ADS'        
   THEN CALL FC_6; ###############################################        
         
         
 IF ERREUR THEN        
   DO;        
     JWB001.CDRTPGM = CDRTPGM_W;        
     RETURN;        
   END;        
         
         
     TRACE = 'GA2016C ===> ' !! 'END FC';        
         
     CALL PT;        
 $END FC;        
 /*-----------------------------------------------*/        
 FC_1: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_1';        
         
     CALL PT;        
         
 /************************************************        
 * UPDATE DB : COMPLETER LE DEVIS AUTO IDENTIFIE *        
 *             AVEC LES INFOS SOUSCRIPTION       *        
 ************************************************/        
 DCL W_TYGA                CHAR(03);        
 DCL W_TFGA                CHAR(02);        
 DCL W_NUVS                PIC '99';        
 DCL W_MTPB                FIXED(9);        
 DCL W_NURDDIV             FIXED(5,2);        
 DCL W_NUMJDIV             FIXED(5,2);        
 DCL SWGAR                 BIT(1) INIT('0'B);        
         
 /* Relire le devis pour retrouver les infos        
 */        
         
 JA2F11.PTRPCB.ALTPCB    = GA2016J.ALTPCB;        
 JA2F11.PTRPCB.TABPCB    = GA2016J.DC105PCB;        
 JA2F11.PTRPCB.DSM88PCB  = GA2016J.DSM88PCB;        
 JA2F11.PTRPCB.DSM22PCB  = GA2016J.DSM22PCB;        
 JA2F11.PTRPCB.DS139PCB  = GA2016J.DS139PCB;        
 JA2F11.PTRPCB.DS133PCB  = GA2016J.DS133PCB;        
 JA2F11.PTRPCB.DSM55PCB  = GA2016J.DSM55PCB;        
 JA2F11.PTRPCB.DEU02PCB  = GA2016J.DEU02PCB;        
 JA2F11.INPUT         = '';        
 JA2F11.INPUT.CDTYPOP = 'A';        
 JA2F11.INPUT.CDDVTRN = SPA.CDDVTRN;        
 INTER_C11 = SUBSTR(SPAVAR.NOIDDEV,3,11);        
 JA2F11.INPUT.NOIDDEV = INTER_P11;        
         
 JA2F11.DATA          = '';        
 JA2F11.OUTPUT        = '';        
         
 CALL XA2F11(JA2F11,IEU001);        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
    PUT SKIP EDIT(' apres XA2F11 (relire_devis pour maj souscr) ')(A);        
    PUT SKIP EDIT(' =========================================== ')(A);        
    PUT SKIP DATA(JA2F11);        
   END;        
 JA2F11.INPUT.CDTYPOP = '';        
 JA2F11.CDTAGAN = '';        
         
 IF JA2F11.CDRTPGM ^= '' THEN        
   DO;        
     IF IEU001_R.CDEVTRN ^= 'P'        
     &  IEU001_R.CDEVTRN ^= 'A' THEN        
     DO;        
     PUT SKIP LIST('Erreur lecture devis identifie !!!');        
     PUT SKIP EDIT(' apres XA2F11 ')(A);        
     PUT SKIP EDIT(' ============ ')(A);        
     PUT SKIP DATA(JA2F11);        
     END;        
     CDRTPGM_W = 'A2016C' !! '005';        
     ERREUR    = ON;        
     RETURN;        
   END;        
         
 JA2F11.DAEFRJJ = SUBSTR(SCENARIO_12.DAEFFRC,1,2);        
 JA2F11.DAEFRMM = SUBSTR(SCENARIO_12.DAEFFRC,3,2);        
 JA2F11.DAEFRAA = SUBSTR(SCENARIO_12.DAEFFRC,5,4);        
 JA2F11.DAEFAJJ = SUBSTR(SCENARIO_12.DAEFFAU,1,2);        
 JA2F11.DAEFAMM = SUBSTR(SCENARIO_12.DAEFFAU,3,2);        
 JA2F11.DAEFAAA = SUBSTR(SCENARIO_12.DAEFFAU,5,4);        
 JA2F11.JJDEPER = SUBSTR(SCENARIO_5.DAPERMI,1,2);        
 JA2F11.MMDEPER = SUBSTR(SCENARIO_5.DAPERMI,3,2);        
 JA2F11.AADEPER = SUBSTR(SCENARIO_5.DAPERMI,5,4);        
         
 JA2F11.LTPLQVH = SCENARIO_12.NUPLQVH;        
 JA2F11.LTCHAVH = SCENARIO_12.LTCHAVH;        
         
 IF SCENARIO_10.CDCONAL = 'Y'        
   THEN JA2F11.CDINTOX = '1';        
   ELSE JA2F11.CDINTOX = ' ';        
 IF SCENARIO_10.CDCONIV = 'Y'        
   THEN JA2F11.CDIVRES = '1';        
   ELSE JA2F11.CDIVRES = ' ';        
 IF SCENARIO_10.CDCONFU = 'Y'        
   THEN JA2F11.CDFUITE = '1';        
   ELSE JA2F11.CDFUITE = ' ';        
         
 INTER_P2 = SCENARIO_5.NBSINIS;        
 INTER_C1 = SUBSTR(INTER_C2,2,1);        
 JA2F11.NBSINRC = INTER_P1;        
 JA2F11.NBSINVO = SCENARIO_10.NBSINVO;        
 INTER_P2 = SCENARIO_10.NBSINDM;        
 INTER_C1 = SUBSTR(INTER_C2,2,1);        
 JA2F11.NBSINDM = INTER_P1;        
 JA2F11.NBDECPE = SCENARIO_10.NBDEPER;        
         
 JA2F11.CDPORES = 'N';        
 JA2F11.CDPRASS = 'N';        
         
 IF SCENARIO_5.BOAUTCP = 'Y' THEN        
   DO;        
     JA2F11.CDPRASS = 'Y';        
     JA2F11.NOIDCMP = SUBSTR(SCENARIO_9.NUMCPIE,1,4);        
     JA2F11.NOPOCMP = SUBSTR(SCENARIO_9.NOIDPOC,1,12);        
     IF SCENARIO_9.CDRESRI = 'Y' THEN        
       DO;        
         JA2F11.CDPORES = 'Y';        
         JA2F11.CDIDRES = TRANSLATE(SCENARIO_9.CDTYPRE,'PSA','123');        
         JA2F11.CDMOTAN = SUBSTR(SCENARIO_9.NUMSMRS,3,2);        
       END;        
   END;        
         
 IF SCENARIO_5.CDCDC26 = 'Y' THEN        
   DO;        
     JA2F11.CDJEUCO = '1';        
     /* Premier conducteur ... */        
     IF SCENARIO_11.LTNMHA1 ^= ''        
      & SCENARIO_11.LTPRHA1 ^= '' THEN        
       DO;        
         CALL F_CTRL_DA(SCENARIO_11.DANAIS1,'2');        
         IF ^ERREUR THEN        
           DO;        
             JA2F11.JEUNECO(1).LTNMCON = SCENARIO_11.LTNMHA1;        
             JA2F11.JEUNECO(1).LTPRCON = SCENARIO_11.LTPRHA1;        
             JA2F11.JEUNECO(1).DATENAI = KGI011J_RO.SAAMMJJ_P7;        
             INTER_C4 = SCENARIO_11.ANPERM1;        
             INTER_F4 = INTER_P4;        
             JA2F11.JEUNECO(1).DAPERMI = INTER_F4;        
             JA2F11.JEUNECO(1).CDQUACO = SCENARIO_11.CDQUHA1;        
           END;        
       END;        
     /* Deuxi}me conducteur ... */        
     IF SCENARIO_11.LTNMHA2 ^= ''        
      & SCENARIO_11.LTPRHA2 ^= '' THEN        
       DO;        
         CALL F_CTRL_DA(SCENARIO_11.DANAIS2,'2');        
         IF ^ERREUR THEN        
           DO;        
             JA2F11.JEUNECO(2).LTNMCON = SCENARIO_11.LTNMHA2;        
             JA2F11.JEUNECO(2).LTPRCON = SCENARIO_11.LTPRHA2;        
             JA2F11.JEUNECO(2).DATENAI = KGI011J_RO.SAAMMJJ_P7;        
             INTER_C4 = SCENARIO_11.ANPERM2;        
             INTER_F4 = INTER_P4;        
             JA2F11.JEUNECO(2).DAPERMI = INTER_F4;        
             JA2F11.JEUNECO(2).CDQUACO = SCENARIO_11.CDQUHA2;        
           END;        
       END;        
     /* Troisi}me conducteur ... */        
     IF SCENARIO_11.LTNMHA3 ^= ''        
      & SCENARIO_11.LTPRHA3 ^= '' THEN        
       DO;        
         CALL F_CTRL_DA(SCENARIO_11.DANAIS3,'2');        
         IF ^ERREUR THEN        
           DO;        
             JA2F11.JEUNECO(3).LTNMCON = SCENARIO_11.LTNMHA3;        
             JA2F11.JEUNECO(3).LTPRCON = SCENARIO_11.LTPRHA3;        
             JA2F11.JEUNECO(3).DATENAI = KGI011J_RO.SAAMMJJ_P7;        
             INTER_C4 = SCENARIO_11.ANPERM3;        
             INTER_F4 = INTER_P4;        
             JA2F11.JEUNECO(3).DAPERMI = INTER_F4;        
             JA2F11.JEUNECO(3).CDQUACO = SCENARIO_11.CDQUHA3;        
           END;        
       END;        
   END;        
   ELSE JA2F11.CDJEUCO = '0';        
         
 JA2F11.NBKMCPT = SCENARIO_12.NBKMCPT;        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
    PUT SKIP EDIT(' avant XA2F11 ')(A);        
    PUT SKIP EDIT(' ============ ')(A);        
    PUT SKIP DATA(JA2F11);        
         
 PUT SKIP LIST('GA2016C FC_1:MAJ devis, CDOPTRN=',SPA.CDOPTRN);        
   END;        
         
 CALL XA2F11(JA2F11,IEU001);        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
    PUT SKIP EDIT(' apres XA2F11 ')(A);        
    PUT SKIP EDIT(' ============ ')(A);        
    PUT SKIP DATA(JA2F11);        
   END;        
 IF JA2F11.CDRTPGM ^= '' THEN        
   DO;        
     IF IEU001_R.CDEVTRN ^= 'P'        
     &  IEU001_R.CDEVTRN ^= 'A' THEN        
     DO;        
      PUT SKIP EDIT(' Erreur mise a jour devis identifie !!! ')(A);        
      PUT SKIP DATA(JA2F11);        
     END;        
     CDRTPGM_W = 'A2016C' !! '005';        
     SPAVAR.CDTYPOP = 'E';        
     ERREUR    = ON;        
     RETURN;        
   END;        
         
 SPAVAR.VERSDEV = JA2F11.NOIDVER;        
         
 IF SPA.CDOPTRN = 'A2RDV'        
  & SPAVAR.CDBLOCK ^= 'Y' THEN        
   DO;        
     JSM131.PARAM   = '';        
     JSM131.ALTPCB  = GA2016J.ALTPCB;        
     JSM131.CDSCTRN = ' ';        
     JSM131.CDEVTRN = IEU001_R.CDEVTRN;        
     JSM131.NBTYSTA = 1;        
     JSM131.CDTYSTA(JSM131.NBTYSTA) = 'ETHWR';        
     JSM131.NOIDCPT(JSM131.NBTYSTA) = 2; ######################################        
     JSM131.MTVAINC(JSM131.NBTYSTA) = 1;        
     JSM131.DAOPGES(JSM131.NBTYSTA) = $DATE_SAAMMJJ;        
     STAT_W = TRANSLATE(SPA.CDLGTRN,'FNF','123') !! 'A201001';        
     JSM131.LTIDCLE(JSM131.NBTYSTA) = STAT_W;        
         
     /**********************************************        
     * Alimentation compteur statsistiques relance *        
     **********************************************/        
     CALL XSM532(JSM131);        
   END;        
         
         
     TRACE = 'GA2016C ===> ' !! 'END FC_1';        
         
     CALL PT;        
 $END FC_1;        
 /*-----------------------------------------------*/        
 FC_2: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_2';        
         
     CALL PT;        
         
 /*******************************************        
 * UPDATE DB : MESSAGE AU GESTIONNAIRE AUTO *        
 *******************************************/        
         
 JSM152.PARAM = '';        
 JSM152.OPER = '02';        
 JSM152.DB1PCB = GA2016J.DSM18PCB;        
 JSM152.DB2PCB = GA2016J.DC105PCB;        
         
 /*        
 IF TRIM(SPAVAR.IDENTI.CDCPOAF) >= '1000'        
  & TRIM(SPAVAR.IDENTI.CDCPOAF) <= '1210'        
   THEN INPUT_02.CDORGMG_W = 'A2BINT';        
   ELSE        
 */        
     IF SPAVAR.IDENTI.CDLGEAF = 'F'        
       THEN INPUT_02.CDORGMG_W ='A2FINT';        
       ELSE INPUT_02.CDORGMG_W ='A2NINT';        
         
 IF SPAVAR.CDBLOCK = 'Y'        
   THEN INPUT_02.LTNMMSG_W = 'A2MM03' !! SPAVAR.DEVISAF !! '-' !!        
                             JS1003.NOIDAFO;        
   ELSE INPUT_02.LTNMMSG_W = 'A2MM02' !! SPAVAR.DEVISAF !! '-' !!        
                             JS1003.NOIDAFO;        
 INPUT_02.CDOPTRN = 'S1GSI';        
 INPUT_02.TBEGCOD(1) = '1'B; ###########################        
 INPUT_02.TBEGCOD(3) = '1'B; ###########################        
 INPUT_02.TBEGCOD(9) = '1'B; ############################        
 INPUT_02.CDCMGES = ' INTNET';        
 INPUT_02.NOIDAFF = SPAVAR.IDENTI.NOIDAFF;        
 INPUT_02.DAENTMG_W = 9999999 - #DATE_SAAMMJJ;        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     PUT SKIP LIST('**** avant message au gestionnaire  ***');        
     PUT SKIP DATA(JSM152);        
     PUT SKIP LIST('INPUT_02.CDORGMG_W=',        
                    INPUT_02.CDORGMG_W);        
     PUT SKIP LIST('INPUT_02.DAENTMG_W=',        
                    INPUT_02.DAENTMG_W);        
     PUT SKIP LIST('INPUT_02.LTNMMSG_W=',        
                    INPUT_02.LTNMMSG_W);        
     PUT SKIP LIST('INPUT_02.CDOPTRN=',        
                    INPUT_02.CDOPTRN);        
     PUT SKIP LIST('INPUT_02.CDCMGES=',        
                    INPUT_02.CDCMGES);        
     PUT SKIP LIST('INPUT_02.NOIDAFF=',        
                    INPUT_02.NOIDAFF);        
   END;        
 CALL XSM587(JSM152,IEU001);        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          PUT SKIP LIST('**** apr}s message au gestionnaire  ***');        
     ELSE PUT SKIP LIST('**** apres message au gestionnaire  ***');        
     PUT SKIP DATA(JSM152);        
   END;        
         
 /* Maj STATISTIQUES DU SITE */        
 STAT_W = TRANSLATE(SPA.CDLGTRN,'FNF','123') !! 'A201001';        
 IF SPAVAR.CDBLOCK = 'Y'        
   THEN CALL STATSITE(STAT_W,8,1,'M'); ########################        
   ELSE CALL STATSITE(STAT_W,6,1,'M'); #######################################        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_2';        
         
     CALL PT;        
 $END FC_2;        
 /*-----------------------------------------------*/        
 FC_3: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_3';        
         
     CALL PT;        
         
 /*******************************************        
 * UPDATE DB : MESSAGE LETTRE SUR LE S1GSI  *        
 *******************************************/        
         
 DCL OPTIONS               BIT(1) INIT('0'B);        
 DCL CDACTIV_X             CHAR(04);        
         
 IF INFOS_USER.CDAFGRP ^= '' THEN        
   CALL FC_33;##############################################        
   /* Lire nom de la profession et de l'activite */        
 CALL LECT_CLPF(SCENARIO_5.CDTYPRO,LTPROPR_W);        
 CDACTIV_X = SCENARIO_5.CDTYPRO !! SCENARIO_5.CDGEPRO;        
 CALL LECT_CLAP(CDACTIV_X,LTACTIV_W);        
         
 JSM037.C105PCB = GA2016J.DC105PCB;        
 JSM037.SM12PCB = NULL();        
 JSM037.SM18PCB = GA2016J.DSM18PCB;        
 JSM037.SM19PCB = GA2016J.DSM19PCB;        
 JSM037.SM22PCB = GA2016J.DSM22PCB;        
 JSM037.S124MPCB = GA2016J.DS124PCB;        
 JSM037.SM60PCB = GA2016J.DSM60PCB;        
 JSM037.SM61PCB = GA2016J.DSM61PCB;        
 JSM037.SM62PCB = GA2016J.DSM62PCB;        
 JSM037.SM63PCB = GA2016J.DSM63PCB;        
 JSM037.SM64PCB = GA2016J.DSM64PCB;        
 JSM037.SM65PCB = GA2016J.DSM65PCB;        
 JSM037.SM66PCB = GA2016J.DSM66PCB;        
 JSM037.SM67PCB = GA2016J.DSM67PCB;        
 JSM037.SM68PCB = GA2016J.DSM68PCB;        
 JSM037.SM69PCB = GA2016J.DSM69PCB;        
 JSM037.SM01PCB = NULL();        
 JSM037.A106PCB = NULL();        
 JSM037.T106PCB = NULL();        
 JSM037.D106PCB = NULL();        
 JSM037.I106PCB = NULL();        
 JSM037.SA03PCB = NULL();        
 JSM037.MS05PCB = NULL();        
 JSM037.AC03PCB = NULL();        
 JSM037.MD02PCB = NULL();        
 JSM037.S103PCB = GA2016J.DS103PCB;        
 JSM037.CDRTPGM = '';        
 JSM037.NOLETTR = '';        
 JSM037.CDTYINP = 'I';        
 JSM037.CDTYPMS = 'E';        
 JSM037.CDSCTRN = ' ';        
 JSM037.CDPARMT = ' ';        
 JSM037.CDLGLTT = W_LGEAF;        
 JSM037.NOIDAFF = SPAVAR.IDENTI.NOIDAFF;        
 JSM037.NOIDTAB = '';        
 /* SI MESSAGERIE, CHARGER LA DATE DE VISUALISATION */        
 JSM037.DAVISMS = '' #################;        
 JSM037.CDCMGES = 'INTNET';        
         
 /* Informations concernant le conducteur et la voiture  */        
 IF SPAVAR.IDENTI.CDLGEAF = 'F'        
   THEN CALL FC_31; #############################        
   ELSE CALL FC_32; #############################        
         
 INTER_P7 = SPAVAR.IDENTI.NOIDAFF;        
 JSM037.CDMMDST = 'A' !! INTER_C7;        
         
 CALL XSM307(IEU001,JSM037);        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          PUT SKIP LIST('JSM037 apr}s call',JSM037.CDRTPGM);        
     ELSE PUT SKIP LIST('JSM037 apres call',JSM037.CDRTPGM);        
   END;        
         
 JWB001.CDRTPGM = JSM037.CDRTPGM;        
         
 SELECT (JSM037.CDRTPGM);        
    WHEN('');        
    OTHER    DO;        
        SELECT(SUBSTR(JSM037.CDRTPGM,1,2));        
          WHEN ('DB')        
               DO;        
                 JWB001.LSTCALL = JSM037.LASTDLI;        
                 IEU001.CDRTPGM = JSM037.CDRTPGM;        
                 CALL ERR_DL1;        
               END;        
          OTHER        
               DO;        
                 IF IEU001_R.CDEVTRN ^= 'P'        
                 &  IEU001_R.CDEVTRN ^= 'A' THEN        
                 PUT SKIP LIST('ERREUR DANS L''INTERFACE HOST XSM307');        
         
                 ERREUR =ON;        
                 RETURN;        
               END;        
        END;        
      END;        
 END;        
         
         
         
 /* Informations concernant la remorque */        
 IF SCENARIO_5.CDPOSRM = 'Y' THEN        
   DO;        
     IF SPAVAR.IDENTI.CDLGEAF = 'F'        
       THEN CALL FC_312; ###########################        
       ELSE CALL FC_322; #############################        
         
     CALL XSM307(IEU001,JSM037);        
     /*        
     PUT SKIP LIST('JSM037 apr}s call',JSM037);        
     */        
     JWB001.CDRTPGM = JSM037.CDRTPGM;        
         
     SELECT (JSM037.CDRTPGM);        
       WHEN('');        
       OTHER DO;        
         SELECT(SUBSTR(JSM037.CDRTPGM,1,2));        
           WHEN ('DB')        
             DO;        
               JWB001.LSTCALL = JSM037.LASTDLI;        
               IEU001.CDRTPGM = JSM037.CDRTPGM;        
               CALL ERR_DL1;        
             END;        
           OTHER        
             DO;        
               IF IEU001_R.CDEVTRN ^= 'P'        
               &  IEU001_R.CDEVTRN ^= 'A' THEN        
               PUT SKIP LIST('ERREUR DANS L''INTERFACE HOST XSM307');        
               ERREUR =ON;        
               RETURN;        
             END;        
         END;        
       END;        
     END;        
   END;        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_3';        
         
     CALL PT;        
 $END FC_3;        
 /*-----------------------------------------------*/        
 FC_31: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_31';        
         
     CALL PT;        
 /*******************************************************        
 * UPDATE DB : MESSAGE LETTRE FRANCOPHONE SUR LE S1GSI  *        
 *******************************************************/        
 JSM037.LTMESSA = 'CONTRAT AUTO VIA INTERNET ';        
         
 JSM037.LIGNI(*) = '';        
 JSM037.LIGNI(1) = ' SOUSCRIPTION d''un contrat assurance ' !!        
                   'auto - Devis : ' !! SPAVAR.DEVISAF;        
 IND = 2;        
 IF INFOS_USER.CDAFGRP ^= '' THEN        
   DO;        
     JSM037.LIGNI(IND) =' Affinity Groupe : ' !!                                
                        INFOS_USER.CDAFGRP !! ' ' !! LIBELAFF;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) =' Identification  : ' !! IDENTAFF;                      
     IND = IND + 1;        
   END;        
 IF SCENARIO_5.BOAUTCP='N' THEN        
   DO;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          JSM037.LIGNI(IND) = ' Premi}re immatriculation ';        
     ELSE JSM037.LIGNI(IND) = ' Premiere immatriculation ';        
     IND = IND + 1;        
   END;        
         
 IF SCENARIO_5.BOAUTCP='Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' Risque couvert par une autre compagnie';        
     IND = IND + 1;        
     CALL LECT_CPIE(SCENARIO_9.NUMCPIE,LIBTXT);        
     JSM037.LIGNI(IND) = ' Nom de la compagnie : ' !! LIBTXT;        
     IND = IND + 1;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          JSM037.LIGNI(IND) = ' Num{ro de police    : ' !!        
                              SCENARIO_9.NOIDPOC;        
     ELSE JSM037.LIGNI(IND) = ' Numero de police    : ' !!        
                              SCENARIO_9.NOIDPOC;        
     IND = IND + 1;        
         
     IF SCENARIO_9.CDRESRI='Y' THEN        
       DO;        
         SELECT(SCENARIO_9.CDTYPRE);        
           WHEN('1') DO;        
             IF SPA.CDPGTRN = '5' THEN #####################################        
                  JSM037.LIGNI(IND)=' Contrat r{sili{ par le preneur'!!        
                                    ' d''assurance';        
             ELSE JSM037.LIGNI(IND)=' Contrat resilie par le preneur'!!        
                                    ' d''assurance';        
             IND = IND + 1;        
           END;        
           WHEN('2') DO;        
             IF SPA.CDPGTRN = '5' THEN #####################################        
                  JSM037.LIGNI(IND)=' Contrat r{sili{ par la compagnie';        
             ELSE JSM037.LIGNI(IND)=' Contrat resilie par la compagnie';        
             IND = IND + 1;        
           END;        
           WHEN('3') DO;        
             IF SPA.CDPGTRN = '5' THEN #####################################        
                  JSM037.LIGNI(IND)=' Contrat r{sili{ d''un commun'!!        
                                    ' accord';        
             ELSE JSM037.LIGNI(IND)=' Contrat resilie d''un commun'!!        
                                    ' accord';        
             IND = IND + 1;        
           END;        
           OTHER;        
         END;        
         CALL LECT_SMRS(SCENARIO_9.NUMSMRS,LIBTXT);        
         JSM037.LIGNI(IND) = ' Motif : ' !! LIBTXT;        
         IND = IND + 1;        
       END;        
     ELSE        
       DO;        
       IF SPA.CDPGTRN = '5' THEN ##############################        
            JSM037.LIGNI(IND)=' Le contrat du risque n''a pas {t{ '!!        
                              'r{sili{';        
       ELSE JSM037.LIGNI(IND)=' Le contrat du risque n''a pas ete '!!        
                              'resilie';        
       IND = IND + 1;        
       END;        
   END;        
 IND = IND + 1;        
         
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' PRENEUR D''ASSURANCE : Affili{ Ethias N '        
                          !! JS1003.NOIDAFO;        
 ELSE JSM037.LIGNI(IND) = ' PRENEUR D''ASSURANCE : Affilie Ethias N '        
                          !! JS1003.NOIDAFO;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' =====================';        
 IND = IND + 1;        
         
 W_CHAIN = SUBSTR(SPAVAR.IDENTI.DANAIAF,1,2) !! '/' !!        
           SUBSTR(SPAVAR.IDENTI.DANAIAF,3,2) !! '/' !!        
           SUBSTR(SPAVAR.IDENTI.DANAIAF,5,4);        
 SELECT (SPAVAR.IDENTI.CDRSAFF);        
   WHEN('1') #################        
     DO;        
       JSM037.LIGNI(IND) = ' Monsieur, ' !!        
              TRIM(SPAVAR.IDENTI.LTNMAFF) !! ' ' !!        
              TRIM(SPAVAR.IDENTI.LTPRAFF);        
       IND = IND + 1;        
       IF SPA.CDPGTRN = '5' THEN ##############################        
            JSM037.LIGNI(IND) = ' N{ le : ' !! W_CHAIN;        
       ELSE JSM037.LIGNI(IND) = ' Ne le : ' !! W_CHAIN;        
       IND = IND + 1;        
     END;        
   WHEN('2') #################        
     DO;        
       JSM037.LIGNI(IND) = ' Madame, ' !!        
              TRIM(SPAVAR.IDENTI.LTNMAFF) !! ' ' !!        
              TRIM(SPAVAR.IDENTI.LTPRAFF);        
       IND = IND + 1;        
       IF SPA.CDPGTRN = '5' THEN #####################################        
            JSM037.LIGNI(IND) = ' N{e le : ' !! W_CHAIN;        
       ELSE JSM037.LIGNI(IND) = ' Nee le : ' !! W_CHAIN;        
       IND = IND + 1;        
     END;        
   WHEN('3') ##################        
     DO;        
       JSM037.LIGNI(IND) = ' Mademoiselle, ' !!        
              TRIM(SPAVAR.IDENTI.LTNMAFF) !! ' ' !!        
              TRIM(SPAVAR.IDENTI.LTPRAFF);        
       IND = IND + 1;        
       IF SPA.CDPGTRN = '5' THEN ##############################        
            JSM037.LIGNI(IND) = ' N{e le : ' !! W_CHAIN;        
       ELSE JSM037.LIGNI(IND) = ' Nee le : ' !! W_CHAIN;        
       IND = IND + 1;        
     END;        
   OTHER;        
 END;        
 JSM037.LIGNI(IND) = ' Conjoint : ' !! SCENARIO_10.LTNOMCO !! ' ' !!        
                     SCENARIO_10.LTPRECO;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' N{(e) le : '        
                          !!        SUBSTR(SCENARIO_10.DANAICO,1,2)        
                          !! '/' !! SUBSTR(SCENARIO_10.DANAICO,3,2)        
                          !! '/' !! SUBSTR(SCENARIO_10.DANAICO,5,4);        
 ELSE JSM037.LIGNI(IND) = ' Ne(e) le : '        
                          !!        SUBSTR(SCENARIO_10.DANAICO,1,2)        
                          !! '/' !! SUBSTR(SCENARIO_10.DANAICO,3,2)        
                          !! '/' !! SUBSTR(SCENARIO_10.DANAICO,5,4);        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Adresse du preneur : ';        
 IND = IND + 1;        
 INTER_F4 = SPAVAR.IDENTI.NOHA1AF;        
 INTER_Z4 = INTER_F4;        
         
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' Rue           : ' !!        
                          SPAVAR.IDENTI.LTRUEAF !!        
                          '  Num{ro   : ' !! INTER_Z4 !!        
                          '   Boite : ' !!        
                          SPAVAR.IDENTI.NOHA2AF;        
 ELSE JSM037.LIGNI(IND) = ' Rue           : ' !!        
                          SPAVAR.IDENTI.LTRUEAF !!        
                          '  Numero   : ' !! INTER_Z4 !!        
                          '   Boite : ' !!        
                          SPAVAR.IDENTI.NOHA2AF;        
 IND = IND + 1;        
         
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' Code postal   : ' !!        
                          SPAVAR.IDENTI.CDCPOAF !!        
                          '                     Localit{ :'!!        
                          SPAVAR.IDENTI.LTLOCAF;        
 ELSE JSM037.LIGNI(IND) = ' Code postal   : ' !!        
                          SPAVAR.IDENTI.CDCPOAF !!        
                          '                     Localite :'!!        
                          SPAVAR.IDENTI.LTLOCAF;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Adresse E-mail: '!! SPAVAR.IDENTI.EMAILAF;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
   DO;        
    JSM037.LIGNI(IND) = ' Profession    : ' !! SCENARIO_5.CDTYPRO !!        
                        ' ' !! TRIM(LTPROPR_W);        
    IND = IND + 1;        
    JSM037.LIGNI(IND) = ' Activit{      : ' !! SCENARIO_5.CDGEPRO !!        
                        ' ' !! TRIM(LTACTIV_W);        
   END;        
 ELSE        
   DO;        
    JSM037.LIGNI(IND) = ' Profession    : ' !! SCENARIO_5.CDTYPRO !!        
                        ' ' !! TRIM(LTPROPR_W);        
    IND = IND + 1;        
    JSM037.LIGNI(IND) = ' Activite      : ' !! SCENARIO_5.CDGEPRO !!        
                        ' ' !! TRIM(LTACTIV_W);        
   END;        
         
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Employeur     : ' !! SCENARIO_10.LTEMPPR;        
 IND = IND + 1;        
         
 W_CHAIN = ' Travaille dans l''horeca      : ';        
 IF SCENARIO_5.BOHOREC ='Y'        
   THEN W_CHAIN = W_CHAIN !! 'Oui';        
   ELSE W_CHAIN = W_CHAIN !! 'Non';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 INTER_C8 = SCENARIO_5.DAPERMI;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      W_CHAIN  = ' Date de d{livrance du permis : '        
                          !!        SUBSTR(INTER_C8,1,2)        
                          !! '/' !! SUBSTR(INTER_C8,3,2)        
                          !! '/' !! SUBSTR(INTER_C8,5,4);        
 ELSE W_CHAIN  = ' Date de delivrance du permis : '        
                          !!        SUBSTR(INTER_C8,1,2)        
                          !! '/' !! SUBSTR(INTER_C8,3,2)        
                          !! '/' !! SUBSTR(INTER_C8,5,4);        
 SELECT(SCENARIO_10.CDTYPPR);        
   WHEN('1')        
     JSM037.LIGNI(IND) = W_CHAIN !! '  Type de permis : Belge';        
   WHEN('2')        
     JSM037.LIGNI(IND) = W_CHAIN !! '  Type de permis : International';        
   WHEN('3');        
   OTHER;        
 END;        
 IND = IND + 1;        
         
 INTER_P2 = SCENARIO_5.AGEPERM;        
 INTER_Z2 = INTER_P2;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      W_CHAIN  = ' Nombre d''ann{es de conduite  : ' !! INTER_Z2;        
 ELSE W_CHAIN  = ' Nombre d''annees de conduite  : ' !! INTER_Z2;        
 JSM037.LIGNI(IND) = W_CHAIN;        
         
 IND = IND + 1;#############################        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' Condamnation du conducteur principal au ' !!        
                          'cours des 5 derni}res ann{es';        
 ELSE JSM037.LIGNI(IND) = ' Condamnation du conducteur principal au ' !!        
                          'cours des 5 dernieres annees';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Pour intoxication alcoolique : ' !!        
                     SCENARIO_10.CDCONAL;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Pour ivresse au volant       : ' !!        
                     SCENARIO_10.CDCONIV;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' - Pour d{lit de fuite          : ' !!        
                          SCENARIO_10.CDCONFU;        
 ELSE JSM037.LIGNI(IND) = ' - Pour delit de fuite          : ' !!        
                          SCENARIO_10.CDCONFU;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN        
      JSM037.LIGNI(IND) = ' Nombre de d{ch{ance du permis  : ' !!        
                          SCENARIO_10.NBDEPER;        
 ELSE JSM037.LIGNI(IND) = ' Nombre de decheance du permis  : ' !!        
                          SCENARIO_10.NBDEPER;        
 IND = IND + 1;        
         
 IF SPA.CDPGTRN = '5' THEN        
      JSM037.LIGNI(IND) = ' Nombre de sinistres survenus au cours' !!        
                          ' des cinq derni}res ann{es en :';        
 ELSE JSM037.LIGNI(IND) = ' Nombre de sinistres survenus au cours' !!        
                          ' des cinq dernieres annees en :';        
 IND = IND + 1;        
         
 IF SPA.CDPGTRN = '5' THEN        
      JSM037.LIGNI(IND) = ' - Responsabilit{ civile        : ' !!        
                            SCENARIO_5.NBSINIS;        
 ELSE JSM037.LIGNI(IND) = ' - Responsabilite civile        : ' !!        
                            SCENARIO_5.NBSINIS;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Vol / Incendie               : ' !!        
                     SCENARIO_10.NBSINVO;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN        
      JSM037.LIGNI(IND) = ' - D{gts mat{riels             : ' !!        
                          SCENARIO_10.NBSINDM;        
 ELSE JSM037.LIGNI(IND) = ' - Degts materiels             : ' !!        
                          SCENARIO_10.NBSINDM;        
 IND = IND + 1;#############################        
         
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN        
      W_CHAIN = ' Usage professionnel du v{hicule         :';        
 ELSE W_CHAIN = ' Usage professionnel du vehicule         :';        
 IF SCENARIO_5.CDUSAVH = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' OUI';        
   ELSE W_CHAIN = W_CHAIN !! ' NON';        
 JSM037.LIGNI(IND) = W_CHAIN;        
         
 IND = IND + 1;        
 INTER_F15 = SCENARIO_5.NBKMPAN;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V00$',0,10);        
 JSM037.LIGNI(IND) = ' Nombre de Km/ an                        :'        
                   !!  INTER_C10;        
         
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Bonus-malus calcule                     :'        
                   !!  SCENARIO_6.CDBMDET;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Code cible client                       :'        
                   !!  SCENARIO_6.CDCIBCL;        
 IND = IND + 1;        
         
 IND = IND + 1;        
         
 W_CHAIN = ' Autres conducteur(s) de moins de 26 ans :';        
 IF SCENARIO_5.CDCDC26 = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' OUI';        
   ELSE W_CHAIN = W_CHAIN !! ' NON';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) = ' ========================================= ';        
 IF SCENARIO_11.LTNMHA1 ^= '' THEN        
   DO;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' NOM (1)                       : '        
                         !! SCENARIO_11.LTNMHA1;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' PRENOM                        : '        
                         !! SCENARIO_11.LTPRHA1;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' DATE DE NAISSANCE             : '        
                         !! SUBSTR(SCENARIO_11.DANAIS1,1,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS1,3,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS1,5,4);        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' DATE DE DELIVRANCE DU PERMIS  : '        
                         !! SCENARIO_11.ANPERM1;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' QUALITE PAR RAPPORT AU PRENEUR: '        
                         !! SCENARIO_11.LTQUHA1;        
   END;        
 IF SCENARIO_11.LTNMHA2 ^= '' THEN        
   DO;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' NOM (2)                       : '        
                         !! SCENARIO_11.LTNMHA2;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' PRENOM                        : '        
                         !! SCENARIO_11.LTPRHA2;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' DATE DE NAISSANCE             : '        
                         !! SUBSTR(SCENARIO_11.DANAIS2,1,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS2,3,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS2,5,4);        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' DATE DE DELIVRANCE DU PERMIS  : '        
                         !! SCENARIO_11.ANPERM2;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' QUALITE PAR RAPPORT AU PRENEUR: '        
                         !! SCENARIO_11.LTQUHA2;        
   END;        
 IF SCENARIO_11.LTNMHA3 ^= '' THEN        
   DO;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' NOM (3)                       : '        
                         !! SCENARIO_11.LTNMHA3;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' PRENOM                        : '        
                         !! SCENARIO_11.LTPRHA3;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' DATE DE NAISSANCE             : '        
                         !! SUBSTR(SCENARIO_11.DANAIS3,1,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS3,3,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS3,5,4);        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' DATE DE DELIVRANCE DU PERMIS  : '        
                         !! SCENARIO_11.ANPERM3;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' QUALITE PAR RAPPORT AU PRENEUR: '        
                         !! SCENARIO_11.LTQUHA3;        
   END;        
 IND = IND + 1;        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) = ' CARACTERISTIQUE DU VEHICULE :';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' =========================== ';        
 IND = IND + 1;        
 INTER_P7 = SCENARIO_1.NOIDTYP;        
 JSM037.LIGNI(IND) = ' N Eurotax: ' !! INTER_C7;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Marque    : ' !! SCENARIO_1.LTMARQU;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' Mod}le    : ' !! SCENARIO_1.LTMODEL;        
 ELSE JSM037.LIGNI(IND) = ' Modele    : ' !! SCENARIO_1.LTMODEL;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Type      : ' !! SCENARIO_1.LTTYPEV;        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) = ' Plaque    : ' !! SCENARIO_12.NUPLQVH !!        
                     '      Chassis   : ' !! SCENARIO_12.LTCHAVH;        
 IND = IND + 1;        
         
 INTER_P3 = SCENARIO_1.NBTYPKW;        
 IF SPA.CDPGTRN = '5' THEN        
      JSM037.LIGNI(IND) = ' Cylindr{e : '!! INTER_P3 !!        
                          '          Ann{e de construction : '!!        
                          SCENARIO_1.ANNCSTR;        
 ELSE JSM037.LIGNI(IND) = ' Cylindree : '!! INTER_P3 !!        
                          '          Annee de construction : '!!        
                          SCENARIO_1.ANNCSTR;        
 IND = IND + 1;        
         
 IF SPA.CDPGTRN = '5' THEN        
      JSM037.LIGNI(IND) = ' Cat{gorie Omnium Ethias     : ' !!        
                          SCENARIO_1.CDTYOP3;        
 ELSE JSM037.LIGNI(IND) = ' Categorie Omnium Ethias     : ' !!        
                          SCENARIO_1.CDTYOP3;        
         
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN        
      JSM037.LIGNI(IND) = ' Cat{gorie DM  Ethias        : ' !!        
                          SCENARIO_1.CDTYDM3;        
 ELSE JSM037.LIGNI(IND) = ' Categorie DM  Ethias        : ' !!        
                          SCENARIO_1.CDTYDM3;        
         
 IND = IND + 1;        
 INTER_Z3 = SCENARIO_1.NBRTRAN;        
 JSM037.LIGNI(IND) = ' Nombre de passagers         : ' !! INTER_Z3;        
 IND = IND + 1;        
 W_CHAIN = ' Type de carburant           : ' !! SCENARIO_1.LTCARBU;        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 INTER_F15 = SCENARIO_5.VACATVH * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 JSM037.LIGNI(IND) =' Valeur catalogue   (HTVA)   :' !! INTER_C10;        
 IND = IND + 1;        
         
 IF SCENARIO_1.CDECOV2 = '1' THEN        
   DO;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          JSM037.LIGNI(IND) =' V{hicule hybride/{lectrique : Oui';        
     ELSE JSM037.LIGNI(IND) =' Vehicule hybride/electrique : Oui';        
     IND = IND + 1;        
   END;        
         
 IF SPA.CDPGTRN = '5'        
  THEN W_CHAIN =' V{hicule d'' occasion de plus de 2 ans :';        
  ELSE W_CHAIN =' Vehicule d'' occasion de plus de 2 ans :';        
 IF SCENARIO_5.BOVHOCC = 'Y'        
   THEN W_CHAIN = W_CHAIN !! 'Oui';        
   ELSE W_CHAIN = W_CHAIN !! 'Non';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 IND = IND + 1;        
         
 W_CHAIN = ' GARANTIES';        
 IF SCENARIO_8.CDSTART = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' : CONDITIONS STARTER ';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 W_CHAIN = ' =========';        
 IF SCENARIO_8.CDSTART = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' : ================== ';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 W_MTTOTAL=0;        
         
 IF SCENARIO_6.SELECT_GAR.CDSERCI = 'Y' THEN        
   DO;        
     IF SPA.CDPGTRN = '5'        
       THEN JSM037.LIGNI(IND) = ' - Responsabilit{ civile';        
       ELSE JSM037.LIGNI(IND) = ' - Responsabilite civile';        
         
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
         SUBSTR(JSM037.LIGNI(IND),26) = ' ( -15%)';        
         INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGARCI * 100;        
       END;        
     ELSE INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGARCI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
         
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
         
 IF SCENARIO_6.SELECT_GAR.CDSECAS = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Protection juridique';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACAS * 100;        
         
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
 IF SCENARIO_6.SELECT_GAR.CDSECA1 = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Protection juridique plus';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACA1 * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
         
 IF SCENARIO_6.SELECT_GAR.CDSEASS = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Assurance conducteur';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAASS * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
         
 /*TYPE OMNIUM */        
 SELECT;        
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '1' ) ####################        
  DO;        
    JSM037.LIGNI(IND) = ' - Mini Omnium';        
    IF SCENARIO_6.CDPROMO ^= '' THEN        
      DO;        
        SUBSTR(JSM037.LIGNI(IND),26) = ' ( -10%)';        
        INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM1 * 100;        
      END;        
    ELSE INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAOM1 * 100;        
         
    INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
    SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
    IND = IND + 1;        
         
    W_MTTOTAL = W_MTTOTAL + INTER_F15;        
  END;        
         
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '2' ) ######################        
  DO;        
    JSM037.LIGNI(IND) = ' - Mini Omnium Plus';        
    IF SCENARIO_6.CDPROMO ^= '' THEN        
      DO;        
        SUBSTR(JSM037.LIGNI(IND),26) = ' ( -10%)';        
        INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM2 * 100;        
      END;        
    ELSE INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAOM2 * 100;        
         
    INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
    SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
    IND = IND + 1;        
    W_MTTOTAL = W_MTTOTAL + INTER_F15;        
  END;        
         
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '3' ) ####################        
  DO;        
    IF SPA.CDPGTRN = '5'        
      THEN W_CHAIN = ' - Omnium ';        
      ELSE W_CHAIN = ' - Omnium ';        
    SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
      WHEN('1') DO;        
        W_CHAIN1 =  '(0 - 450 Euros) ';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
          DO;        
            INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM3 * 100;        
          END;        
        ELSE        
          DO;        
            INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM3 * 100;        
          END;        
      END;        
      WHEN('2') DO;        
        W_CHAIN1 = '(450 - 900 Euros)';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
          DO;        
            INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM3 * 100;        
          END;        
        ELSE        
          DO;        
            INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM3 * 100;        
          END;        
      END;        
      WHEN('3') DO;        
        W_CHAIN1 = '(900 - 1350 Euros)';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
          DO;        
            INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM3 * 100;        
          END;        
        ELSE        
          DO;        
            INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM3 * 100;        
          END;        
      END;        
      OTHER INTER_F15 = 0;        
    END;        
    IF SCENARIO_6.CDPROMO ^= '' THEN        
      DO;        
        W_CHAIN1 = W_CHAIN1 !! ' ( -10%)';        
      END;        
         
    W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         
    JSM037.LIGNI(IND) = W_CHAIN !! W_CHAIN1;        
    INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
    SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
    IND = IND + 1;        
  END;        
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '4' ) #####################        
  DO;        
   IF SPA.CDPGTRN = '5'        
     THEN W_CHAIN = ' - Omnium Plus ';        
     ELSE W_CHAIN = ' - Omnium Plus ';        
         
   SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
     WHEN('1') DO;        
       W_CHAIN1 = '(0 - 450 Euros) ';        
       IF SCENARIO_6.CDPROMO ^= '' THEN        
         DO;        
           INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM4 * 100;        
         END;        
       ELSE        
         DO;        
           INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM4 * 100;        
         END;        
     END;        
     WHEN('2') DO;        
       W_CHAIN1 = '(450 - 900 Euros) ';        
       IF SCENARIO_6.CDPROMO ^= '' THEN        
         DO;        
           INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM4 * 100;        
         END;        
       ELSE        
         DO;        
           INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM4 * 100;        
         END;        
     END;        
     WHEN('3') DO;        
       W_CHAIN1 = '(900 - 1350 Euros) ';        
       IF SCENARIO_6.CDPROMO ^= '' THEN        
         DO;        
           INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM4 * 100;        
         END;        
       ELSE        
         DO;        
           INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM4 * 100;        
         END;        
     END;        
     OTHER INTER_F15 = 0;        
   END;        
   IF SCENARIO_6.CDPROMO ^= '' THEN        
     DO;        
       W_CHAIN1 = W_CHAIN1 !! ' ( -10%)';        
     END;        
         
   W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         
   JSM037.LIGNI(IND) = W_CHAIN !! W_CHAIN1;        
   INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
   SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
   IND = IND + 1;        
  END;        
  OTHER;        
 END;        
         
 /*mobilite plus */        
 IF SCENARIO_6.SELECT_GAR.CDSEMOB = 'Y'        
   THEN DO;        
         JSM037.LIGNI(IND) = ' - Mobility Maxi       ';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAMOB* 100;        
         
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
         
 IF SCENARIO_6.SELECT_GAR.CDSEMO1 = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Mobility Maxi privilege ';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAMO1* 100;        
         
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
         
 IF SCENARIO_5.CDASTMC = 'Y'        
   THEN DO;        
          INTER_F15 = SCENARIO_1.TAXETMC  * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          IF SPA.CDPGTRN = '5'        
            THEN JSM037.LIGNI(IND) =' ( Montant de la taxe ' !!        
                                  ' @ l'' immatriculation assur{e:'        
                                  !! INTER_C10 !! ' )';        
            ELSE JSM037.LIGNI(IND) =' ( Montant de la taxe ' !!        
                                  ' e l'' immatriculation assuree:'        
                                  !! INTER_C10 !! ' )';        
        END;        
         
 IND = IND + 1;        
 IND = IND + 1;        
 INTER_C10 = F_MTFTC(W_MTTOTAL,'$BBBZ07V02$',2,10);        
 JSM037.LIGNI(IND) = ' === TOTAL === ';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
         
 /* Pas de jeunes pour affinity ... */        
 IF SCENARIO_5.CDJEUNE = '1' THEN        
   DO;        
     JSM037.LIGNI(IND) =' --- TARIF JEUNE ---';                                 
     IND = IND + 1;        
         
     IF SPA.CDPGTRN = '5' THEN ##############################        
          JSM037.LIGNI(IND) = ' Sinistres en tort en DM ' !!        
                              ' end{ans les 3 derni}res ann{es';        
     ELSE JSM037.LIGNI(IND) = ' Sinistres en tort en DM ' !!        
                              ' endeans les 3 dernieres annees';        
     SUBSTR(JSM037.LIGNI(IND),70) = '-> ' !! SCENARIO_8.NBSINDM;                
     IND = IND + 1;        
     IF SPA.CDPGTRN = '5' THEN        
          JSM037.LIGNI(IND) = ' R{sidez-vous avec vos parents a' !!        
                            'ssur{s en auto chez Ethias (BM <= 6)';        
     ELSE JSM037.LIGNI(IND) = ' Residez-vous avec vos parents a' !!        
                            'ssures en auto chez Ethias (BM <= 6)';        
     IF SCENARIO_8.CDJEUFA = '1'        
       THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> OUI';        
       ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NON';        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Etes-vous titulaire d''au moins' !!        
                         ' 2 autres polices chez Ethias';        
     IF SCENARIO_8.CDTY2PO = '1'        
       THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> OUI';        
       ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NON';        
     IND = IND + 1;        
         
     IF SCENARIO_5.AGEPREN < 26 THEN        
       DO;        
         IF SPA.CDPGTRN = '5' THEN ##############################        
              JSM037.LIGNI(IND) = ' Avez-vous r{ussi un stage' !!        
                                  ' de conduite d{fensive FEBIC';        
         ELSE JSM037.LIGNI(IND) = ' Avez-vous reussi un stage' !!        
                                  ' de conduite defensive FEBIC';        
         IF SCENARIO_8.CDSTACO = '1'        
           THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> OUI';        
           ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NON';        
         IND = IND + 1;        
         
         IF SPA.CDPGTRN = '5' THEN ##############################        
              JSM037.LIGNI(IND) = ' Avez-vous un enfant @ charge';        
         ELSE JSM037.LIGNI(IND) = ' Avez-vous un enfant e charge';        
         IF SCENARIO_8.CDENFCH = '1'        
           THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> OUI';        
           ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NON';        
         IND = IND + 1;        
       END;        
   END;        
         
 JSM037.LIGNI(IND) =' Date d''effet de la garantie R.C.   : ' !!        
                      SUBSTR(SCENARIO_12.DAEFFRC,1,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFRC,3,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFRC,5,4);        
 IND = IND + 1;        
 JSM037.LIGNI(IND) =' Date d''effet des garanties annexes : ' !!        
                      SUBSTR(SCENARIO_12.DAEFFAU,1,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFAU,3,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFAU,5,4);        
 JSM037.NBLIGNI = IND;        
         
         
     TRACE = 'GA2016C ===> ' !! 'END FC_31';        
         
     CALL PT;        
 $END FC_31;        
 /*-----------------------------------------------*/        
 /*-----------------------------------------------*/        
 FC_312: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_312';        
         
     CALL PT;        
 /**********************************************************        
 * UPDATE DB : MESSAGE LETTRE FRANCOPHONE DETAILS REMORQUE *        
 **********************************************************/        
 JSM037.LTMESSA = 'CONTRAT AUTO : DETAILS REMORQUE';        
         
 JSM037.LIGNI(*) = '';        
 JSM037.LIGNI(1) = ' SOUSCRIPTION d''un contrat assurance ' !!        
                   'auto - Devis (suite): ' !! SPAVAR.DEVISAF;        
 IND = 2;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' PRENEUR D''ASSURANCE : Affili{ Ethias N '        
                        !! JS1003.NOIDAFO;        
 ELSE JSM037.LIGNI(IND) = ' PRENEUR D''ASSURANCE : Affilie Ethias N '        
                        !! JS1003.NOIDAFO;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' ====================';        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) =' *** CARACTERISTIQUE DE LA REMORQUE OU DE LA'              
                 !! ' CARAVANE ***';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Marque';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_7.LTMARRM;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Plaque';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_12.NUPLQRM;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Chassis';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_12.LTCHARM;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' Ann{e de construction ';        
 ELSE JSM037.LIGNI(IND) = ' Annee de construction ';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_7.ANCSTRM;        
 IND = IND + 1;        
 IF SPA.CDPGTRN = '5' THEN ##############################        
      JSM037.LIGNI(IND) = ' Valeur catalogue {tat neuf (HTVA)';        
 ELSE JSM037.LIGNI(IND) = ' Valeur catalogue etat neuf (HTVA)';        
 INTER_F15 = SCENARIO_7.MTCATRM * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Valeur actuelle (si > 5 ans) (HTVA)';        
 INTER_F15 = SCENARIO_7.MTACTRM * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Poids (Kg)';        
 INTER_Z5 = SCENARIO_7.NUPDSRM;        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_Z5;        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) =' *** GARANTIES ***';                                       
 IND = IND + 1;        
         
 W_MTTOTAL = 0;        
         
 IF SCENARIO_6.SELECT_GAR.CDRMRCI = 'Y' THEN        
   DO;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          JSM037.LIGNI(IND) = ' - Responsabilit{ civile';        
     ELSE JSM037.LIGNI(IND) = ' - Responsabilite civile';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMRCI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMVO1 = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Vol';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMVO1 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMIN1 = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Incendie ';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMIN1 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMBRI = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Bris de vitres';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMBRI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMDM4 = 'Y' THEN        
   DO;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          JSM037.LIGNI(IND) = ' - Mini d{gts mat{riels';        
     ELSE JSM037.LIGNI(IND) = ' - Mini degts materiels';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM4 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMDM3 = 'Y' THEN        
   DO;        
     IF SPA.CDPGTRN = '5' THEN ##############################        
          JSM037.LIGNI(IND) = ' - D{gts mat{riels';        
     ELSE JSM037.LIGNI(IND) = ' - Degts materiels';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM3 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 JSM037.LIGNI(IND) = ' *** TOTAL ***';        
 INTER_C10 = F_MTFTC(W_MTTOTAL,'$BBBZ07V02$',2,10);        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
         
 JSM037.NBLIGNI = IND;        
 /* PUT SKIP LIST('Nombre de lignes dans la lettre = ',IND); */        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_312';        
         
     CALL PT;        
 $END FC_312;        
 /*-----------------------------------------------*/        
 FC_32: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_32';        
         
     CALL PT;        
         
 /**********************************************************        
 * UPDATE DB : MESSAGE LETTRE EN NEERLANDAIS SUR LE S1GSI  *        
 **********************************************************/        
 JSM037.LTMESSA = 'AUTOPOLIS VIA INTERNET ';        
         
 JSM037.LIGNI(*) = '';        
 JSM037.LIGNI(1) = ' INSCHRIJVING van een verzekeringspolis ' !!        
                   'auto - Offerte : ' !! SPAVAR.DEVISAF;        
 IND = 2;        
 IF INFOS_USER.CDAFGRP ^= '' THEN        
   DO;        
     JSM037.LIGNI(IND) =' Affinity Groep   : ' !!                               
                        INFOS_USER.CDAFGRP !! ' ' !! LIBELAFF;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) =' Nr identificatie : ' !! IDENTAFF;                     
     IND = IND + 1;        
   END;        
         
 SELECT;        
   WHEN(SCENARIO_5.BOAUTCP='N') DO;        
     JSM037.LIGNI(IND) = ' Eerste inschrijving ';        
     IND = IND + 1;        
   END;        
   WHEN(SCENARIO_5.BOAUTCP='Y') DO;        
     JSM037.LIGNI(IND) = ' Risico gedekt door een andere maatschappij';        
     IND = IND + 1;        
     CALL LECT_CPIE(SCENARIO_9.NUMCPIE,LIBTXT);        
     JSM037.LIGNI(IND) = ' Naam maatschappij :'  !! LIBTXT;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Polisnummer       :' !!        
                         SCENARIO_9.NOIDPOC;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Hoofdvervaldag van de polis B.A. :'        
         !! SUBSTR(SCENARIO_9.DAECHRC,1,2) !! '/'        
         !! SUBSTR(SCENARIO_9.DAECHRC,3,2) !! '/'        
         !! SUBSTR(SCENARIO_9.DAECHRC,5,4);        
     IND = IND + 1;        
     IF SCENARIO_9.CDRESRI='Y' THEN        
       DO;        
         SELECT(SCENARIO_9.CDTYPRE);        
           WHEN('1') DO;        
             JSM037.LIGNI(IND)=' Polis opgezegd door de verzeke'!!        
                              'ringsnemer';        
             IND = IND + 1;        
           END;        
           WHEN('2') DO;        
             JSM037.LIGNI(IND)=' Polis opgezegd door de maatsc'!!        
                          'happij';        
             IND = IND + 1;        
           END;        
           WHEN('3') DO;        
             JSM037.LIGNI(IND)='Polis opgezegd met gemeen'!!        
                             ' akkoord';        
             IND = IND + 1;        
           END;        
           OTHER;        
         END;        
         CALL LECT_SMRS(SCENARIO_9.NUMSMRS,LIBTXT);        
         JSM037.LIGNI(IND) = ' Reden : ' !! LIBTXT;        
         IND = IND + 1;        
       END;        
     ELSE        
       JSM037.LIGNI(IND)=' De polis van het risico werd niet opgezegd';        
       IND = IND + 1;        
   END;        
   OTHER;        
 END;        
 JSM037.LIGNI(IND) = ' VERZEKERINGSNEMER: AANGESLOTENE ETHIAS NUMMER '!!        
                   JS1003.NOIDAFO;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' =================';        
 IND = IND + 1;        
         
 W_CHAIN = SUBSTR(SPAVAR.IDENTI.DANAIAF,1,2) !! '/' !!        
           SUBSTR(SPAVAR.IDENTI.DANAIAF,3,2) !! '/' !!        
           SUBSTR(SPAVAR.IDENTI.DANAIAF,5,4);        
 SELECT (SPAVAR.IDENTI.CDRSAFF);        
   WHEN('1') #################        
     DO;        
       JSM037.LIGNI(IND) = ' Mijnheer, ' !!        
              TRIM(SPAVAR.IDENTI.LTNMAFF) !! ' ' !!        
              TRIM(SPAVAR.IDENTI.LTPRAFF);        
       IND = IND + 1;        
       JSM037.LIGNI(IND) = ' Geboren op : ' !! W_CHAIN;        
       IND = IND + 1;        
     END;        
   WHEN('2') #################        
     DO;        
       JSM037.LIGNI(IND) = ' Mevrouw, ' !!        
              TRIM(SPAVAR.IDENTI.LTNMAFF) !! ' ' !!        
              TRIM(SPAVAR.IDENTI.LTPRAFF);        
       IND = IND + 1;        
       JSM037.LIGNI(IND) = ' Geboren op : ' !! W_CHAIN;        
       IND = IND + 1;        
     END;        
   WHEN('3') ##################        
     DO;        
       JSM037.LIGNI(IND) = ' Juffrouw, ' !!        
              TRIM(SPAVAR.IDENTI.LTNMAFF) !! ' ' !!        
              TRIM(SPAVAR.IDENTI.LTPRAFF);        
       IND = IND + 1;        
       JSM037.LIGNI(IND) = ' Geboren op : ' !! W_CHAIN;        
       IND = IND + 1;        
     END;        
   OTHER;        
 END;        
 JSM037.LIGNI(IND) = ' Echtgenoot :' !! SCENARIO_10.LTNOMCO !! ' ' !!        
                     SCENARIO_10.LTPRECO;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Geboren op : '        
                     !!        SUBSTR(SCENARIO_10.DANAICO,1,2)        
                     !! '/' !! SUBSTR(SCENARIO_10.DANAICO,3,2)        
                     !! '/' !! SUBSTR(SCENARIO_10.DANAICO,5,4);        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Adres verzekeringsnemer :';        
 IND = IND + 1;        
 INTER_F4 = SPAVAR.IDENTI.NOHA1AF;        
 INTER_Z4 = INTER_F4;        
 JSM037.LIGNI(IND) = ' Straat        : ' !!        
                     SPAVAR.IDENTI.LTRUEAF !!        
                     '  Nummer   : ' !! INTER_Z4 !!        
                     '   Bus   : ' !!        
                     SPAVAR.IDENTI.NOHA2AF;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Postcode      : ' !! SPAVAR.IDENTI.CDCPOAF !!        
  '                     Gemeente :' !! SPAVAR.IDENTI.LTLOCAF;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' E-mail adres  : '!! SPAVAR.IDENTI.EMAILAF;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Beroep        : ' !! SCENARIO_5.CDTYPRO !!        
                     ' ' !! TRIM(LTPROPR_W);        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Activiteit    : ' !! SCENARIO_5.CDGEPRO !!        
                     ' ' !! TRIM(LTACTIV_W);        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Werkgever     : ' !! SCENARIO_10.LTEMPPR;        
 IND = IND + 1;        
         
 W_CHAIN = ' Werkt in de HORECA sector   : ';        
 IF SCENARIO_5.BOHOREC ='Y'        
   THEN W_CHAIN = W_CHAIN !! 'Ja';        
   ELSE W_CHAIN = W_CHAIN !! 'Nee';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 INTER_C8 = SCENARIO_5.DAPERMI;        
 W_CHAIN  = ' Jaar van afgifte rijbewijs  : '        
                     !!        SUBSTR(INTER_C8,1,2)        
                     !! '/' !! SUBSTR(INTER_C8,3,2)        
                     !! '/' !! SUBSTR(INTER_C8,5,4);        
 SELECT(SCENARIO_10.CDTYPPR);        
   WHEN('1')        
     JSM037.LIGNI(IND) = W_CHAIN !! '  ' !!        
                         ' Type rijbewijs : Belgisch';        
   WHEN('2')        
     JSM037.LIGNI(IND) = W_CHAIN !! '  ' !!        
                         ' Type rijbewijs : Internationaal';        
   WHEN('3')        
     JSM037.LIGNI(IND) = W_CHAIN !! '  ' !!        
                         ' Type rijbewijs : Buitenlands';        
   OTHER;        
 END;        
         
 INTER_P2 = SCENARIO_5.AGEPERM;        
 INTER_Z2 = INTER_P2;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Aantal jaren rijervaring    : ' !! INTER_Z2;        
 IND = IND + 1;        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) = ' Veroordelingen hoofdbestuurder in de laatste '!!        
                     'vijf jaren :';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Voor alcoholintoxicatie      : ' !!        
                     SCENARIO_10.CDCONAL;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Dronkenschap aan het stuur   : ' !!        
                     SCENARIO_10.CDCONIV;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Voor vluchtmisdrijf          : ' !!        
                     SCENARIO_10.CDCONFU;        
 IND = IND + 1;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Aantal intrekkinggen van het rijbewijs i' !!        
                     'n de laatste vijf jaren : ' !!        
                          SCENARIO_10.NBDEPER;        
         
 IND = IND + 1;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Aantal schadegevallen veroorzaakt in de '!!        
                     'laatste vijf jaren voor : ';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Burgerlijke aansprakelijkheid: ' !!        
                       SCENARIO_5.NBSINIS;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Diefstal / Brand             : ' !!        
                     SCENARIO_10.NBSINVO;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' - Materile schade             : ' !!        
                     SCENARIO_10.NBSINDM;        
 IND = IND + 1;        
 W_CHAIN = ' Beroepsgebruik van het voertuig      : ';        
 IF SCENARIO_5.CDUSAVH = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' JA';        
   ELSE W_CHAIN = W_CHAIN !! ' NEE';        
 JSM037.LIGNI(IND) = W_CHAIN;        
         
 IND = IND + 1;        
 INTER_F15 = SCENARIO_5.NBKMPAN;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V00$',0,10);        
 JSM037.LIGNI(IND) = ' Aantal jaarlijkse kilometers         : '        
                   !!  INTER_C10;        
         
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Berekende Bonus-malus                : '        
                   !!  SCENARIO_6.CDBMDET;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Code klantengroep                    : '        
                   !!  SCENARIO_6.CDCIBCL;        
 IND = IND + 1;        
         
 IND = IND + 1;        
 W_CHAIN = ' Andere bestuurder jonger dan 26 jaar : ';        
 IF SCENARIO_5.CDCDC26 = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' JA';        
   ELSE W_CHAIN = W_CHAIN !! ' NEE';        
 JSM037.LIGNI(IND) = W_CHAIN;        
         
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' ====================================== ';        
 IF SCENARIO_11.LTNMHA1 ^= '' THEN        
   DO;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Naam (1)                               : '        
                         !! SCENARIO_11.LTNMHA1;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Voornaam                               : '        
                         !! SCENARIO_11.LTPRHA1;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Geboortedatum                          : '        
                         !! SUBSTR(SCENARIO_11.DANAIS1,1,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS1,3,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS1,5,4);        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Datum van aflevering van het rijbewijs : '        
                         !! SCENARIO_11.ANPERM1;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Relatie met de verzekeringsnemer       : '        
                         !! SCENARIO_11.LTQUHA1;        
   END;        
 IF SCENARIO_11.LTNMHA2 ^= '' THEN        
   DO;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Naam (2)                               : '        
                         !! SCENARIO_11.LTNMHA2;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Voornaam                               : '        
                         !! SCENARIO_11.LTPRHA2;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Geboortedatum                          : '        
                         !! SUBSTR(SCENARIO_11.DANAIS2,1,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS2,3,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS2,5,4);        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Datum van aflevering van het rijbewijs : '        
                         !! SCENARIO_11.ANPERM2;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Relatie met de verzekeringsnemer       : '        
                         !! SCENARIO_11.LTQUHA2;        
   END;        
 IF SCENARIO_11.LTNMHA3 ^= '' THEN        
   DO;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Naam (3)                               : '        
                         !! SCENARIO_11.LTNMHA3;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Voornaam                               : '        
                         !! SCENARIO_11.LTPRHA3;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Geboortedatum                          : '        
                         !! SUBSTR(SCENARIO_11.DANAIS3,1,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS3,3,2) !! '/'        
                         !! SUBSTR(SCENARIO_11.DANAIS3,5,4);        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Datum van aflevering van het rijbewijs : '        
                         !! SCENARIO_11.ANPERM3;        
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Relatie met de verzekeringsnemer       : '        
                         !! SCENARIO_11.LTQUHA3;        
   END;        
         
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' EIGENSCHAPPEN VAN HET VOERTUIG :';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' ============================== ';        
 IND = IND + 1;        
 INTER_P7 = SCENARIO_1.NOIDTYP;        
 JSM037.LIGNI(IND) = ' Eurotax Nummer : ' !! INTER_C7;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Merk           : ' !! SCENARIO_1.LTMARQU;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Model          : ' !! SCENARIO_1.LTMODEL;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Type           : ' !! SCENARIO_1.LTTYPEV;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Nummerplaat    : ' !! SCENARIO_12.NUPLQVH !!        
                     '  Chassisnummer : ' !! SCENARIO_12.LTCHAVH;        
 IND = IND + 1;        
         
 INTER_P3 = SCENARIO_1.NBTYPKW;        
 JSM037.LIGNI(IND) = ' Cylinderinhoud :' !! INTER_P3 !!        
                     '       Bouwjaar      : '!!        
                     SCENARIO_1.ANNCSTR;        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) = ' Categorie SS Ethias         : ' !!        
                          SCENARIO_1.CDTYOP3;        
         
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Categorie Omnium Ethias     : '        
                   !! SCENARIO_1.CDTYDM3;        
         
 IND = IND + 1;        
 INTER_Z3 = SCENARIO_1.NBRTRAN;        
 JSM037.LIGNI(IND) = ' Aantal passagiers           : '        
                     !! INTER_Z3;        
 IND = IND + 1;        
         
 W_CHAIN = ' Brandstof                   : ';        
 W_CHAIN = W_CHAIN !! SCENARIO_1.LTCARBU;        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 INTER_F15 = SCENARIO_5.VACATVH * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 JSM037.LIGNI(IND) =' Nieuwwaarde (EBTW)          : '        
                    !! INTER_C10;        
 IND = IND + 1;        
         
 W_CHAIN =' Hybride of electrisch voertuig         : ';        
 IF SCENARIO_1.CDECOV2 = '1'        
   THEN W_CHAIN = W_CHAIN !! 'Ja';        
   ELSE W_CHAIN = W_CHAIN !! 'Nee';        
 JSM037.LIGNI(IND)= W_CHAIN;        
         
 IND = IND + 1;        
         
 W_CHAIN =' Tweedehandsvoertuig ouder dan 2 jaar   : ';        
 IF SCENARIO_5.BOVHOCC ='Y'        
   THEN W_CHAIN = W_CHAIN !! 'Ja';        
   ELSE W_CHAIN = W_CHAIN !! 'Nee';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 IND = IND + 1;        
 W_CHAIN = ' WAARBORG';        
 IF SCENARIO_8.CDSTART = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' : STARTERSCONTRACT 29/29';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
 W_CHAIN = ' ========';        
 IF SCENARIO_8.CDSTART = 'Y'        
   THEN W_CHAIN = W_CHAIN !! ' : ======================';        
 JSM037.LIGNI(IND) = W_CHAIN;        
 IND = IND + 1;        
         
 W_MTTOTAL=0;        
 IF SCENARIO_6.SELECT_GAR.CDSERCI = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Burgerlijke aansprakelijkheid ';        
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
         SUBSTR(JSM037.LIGNI(IND),35) = '(-15%)';        
         INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGARCI * 100;        
       END;        
     ELSE INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGARCI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
         
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDSECAS = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Rechtsbijstand ';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACAS * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
 IF SCENARIO_6.SELECT_GAR.CDSECA1 = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Rechtsbijstand Plus ';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACA1 * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
 IF SCENARIO_6.SELECT_GAR.CDSEASS = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Verzekering bestuurder :';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAASS * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
         
 /*TYPE OMNIUM */        
 SELECT;        
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '1' ) ####################        
  DO;        
     JSM037.LIGNI(IND) = ' - Mini Omnium';        
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
         SUBSTR(JSM037.LIGNI(IND),17) = '(-15%)';        
         INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM1 * 100;        
       END;        
     ELSE INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAOM1 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
         
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
         
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '2' ) ######################        
  DO;        
     JSM037.LIGNI(IND) = ' - Mini Omnium Plus';        
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
         SUBSTR(JSM037.LIGNI(IND),17) = '(-15%)';        
         INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM2 * 100;        
       END;        
     ELSE INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAOM2 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
         
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
  END;        
         
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '3' ) ####################        
  DO;        
    W_CHAIN = '- Omnium vrijstelling';        
    SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
      WHEN('1') DO;        
        W_CHAIN1 = '(0 - 450 Euros) ';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM3 * 100;        
        ELSE        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM3 * 100;        
      END;        
      WHEN('2') DO;        
        W_CHAIN1 = '(450 - 900 Euros) ';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM3 * 100;        
        ELSE        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM3 * 100;        
      END;        
      WHEN('3') DO;        
        W_CHAIN1 = '(900 - 1350 Euros) ';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM3 * 100;        
        ELSE        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM3 * 100;        
      END;        
      OTHER INTER_F15 = 0;        
    END;        
    IF SCENARIO_6.CDPROMO ^= ''        
      THEN W_CHAIN1 = W_CHAIN1 !! ' (-10%)';        
         
    W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         
    JSM037.LIGNI(IND) = W_CHAIN !! W_CHAIN1;        
    INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
    SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
    IND = IND + 1;        
  END;        
  WHEN(SCENARIO_6.SELECT_GAR.CDTYPOM = '4' ) #####################        
  DO;        
    W_CHAIN = ' - Omnium Plus vrijstelling';        
    SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
      WHEN('1') DO;        
        W_CHAIN1 = '(0 - 450 Euros) ';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM4 * 100;        
        ELSE        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM4 * 100;        
      END;        
      WHEN('2') DO;        
        W_CHAIN1 = '(450 - 900 Euros) ';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM4 * 100;        
        ELSE        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM4 * 100;        
      END;        
      WHEN('3') DO;        
        W_CHAIN1 = '(900 - 1350 Euros) ';        
        IF SCENARIO_6.CDPROMO ^= '' THEN        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM4 * 100;        
        ELSE        
         INTER_F15 =        
            SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM4 * 100;        
      END;        
      OTHER INTER_F15 = 0;        
    END;        
    IF SCENARIO_6.CDPROMO ^= ''        
      THEN W_CHAIN1 = W_CHAIN1 !! ' (-10%)';        
         
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         
     JSM037.LIGNI(IND) = W_CHAIN !! W_CHAIN1;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
   END;        
   OTHER;        
 END;        
         
 /*mobilite plus plein */        
 IF SCENARIO_6.SELECT_GAR.CDSEMOB = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - Mobility Maxi       ';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAMOB * 100;        
         
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
         
 /*mobilite privilege  */        
 IF SCENARIO_6.SELECT_GAR.CDSEMO1 = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' - MobilitY Maxi       ';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAMO1  * 100;        
         
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
          IND = IND + 1;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
        END;        
         
 IF SCENARIO_5.CDASTMC = 'Y'        
   THEN DO;        
          JSM037.LIGNI(IND) = ' (Waarde van de verzekerde B.I.V.';        
          INTER_F15 = SCENARIO_1.TAXETMC * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10 !! ')';        
        END;        
         
 IND = IND + 1;        
 INTER_C10 = F_MTFTC(W_MTTOTAL,'$BBBZ07V02$',2,10);        
 JSM037.LIGNI(IND) = ' === TOTAAL === ';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
         
         
 /* Pas de jeunes pour affinity ... */        
 IF SCENARIO_5.CDJEUNE = '1' THEN        
   DO;        
     JSM037.LIGNI(IND) =' === Jongeren tarief ===';                             
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Aantal schadegevallen tijdens' !!        
                ' de laatste 3 jaar in SS ';        
     SUBSTR(JSM037.LIGNI(IND),70) = '-> ' !! SCENARIO_8.NBSINDM;                
     IND = IND + 1;        
         
     JSM037.LIGNI(IND) = ' Woont u nog bij uw ouders, verzekerd'        
                      !! ' bij Ethias met BM <= 06';        
     IF SCENARIO_8.CDJEUFA = '1'                                                
       THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> JA';        
       ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NEE';                            
     IND = IND + 1;        
     JSM037.LIGNI(IND) = ' Bent u houder van nog tenminste' !!        
                         ' 2 andere polissen bij Ethias  ';        
     IF SCENARIO_8.CDTY2PO = '1'                                                
       THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> JA';        
       ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NEE';                            
     IND = IND + 1;        
         
     IF SCENARIO_5.AGEPREN < 26 THEN        
       DO;        
         JSM037.LIGNI(IND) = ' Bent u geslaagd voor een stage '!!        
                             ' defensief rijden FEBIR ';        
         IF SCENARIO_8.CDSTACO = '1'        
           THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> JA';        
           ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NEE';        
         IND = IND + 1;        
         
         JSM037.LIGNI(IND) = ' Hebt u kinderen ten laste ';        
         IF SCENARIO_8.CDENFCH = '1'        
           THEN SUBSTR(JSM037.LIGNI(IND),70) = '-> JA';        
           ELSE SUBSTR(JSM037.LIGNI(IND),70) = '-> NEE';        
         IND = IND + 1;        
       END;        
   END;        
         
 JSM037.LIGNI(IND) =' Aanvangsdatum waarborg B.A.         : ' !!        
                      SUBSTR(SCENARIO_12.DAEFFRC,1,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFRC,3,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFRC,5,4);        
 IND = IND + 1;        
 JSM037.LIGNI(IND) =' Aanvangsdatum bijkomende waarborgen : ' !!        
                      SUBSTR(SCENARIO_12.DAEFFAU,1,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFAU,3,2) !! '/' !!        
                      SUBSTR(SCENARIO_12.DAEFFAU,5,4);        
 JSM037.NBLIGNI = IND;        
 /* PUT SKIP LIST('Nombre de lignes dans la lettre = ',IND); */        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_32';        
         
     CALL PT;        
 $END FC_32;        
 /*-------------------------------------------------------------------*/        
 FC_322: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_322';        
         
     CALL PT;        
         
 /*************************************************************        
 * UPDATE DB : MESSAGE LETTRE EN NEERLANDAIS DETAILS REMORQUE *        
 *************************************************************/        
 JSM037.LTMESSA = 'AUTOPOLIS : DETAILS AANHANGWAGEN';        
         
 JSM037.LIGNI(*) = '';        
 JSM037.LIGNI(1) = ' INSCHRIJVING van een verzekeringspolis ' !!        
                   'auto - Offerte : ' !! SPAVAR.DEVISAF;        
 IND = 2;        
 JSM037.LIGNI(IND) = ' VERZEKERINGSNEMER: AANGESLOTENE ETHIAS NUMMER '!!        
                   JS1003.NOIDAFO;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' =================';        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) =' *** EIGENSCHAPPEN VAN DE AANHANGWAGEN '                   
                 !! ' OF CARAVAN ***';        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Merk';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_7.LTMARRM;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Nummerplaat';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_12.NUPLQRM;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Chassisnummer';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_12.LTCHARM;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Bouwjaar ';        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! SCENARIO_7.ANCSTRM;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Cataloguswaarde (EBTW)';        
 INTER_F15 = SCENARIO_7.MTCATRM * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Waarde voertuig (indien > 5 jaar) (EBTW)';        
 INTER_F15 = SCENARIO_7.MTACTRM * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
 JSM037.LIGNI(IND) = ' Gewicht (Kg)';        
 INTER_Z5 = SCENARIO_7.NUPDSRM;        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_Z5;        
 IND = IND + 1;        
         
 JSM037.LIGNI(IND) =' *** WAARBORG ***';                                        
 IND = IND + 1;        
 W_MTTOTAL = 0;        
 IF SCENARIO_6.SELECT_GAR.CDRMRCI = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Burgerlijke aansprakelijkheid';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMRCI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMVO1 = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Diefstal';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMVO1 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMIN1 = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Brand';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMIN1 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMBRI = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Glasbreuk';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMBRI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMDM4 = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Mini SS';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM4 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 IF SCENARIO_6.SELECT_GAR.CDRMDM3 = 'Y' THEN        
   DO;        
     JSM037.LIGNI(IND) = ' - Stoffelijke schade';        
     INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM3 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
     IND = IND + 1;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
   END;        
 JSM037.LIGNI(IND) = ' *** TOTAAL ***';        
 INTER_C10 = F_MTFTC(W_MTTOTAL,'$BBBZ07V02$',2,10);        
 SUBSTR(JSM037.LIGNI(IND),50) = ' : ' !! INTER_C10;        
 IND = IND + 1;        
         
 JSM037.NBLIGNI = IND;        
 /* PUT SKIP LIST('Nombre de lignes dans la lettre = ',IND); */        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_322';        
         
     CALL PT;        
 $END FC_322;        
 /*-------------------------------------------------------------------*/        
         
 FC_33: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_33';        
         
     CALL PT;        
         
 /*************************************************************        
 * UPDATE DB : LECTURE SCRATCH POUR TROUVER IDENTI AFFINITY   *        
 *************************************************************/        
 SSA_XIWNET.VALUE = SCENA02.NOIDCLI;        
         
 /* ACCES SEGMENT CXIWNET */        
 /* ===================== */        
 IEU001.LASTCALL = 'FC_33.1';        
 IEU001.CDDFSEG = 'CXIWNET';        
 CALL XEU100(IEU001,        
             FOUR, GU, DXI10, XIWNET, SSA_XIWNET) ;        
         
 IF DXI10.STATUS = '' THEN        
   DO;        
     SSA_XIWNET2.VALUE1 = SCENA02.NOIDSCR;        
     SSA_XIWNET2.VALUE2 = 1;        
     SSA_XIWNET2.VALUE3 = 'TM';        
     SSA_XIWNET2.VALUE4 = 30;        
     IEU001.LASTCALL = 'FC_33.2';        
     IEU001.CDDFSEG = 'CXIWNET';        
     CALL XEU100(IEU001,        
                 FOUR, GHNP, DXI10, XIWNET2, SSA_XIWNET2) ;        
     IF DXI10.STATUS = '' THEN        
       DO;        
         /* Cf GS1004S partie Affinity */        
         IDENTAFF = SUBSTR(XIWNET2.LTNMSCR,2,15);        
         LIBELAFF = SUBSTR(XIWNET2.LTNMSCR,24,20);        
       END;        
     ELSE        
       DO;        
         CALL ERR_DL1;        
         RETURN ;        
       END;        
   END;        
 ELSE        
   DO;        
     CALL ERR_DL1;        
     RETURN ;        
   END ;        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_33';        
         
     CALL PT;        
 $END FC_33;        
 /*-------------------------------------------------------------------*/        
 FC_4: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_4';        
         
     CALL PT;        
         
 /*************************************************************        
 * UPDATE DB : MAJ DS137 marquer le devis 'souscription'      *        
 *************************************************************/        
         
 DCL CDIDINT_W             PIC '(09)9';        
 DCL 1 CDIDINT_R           DEF CDIDINT_W,        
      2 NOIDUSR            PIC '(07)9',        
      2 NOSQUSR            PIC '(02)9';        
         
 KS1010J.INPUT = '';        
         
 KS1010J.INPUT.TBEGCOD_I(01) = ON; #########################        
 KS1010J.INPUT.TBEGCOD_I(13) = ON; ###################        
         
 /* DONNEES MEMO */        
 KS1010J.INPUT.CDLGTRN = SPA.CDLGEAF;        
         
 /* DONNEES DEVIS */        
 KS1010J.DEVIS.NODVINT = SPAVAR.NOIDDEV; ######################        
 KS1010J.INPUT.NOIDAFF = SPAVAR.IDENTI.NOIDAFF; ########################        
         
 JWB001.LSTCALL = 'FC0.1';        
 JWB001.LTNMMTH = 'VALID_DEVIS_NET     ';        
         
         
 /* put skip list('---- devis recherche :',SPAVAR.NOIDDEV);*/        
 CALL KS1010 (IEU001,JWB001,KS1010J);        
         
 SELECT(JWB001.CDRTPGM);        
   WHEN('')        
    DO;  ###########################################        
         
    KS1005J.INPUT              = '';        
    KS1005J.INPUT.CLDEV_I.NOIDCLI = SPAVAR.IDENTI.NOIDAFF;        
    KS1005J.INPUT.CLDEV_I   = KS1010J.OUTPUT.S1CLDEV_O, BY NAME;        
    /*        
    Attention : quand on sauve le devis dans MY ethias en scenario 6        
    , on utilise le TBEGCOD(4) du KS1010 qui va se mettre dans le        
    TBEGCOD(5) du S1CLDEV (en ks1005)        
    */        
    /* KS1005J.INPUT.CLDEV_I.TBEGCOD(5) = OFF; enlever le devis */        
    KS1005J.INPUT.CLDEV_I.TBEGCOD(6) = ON; #######################        
         
    JWB001.LTNMMTH = 'MODIF_CLDEV';        
    JWB001.LSTCALL = 'FC0.2';        
         
    CALL KS1005(IEU001,JWB001, KS1005J);        
    IF JWB001.CDRTPGM ^= '' THEN        
      DO;        
        ERREUR = ON;        
        IF JWB001.CDTRACE >= 3 THEN        
        PUT SKIP LIST('Erreur MODIF_CLDEV',JWB001.CDRTPGM);        
      END;        
    END;        
   OTHER DO;        
          ERREUR = ON;        
          IF JWB001.CDTRACE >= 3 THEN        
          PUT SKIP LIST('Erreur VALID_DEVIS_NET',JWB001.CDRTPGM);        
         END;        
 END;        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_4';        
         
     CALL PT;        
 $END FC_4;        
 /*-------------------------------------------------------------------*/        
 FC_5: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_5';        
         
     CALL PT;        
         
 /*************************************************************        
 * ENVOYER DEVIS PAR E-MAIL                                   *        
 *************************************************************/        
         
 CALL FLOAD_DSM88();        
         
 IF (SMDEVIS_012.CDCATVH = '110' !        
     SMDEVIS_012.CDCATVH = '120' !        
     SMDEVIS_012.CDCATVH = '130') /* &        
     SCENARIO_5.AGEPREN >= 30*/  THEN        
  DO;        
      CALL ENVOYER_DEVIS_DOC1();        
  END;        
 ELSE CALL ENVOYER_DEVIS_MAIL;        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_5';        
         
     CALL PT;        
 $END FC_5;        
 /*-------------------------------------------------------------------*/        
 FC_6: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FC_6';        
         
     CALL PT;        
         
 /*************************************************************        
 * IMPRIMER DEVIS SUR IMPRIMANTE DU Self                      *        
 *************************************************************/        
 /* on va lire le bureau */        
 CALL LECT_BUR;        
         
 IF JWB001.CDRTPGM = ''        
    THEN DO;        
         IF ^(LECT_IMPR) THEN RETURN;        
         END;        
 /*        
 PUT SKIP LIST('CDRFPRT_W',CDRFPRT_W); */        
         
     CALL IMPRIMER_DEVIS('');        
         
     TRACE = 'GA2016C ===> ' !! 'END FC_6';        
         
     CALL PT;        
 $END FC_6;        
 /*-------------------------------------------------------------------*/        
 FD: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FD';        
         
     CALL PT;        
 /********************************************        
 * SWITCHING VERS UN AUTRE SCENARIO          *        
 ********************************************/        
 IF SCENARI.TBSCENA(3)        
         
  ! SPAVAR.CDTYPOP = 'E' THEN        
   DO;        
     SPA.CDOPTRN = 'IMENU';        
     /*        
     PUT SKIP LIST('SPA.LTOPCOM =',SPA.LTOPCOM);        
     PUT SKIP LIST('SPA.CDOPTRN =',SPA.CDOPTRN);        
     */        
     JWB001.CDRTPGM  = 'DUMMY';        
     RETURN;        
   END;        
         
 SCENARI.NOPGACT = 'D';        
 JWB001.CDRTPGM  = 'DUMMY';        
         
     TRACE = 'GA2016C ===> ' !! 'END FD';        
         
     CALL PT;        
 $END FD;        
 /*-----------------------------------------------*/        
         
 FE: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FE';        
         
     CALL PT;        
 /********************************************        
 * TEST SI SCROLLING EST DEMANDE             *        
 ********************************************/        
 SCENARI.TBSCENA(9) = OFF;        
         
 SCENARI.TBSCENA(8) = OFF;        
         
         
     TRACE = 'GA2016C ===> ' !! 'END FE';        
         
     CALL PT;        
 $END FE;        
 /*-----------------------------------------------*/        
         
 FF: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FF';        
         
     CALL PT;        
 /********************************************        
 * TEST SI SCROLLING EST DEMANDE             *        
 ********************************************/        
     TRACE = 'GA2016C ===> ' !! 'END FF';        
         
     CALL PT;        
 $END FF;        
 /*-----------------------------------------------*/        
         
 FG: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FG';        
         
     CALL PT;        
 /******************************************************        
 * TEST DES TOUCHES EQUIVALENTES A PF1 EN CONFIRMATION *        
 ******************************************************/        
     TRACE = 'GA2016C ===> ' !! 'END FG';        
         
     CALL PT;        
 $END FG;        
 /*-----------------------------------------------*/        
 FH: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'FH';        
         
     CALL PT;        
 /******************************************************        
 * TEST DES TOUCHES EQUIVALENTES A PF1 EN CONFIRMATION *        
 ******************************************************/        
         
 TRACE = 'GA2016C ===> ' !! 'END FH';        
         
 CALL PT;        
         
 $END FH;        
 /*-----------------------------------------------*/        
         
 /* --------------- */        
 /*     INCLUDE     */        
 /* --------------- */        
 /*------------------------------------------------------------------*/        
 F_CTRL_DA: PROC(DATE_P,FORM_P) REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'CTRL_DA';        
         
     CALL PT;        
 /******************        
 * VALIDATION DATE *        
 ******************/        
         
 DCL DATE_P       CHAR(*);        
 DCL FORM_P       CHAR(1);        
 KGI011J_RI     = '';        
 KGI011J_RO     = '';        
 JWB001.LTNMMTH     = 'VALID_DATE';  ###############################        
 KGI011J_RI.CDLGTRN = SPA.CDLGTRN;        
 SELECT(FORM_P);        
   WHEN('1') DO;        
     KGI011J_RI.CDFMTDA    = 'SAAMMJJ_C7';        
     KGI011J_RI.SAAMMJJ_C7 = DATE_P;        
   END;        
   WHEN('2') DO;        
     KGI011J_RI.CDFMTDA     = 'JJMMAAAA_C8';        
     KGI011J_RI.JJMMAAAA_C8 = DATE_P;        
   END;        
   OTHER;        
 END;        
         
 KGI011J_RI.AAPIVOT = 2000;        
 CALL KGI011(IEU001,JWB001,KGI011J);        
         
 IF JWB001.CDRTPGM ^= '' THEN        
   DO;        
     IF JWB001.CDTRACE >= 3 THEN        
     DO;        
     PUT SKIP LIST('GA2016C => VALID_DATE=',DATE_P);        
     PUT SKIP LIST('FORMAT    =',FORM_P);        
     PUT SKIP LIST('JWB001.CDRTPGM=',JWB001.CDRTPGM);        
     PUT SKIP EDIT('ERREUR INTERNE FORMATAGE DATE')(A);        
     END;        
     DATE_P = '00000000';        
     ERREUR = ON;        
   END;        
         
     TRACE = 'GA2016C ===> ' !! 'END CTRL_DA';        
         
     CALL PT;        
 $END F_CTRL_DA;        
         
 /*------------------------------------------------------------------*/        
         
 LECT_CPIE: PROC(NUMCPIE_W,LTNCPIE_W) REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'LECT_CPIE';        
         
     CALL PT;        
 /*****************************************        
 * LIRE table des compagnies d'assurances *        
 *****************************************/        
 DCL NUMCPIE_W          CHAR(05);        
 DCL LTNCPIE_W          CHAR(40);        
 LTNCPIE_W = '';        
         
 /* Le code langue est dans la cle */        
 SSA_C1TAB.VALUE = 'CPIE' !! NUMCPIE_W;        
 IEU001.LASTCALL = 'LECT_CPIE.1';        
 IEU001.CDDFSEG  = 'CSMCPIE0';        
 IEU001.METAPCB  = DEU02PCB;        
 CALL XEU100 (IEU001,FOUR,GU,DC105,TABLE_CPIE,SSA_C1TAB);        
 SELECT(DC105.STATUS);        
   WHEN('') DO;        
       IF TABLE_CPIE.CDEGARG ^= 'N'        
         THEN LTNCPIE_W = TABLE_CPIE.LTNMCIE;        
     END;        
   WHEN('GB','GE') LTNCPIE_W = '';        
   OTHER        
     DO;        
       CALL ERR_DL1;        
       RETURN;        
     END;        
 END;        
         
     TRACE = 'GA2016C ===> ' !! 'END LECT_CPIE';        
         
     CALL PT;        
 $END LECT_CPIE;        
 /*-----------------------------------------------*/        
         
 LECT_SMRS: PROC(NUMSMRS_W,LTNSMRS_W) REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'LECT_SMRS';        
         
     CALL PT;        
 /*****************************************        
 * LIRE table des motifs de resiliation   *        
 *****************************************/        
 DCL NUMSMRS_W          CHAR(06);        
 DCL LTNSMRS_W          CHAR(40);        
         
 LTNSMRS_W = '';        
 SSA_C1TAB.VALUE = 'SMRS' !! NUMSMRS_W;        
 IEU001.LASTCALL = 'LECT_SMRS.1';        
 IEU001.CDDFSEG  = 'CSMSMRS0';        
 IEU001.METAPCB  = DEU02PCB;        
 CALL XEU100 (IEU001,FOUR,GU,DC105,TBSM_SMRS,SSA_C1TAB);        
 SELECT(DC105.STATUS);        
   WHEN('') DO;        
       IF TBSM_SMRS.CDEGARG ^= 'N'        
         THEN LTNSMRS_W = TBSM_SMRS.LTNMDES(SPA.CDLGTRN);        
     END;        
   WHEN('GB','GE') LTNSMRS_W = '';        
   OTHER        
     DO;        
       CALL ERR_DL1;        
       RETURN;        
     END;        
 END;        
     TRACE = 'GA2016C ===> ' !! 'END LECT_SMRS';        
         
     CALL PT;        
 $END LECT_SMRS;        
         
 /*-----------------------------------------------*/        
         
 LECT_CLPF: PROC(CDPROPR_W,LTPROPR_W) REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'LECT_CLPF';        
         
     CALL PT;        
 /*****************************************        
 * LIRE table des codes profession        *        
 *****************************************/        
 DCL CDPROPR_W          CHAR(02);        
 DCL LTPROPR_W          CHAR(30);        
 LTPROPR_W = '';        
         
 SSA_C1TAB.VALUE = 'CLPF' !! CDPROPR_W;        
 IEU001.LASTCALL = 'LECT_CLPF.1';        
 IEU001.CDDFSEG  = 'CSMCLPF0';        
 IEU001.METAPCB  = DEU02PCB;        
 CALL XEU100 (IEU001,FOUR,GU,DC105,TBSM_CLPF,SSA_C1TAB);        
 SELECT(DC105.STATUS);        
   WHEN('') DO;        
       IF TBSM_CLPF.CDEGARG ^= 'N'        
         THEN LTPROPR_W = TBSM_CLPF.LTPROFF(SPA.CDLGTRN);        
     END;        
   WHEN('GB','GE') LTPROPR_W = '';        
   OTHER        
     DO;        
       CALL ERR_DL1;        
       RETURN;        
     END;        
 END;        
         
     TRACE = 'GA2016C ===> ' !! 'END LECT_CLPF';        
         
     CALL PT;        
 $END LECT_CLPF;        
 /*-----------------------------------------------*/        
 LECT_CLAP: PROC(CDACTIV_W,LTACTIV_W) REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'LECT_CLAP';        
         
     CALL PT;        
 /*****************************************        
 * LIRE table des codes activites         *        
 *****************************************/        
 DCL CDACTIV_W          CHAR(04);        
 DCL LTACTIV_W          CHAR(30);        
 LTACTIV_W = '';        
         
 SSA_C1TAB.VALUE = 'CLAP' !! CDACTIV_W;        
 IEU001.LASTCALL = 'LECT_CLAP.1';        
 IEU001.CDDFSEG  = 'CSMCLAP0';        
 IEU001.METAPCB  = DEU02PCB;        
 CALL XEU100 (IEU001,FOUR,GU,DC105,TBSM_CLAP,SSA_C1TAB);        
 SELECT(DC105.STATUS);        
   WHEN('') DO;        
       IF TBSM_CLAP.CDEGARG ^= 'N'        
         THEN LTACTIV_W = TBSM_CLAP.LTACPRO(SPA.CDLGTRN);        
     END;        
   WHEN('GB','GE') LTACTIV_W = '';        
   OTHER        
     DO;        
       CALL ERR_DL1;        
       RETURN;        
     END;        
 END;        
         
     TRACE = 'GA2016C ===> ' !! 'END LECT_CLAP';        
         
     CALL PT;        
 $END LECT_CLAP;        
 /*-----------------------------------------------*/        
 LECT_BUR: PROC REORDER ;        
      TRACE = 'GA2016C ===> ' !! 'LECT_BUR';        
         
      CALL PT;        
  /************************************        
  * LIRE TABLE DES BUREAU POUR SELF   *        
  ************************************/        
         
  SSA_C1TAB.VALUE = 'CABU' !! SUBSTR(SPA.NOIDCHA,1,2);        
  IEU001.LASTCALL = 'LECT_CABU.1';        
  IEU001.CDDFSEG  = 'CSMCABU0';        
  IEU001.METAPCB  = DEU02PCB;        
  CALL XEU100 (IEU001,FOUR,GU,DC105,TBSM_CABU,SSA_C1TAB);        
  SELECT(DC105.STATUS);        
    WHEN('') DO;        
        /*  CDRFPRT_W = TBSM_CABU.CDRFPRT; */        
            CDRFPRT_W = TBSM_CABU.CDRFPRT4;        
      END;        
    WHEN('GB','GE') CDRFPRT_W = '';        
    OTHER        
      DO;        
        CALL ERR_DL1;        
        RETURN;        
      END;        
  END;        
      TRACE = 'GA2016C ===> ' !! 'END LECT_BUR';        
         
      CALL PT;        
  $END LECT_BUR;        
         
 /*-----------------------------------------------*/        
 LECT_IMPR: PROC REORDER RETURNS(BIT(1));        
      TRACE = 'GA2016C ===> ' !! 'LECT_IMPR';        
         
      CALL PT;        
  /********************************        
  * LIRE TABLE DES IMPRIMANTES    *        
  ********************************/        
         
  SSA_C1TAB.VALUE = 'PRTT' !! CDRFPRT_W  !!  '.....';        
  IEU001.LASTCALL = 'LECT_PRTT.1';        
  IEU001.CDDFSEG  = 'CTTPRTT0';        
  IEU001.METAPCB  = DEU02PCB;        
  CALL XEU100 (IEU001,FOUR,GU,DC105,TBTT_PRTT,SSA_C1TAB);        
  SELECT(DC105.STATUS);        
    WHEN('') RETURN(ON);        
    WHEN('GB','GE') RETURN(OFF);        
    OTHER        
      DO;        
        CALL ERR_DL1;        
        RETURN(OFF);        
      END;        
  END;        
      TRACE = 'GA2016C ===> ' !! 'END LECT_IMPR';        
         
      CALL PT;        
  $END LECT_IMPR;        
 /*-----------------------------------------------*/        
 /*------------------------------------------------------------------*/        
         
 FLOAD_DSM88:PROC REORDER ;        
 TRACE='GA2016C ===> ' !! ' FLOAD_DSM88  ';        
         
 CALL PT;        
 /***********************************        
 *  CHARGEMENT DSM88                *        
 ************************************/        
         
 DCL NOIDDEV_W          FIXED(11);        
 DCL 1   KEY_DEVIS,        
      2   NOIDDEV PIC'(4)9',        
      2   NOIDVER PIC'(3)9';        
 DCL KEY_DEVIS_SSA PIC'(7)9' BASED(ADDR(KEY_DEVIS));        
 DCL 1 CLE_TAB,        
      2   ENTREE,        
       3  CDAPPEL       CHAR(01),        
       3  CDTYLET(10)   CHAR(01),        
       3 KEYDEVIS,        
        4 CDTYKEY       CHAR(1),        
        4 NOIDKEY       PIC'(9)9',        
        4 NOSQDEV       PIC'(7)9',        
        4 NOSQTXT       PIC'(3)9',        
       3  CDLGTRN       PIC'9',        
       3  TBTYPAF       BIT(240),        
       3  FILLER        CHAR(18);        
         
 CLE_TAB = '';        
 INTER_C11 = SUBSTR(SPAVAR.NOIDDEV,3,11);        
 INTER_C9  = SUBSTR(SPAVAR.NOIDDEV,3,9 );        
 INTER_C7  = SUBSTR(SPAVAR.NOIDDEV,3,7 );        
 NOIDDEV_W = INTER_P11;        
 KEY_DEVIS_SSA = 0;        
 KEY_DEVIS.NOIDDEV = MOD(NOIDDEV_W, 10000) ;        
 KEY_DEVIS.NOIDVER = SPAVAR.VERSDEV;####################################        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
      PUT SKIP LIST('FLOAD_DSM88');        
         
      PUT SKIP LIST('SPAVAR.NOIDDEV=',SPAVAR.NOIDDEV);        
      PUT SKIP LIST('INTER_P11=',INTER_P11);        
      PUT SKIP LIST('INTER_P9 =',INTER_P9 );        
      PUT SKIP LIST('INTER_C9 =',INTER_C9 );        
      PUT SKIP LIST('INTER_P7 =',INTER_P7 );        
      PUT SKIP LIST('INTER_C7 =',INTER_C7 );        
      PUT SKIP LIST('SPAVAR.VERSDEV=',SPAVAR.VERSDEV);        
      PUT SKIP LIST('KEY_DEVIS_SSA',KEY_DEVIS_SSA);        
      PUT SKIP LIST('NOIDDEV_W  =',NOIDDEV_W);        
   END;        
         
   /* SMDEVIS_012 */        
   SSA_SMDEVIS.VALUE1='D';        
   SSA_SMDEVIS.VALUE2=INTER_P7;        
   SSA_SMDEVIS.VALUE3=KEY_DEVIS_SSA;        
   SSA_SMDEVIS.VALUE4=1;        
   JWB001.LSTCALL ='DOC-1';        
   IEU001.CDDFSEG = 'CSMDV012';        
   CALL XEU100(IEU001,FOUR,GU,DSM88,SMDEVIS_012,SSA_SMDEVIS);        
         
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
      PUT SKIP LIST('LECTURE EN BRUTE DEVIS_012');        
      PUT SKIP LIST('LECTURE SSA : ',SSA_SMDEVIS);        
      PUT SKIP LIST('LECTURE STATUS',DSM88.STATUS);        
      PUT SKIP DATA(SMDEVIS_012);        
   END;        
         
         
 IF DSM88.STATUS^= ' ' THEN CALL ERR_DL1;        
         
         
   /* SMDEVIS_013 */        
   SSA_SMDEVIS.VALUE1='D';        
   SSA_SMDEVIS.VALUE2=INTER_P7;        
   SSA_SMDEVIS.VALUE3=KEY_DEVIS_SSA;        
   SSA_SMDEVIS.VALUE4=2;        
   JWB001.LSTCALL ='DOC-2';        
   IEU001.CDDFSEG = 'CSMDV013';        
   CALL XEU100(IEU001,FOUR,GU,DSM88,SMDEVIS_013,SSA_SMDEVIS);        
         
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
      PUT SKIP LIST('LECTURE EN BRUTE DEVIS_013');        
      PUT SKIP LIST('LECTURE SSA : ',SSA_SMDEVIS);        
      PUT SKIP LIST('LECTURE STATUS',DSM88.STATUS);        
      PUT SKIP DATA(SMDEVIS_013);        
   END;        
         
 IF DSM88.STATUS^= ' ' THEN CALL ERR_DL1;        
         
 IF SMDEVIS_012.TBEGCDV(2) THEN #########################        
  DO;        
   SSA_SMDEVIS.VALUE1='D';        
   SSA_SMDEVIS.VALUE2=INTER_P7;        
   SSA_SMDEVIS.VALUE3=KEY_DEVIS_SSA;        
   SSA_SMDEVIS.VALUE4=3;        
   JWB001.LSTCALL ='DOC-3';        
   IEU001.CDDFSEG = 'CSMDV014';        
   CALL XEU100(IEU001,FOUR,GU,DSM88,SMDEVIS_014,SSA_SMDEVIS);        
   IF DSM88.STATUS^= ' ' THEN CALL ERR_DL1;        
  END;        
 ELSE SMDEVIS_014 = '';        
         
 IF SMDEVIS_012.TBEGCDV(3) THEN ########################        
  DO;        
   SSA_SMDEVIS.VALUE1='D';        
   SSA_SMDEVIS.VALUE2=INTER_P7;        
   SSA_SMDEVIS.VALUE3=KEY_DEVIS_SSA;        
   SSA_SMDEVIS.VALUE4=4;        
   JWB001.LSTCALL='DOC-4';        
   IEU001.CDDFSEG = 'CSMDV015';        
   CALL XEU100(IEU001,FOUR,GU,DSM88,SMDEVIS_015,SSA_SMDEVIS);        
   IF DSM88.STATUS^= ' ' THEN CALL ERR_DL1;        
  END;        
 ELSE SMDEVIS_015 = '';        
         
 IF SMDEVIS_012.TBEGCDV(6) = ON THEN ###############################        
  DO;        
   SSA_SMDEVIS.VALUE1='D';        
   SSA_SMDEVIS.VALUE2=INTER_P7;        
   SSA_SMDEVIS.VALUE3=KEY_DEVIS_SSA;        
   SSA_SMDEVIS.VALUE4=5;        
   JWB001.LSTCALL='DOC-5';        
   IEU001.CDDFSEG = 'CSMDV018';        
   CALL XEU100(IEU001,FOUR,GU,DSM88,SMDEVIS_018,SSA_SMDEVIS);        
   IF DSM88.STATUS^= ' ' THEN CALL ERR_DL1;        
  END;        
 ELSE SMDEVIS_018 = '';        
         
         
 IF SMDEVIS_012.TBEGCDV(9) THEN ###############################        
  DO;        
   SSA_SMDEVIS.VALUE1='D';        
   SSA_SMDEVIS.VALUE2=INTER_P7;        
   SSA_SMDEVIS.VALUE3=KEY_DEVIS_SSA;        
   SSA_SMDEVIS.VALUE4=6;        
   JWB001.LSTCALL='DOC-6';        
   IEU001.CDDFSEG = 'CSMDV047';        
   CALL XEU100(IEU001,FOUR,GU,DSM88,SMDEVIS_047,SSA_SMDEVIS);        
   IF DSM88.STATUS^= ' ' THEN CALL ERR_DL1;        
  END;        
 ELSE SMDEVIS_047 = '';        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
      PUT SKIP DATA(SMDEVIS_012);        
      PUT SKIP DATA(SMDEVIS_013);        
      PUT SKIP DATA(SMDEVIS_014);        
      PUT SKIP DATA(SMDEVIS_015);        
      PUT SKIP DATA(SMDEVIS_018);        
      PUT SKIP DATA(SMDEVIS_047);        
   END;        
 $END FLOAD_DSM88;        
         
 ENVOYER_DEVIS_DOC1: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'ENV_E_MAIL';        
         
     CALL PT;        
 /*************************************************************        
 * Pr{parer la lettre @ envoyer par e-mail en format DOC1 PDF *        
 *************************************************************/        
 LTOBJOP_R = SPAVAR.LTOBJOP_016;        
 DCL NOIDDEV_W          FIXED(11);        
 DCL 1   KEY_DEVIS,        
      2   NOIDDEV PIC'(4)9',        
      2   NOIDVER PIC'(3)9';        
 DCL KEY_DEVIS_SSA PIC'(7)9' BASED(ADDR(KEY_DEVIS));        
 DCL 1 CLE_TAB,        
      2   ENTREE,        
       3  CDAPPEL       CHAR(01),        
       3  CDTYLET(10)   CHAR(01),        
       3 KEYDEVIS,        
        4 CDTYKEY       CHAR(1),        
        4 NOIDKEY       PIC'(9)9',        
        4 NOSQDEV       PIC'(7)9',        
        4 NOSQTXT       PIC'(3)9',        
       3  CDLGTRN       PIC'9',        
       3  TBTYPAF       BIT(240),        
       3  FILLER        CHAR(18);        
         
 DCL W_LTNMSCR           CHAR(2000) VARYING;        
 DCL W_LTNMSCR2          CHAR(4000) VARYING;        
         
 IF SPAVAR.VERSDEV = 0 THEN        
   DO;        
     /*        
     put skip list('Derniere version devis 0 ! pas d''envoi e-mail');        
     */        
     ERREUR = ON;        
     RETURN;        
   END;        
         
 CLE_TAB = '';        
 INTER_C11 = SUBSTR(SPAVAR.NOIDDEV,3,11);        
 NOIDDEV_W = INTER_P11;        
 KEY_DEVIS_SSA = 0;        
 KEY_DEVIS.NOIDDEV = MOD(NOIDDEV_W, 10000) ;        
 KEY_DEVIS.NOIDVER = SPAVAR.VERSDEV;####################################        
         
 CLE_TAB.CDAPPEL = 'S';##########################        
 CLE_TAB.CDTYLET(*) = 'N';        
 CLE_TAB.CDTYLET(1) = 'Y';        
 CLE_TAB.CDTYLET(2) = 'Y';        
 CLE_TAB.CDTYLET(5) = 'Y'; ##########################        
 CLE_TAB.KEYDEVIS.CDTYKEY = 'D' ;        
 CLE_TAB.KEYDEVIS.NOIDKEY = NOIDDEV_W / 10000 ; ######################        
 CLE_TAB.KEYDEVIS.NOSQDEV = KEY_DEVIS_SSA ;        
 CLE_TAB.KEYDEVIS.NOSQTXT=1; #####################        
 CLE_TAB.CDLGTRN = SPA.CDLGTRN;        
 CLE_TAB.TBTYPAF = '';        
         
 JSM186.PTRPCB.DBPCB(*)=NULL();        
 JSM186.PTRPCB.DBPCB(01)=GA2016J.DSM88PCB;        
 JSM186.PTRPCB.DBPCB(02)=GA2016J.DC105PCB;        
 JSM186.PTRPCB.DBPCB(03)=GA2016J.DS101PCB;        
 JSM186.PTRPCB.DBPCB(04)=GA2016J.DS102PCB;        
 JSM186.PTRPCB.DBPCB(05)=GA2016J.DA215PCB;        
 JSM186.PTRPCB.DBPCB(06)=GA2016J.DA216PCB;        
 JSM186.PTRPCB.DBPCB(07)=GA2016J.DS137PCB;        
 JSM186.PTRPCB.DBPCB(08)=GA2016J.DSM22PCB;        
 JSM186.PTRPCB.DBPCB(09)=GA2016J.DA215$PCB;        
 JSM186.PTRPCB.DBPCB(10)=GA2016J.DS132PCB;        
         
 JSM186.WLTNMSCR_PTR =ADDR(W_LTNMSCR);        
 JSM186.WLTNMSCR2_PTR=ADDR(W_LTNMSCR2);        
 JSM186.ENTREE=CLE_TAB.ENTREE,BY NAME;        
         
 JSM186.CDAPPEL = 'W'; #############################        
         
 /*  INITIALISATION DU COPY JA2N53   */        
 JA2N53.ALTPCB = GA2016J.ALTPCB;       ##################################        
 JA2N53.DS146  = GA2016J.DS146PCB;     ###############################        
 JA2N53.DSM80  = GA2016J.DSM80PCB;     ###############################        
 JA2N53.DSM07  = GA2016J.DSM07PCB;     ########################################        
 JA2N53.DSMB9  = GA2016J.DSMB9PCB;  ###########################################        
 JA2N53.SEGMENT(*)=NULL();        
 JA2N53.SEGMENT(1)=ADDR(SMDEVIS_012) ;        
 JA2N53.SEGMENT(2)=ADDR(SMDEVIS_013) ;        
 JA2N53.SEGMENT(3)=ADDR(SMDEVIS_014) ;        
 JA2N53.SEGMENT(4)=ADDR(SMDEVIS_015) ; #############        
 JA2N53.SEGMENT(5)=ADDR(SMDEVIS_018) ; #############        
 JA2N53.SEGMENT(6)=ADDR(SMDEVIS_047);        
         
 JA2N53.NOIDAFF= SPAVAR.IDENTI.NOIDAFF;        
 JA2N53.NOIDPOL= 0;                 ##########################################################        
         
 /* pour internet : pas de lettre accompagnement                   */        
 JA2N53.CDLTACC = '0';        
 /* pour internet : Souscription => devis entier                   */        
 JA2N53.CDLTPRI = '';        
 JA2N53.CDLTPRO = '1';        
         
 /* pour internet : pas de lettre de renon                         */        
 JA2N53.CDLTREN = '';        
         
 IF SPA.CDLGTRN = '1' ####################################        
    THEN JA2N53.CDCMGES ='11709201';        
 ELSE JA2N53.CDCMGES ='21709202';        
         
         
 JA2N53.CDSCTRN= SPA.CDSCTRN;       ################################################        
 JA2N53.CDRSCTL= LTOBJOP_Z.CDRSCTL; #####################################        
         
 JA2N53.CDTYIMP = 'M'; ###############################        
         
 JA2N53.EMAILID.EMAILTO = SPAVAR.IDENTI.EMAILAF;        
 JA2N53.EMAILID.EMAILCC = 'claire.kips@nrb.be';        
         
 JA2N53.LTOBJOP_W = LTOBJOP_Z, BY NAME;        
         
 JA2N53.CDPRODU = SMDEVIS_012.CDTYPRO;        
 JA2N53.CDCHPAI = '';        
         
    /*   JA2N53.NOSQINT       /* NO INTERVENTION          */        
    /*   JA2N53.NOSQSUJ       /* NO SUJET                 */        
    /*   JA2N53.CDCNTVC       /* VECTEUR DE CONTACT       */        
    /*   JA2N53.CDCAC         /* CODE ACTION COMMERCIALE  */        
    /*   JA2N53.CDOPER        /* CODE OPERATION           */        
    /*   JA2N53.CDPRODU       /* CODE PRODUIT             */        
    /*   JA2N53.CDTYPPR       /* TYPE PRODUIT (DR/CS)     */        
    /*   JA2N53.CDLETTR       /* LETTRE                   */        
    /*   JA2N53.CDCANAL       /* CODE CANAL GEST.         */        
    /*   JA2N53.CDTTAPP       /* APPLIC. POUR TRT TEXTE   */        
    /*   JA2N53.NOSEQRB       /* DEV SEQ DS139 => PS1088  */        
    /*   JA2N53.CDSGGES       /* CODE SIEGE GEST.         */        
    /*   JA2N53.CDCOUGE       /* SERVICE COURRIER GEST.   */        
    /*   JA2N53.CDDEVIS       /* NO DEVIS A RECOPIER OU   */        
    /*                        /* NO PROD DEVIS BO INTRANET*/        
    /*   JA2N53.CDRSCTL       /* RESUL. CTRLRSQ 'B'=BLOQ  */        
                              /* TP IMPRES. VENANT FIRST L/C */        
 CALL XA2N53(JA2N53,JSM186,IEU001);        
         
 IF JA2N53.CDRTPGM ^= '' THEN        
    IF JA2N53.CDRTPGM= '9' THEN        
       DO ;        
          ERREUR   = '1'B;        
          JWB001.LSTCALL = JA2N53.LASTDLI;        
          IEU001.DBPTR=JA2N53.DBPTR;        
          CALL ERR_DL1;        
          RETURN;        
       END;        
    ELSE        
       DO ;        
         ERREUR = '1'B;        
         IF JWB001.CDTRACE >= 3 THEN        
         PUT SKIP EDIT('ERREUR NON DB',JA2N53.CDRTPGM)(A);        
       END;        
         
 JWB001.LSTCALL     = 'DOC-3';        
 IEU001.CDDFSEG     = 'CSMDV012';        
         
 SSA_SMDEVIS.VALUE1 = SMDEVIS_012.CDTYKEY;        
 SSA_SMDEVIS.VALUE2 = SMDEVIS_012.NOIDKEY;        
 SSA_SMDEVIS.VALUE3 = SMDEVIS_012.NOSQDEV;        
 SSA_SMDEVIS.VALUE4 = 1;        
         
 CALL XEU100(IEU001,FOUR,GHU,DSM88,SMDEVIS_012,SSA_SMDEVIS);        
         
 IF(DSM88.STATUS ^= ' ') THEN        
   DO;        
      CALL ERR_DL1;        
      RETURN;        
   END;        
         
 NOIDDOC_R = JA2N53.NOIDDOC; ####################################        
         
 JWB001.LSTCALL = 'DOC-4';        
 IEU001.CDDFSEG = 'CSMDV012';        
         
 CALL XEU100(IEU001,THREE,REPL,DSM88,SMDEVIS_012);        
         
 IF(DSM88.STATUS ^= ' ') THEN        
   DO;        
      CALL ERR_DL1;        
      RETURN;        
   END;        
         
 /* maj stat nbre de devis envoy{ par e-mail */        
 STAT_W = TRANSLATE(SPA.CDLGTRN,'FNF','123') !! 'A201001';        
 CALL STATSITE(STAT_W,13,1,'M');        
         
     TRACE = 'GA2016C ===> ' !! 'END DOC1_MAIL';        
         
     CALL PT;        
 $END ENVOYER_DEVIS_DOC1;        
         
 /*------------------------------------------------------------------*/        
 ENVOYER_DEVIS_MAIL: PROC REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'ENV_E_MAIL';        
         
     CALL PT;        
 /********************************************        
 * Preparer la lettre e envoyer par e-mail   *        
 ********************************************/        
 DCL NOIDDEV_W          FIXED(11);        
 DCL 1   KEY_DEVIS,        
      2   NOIDDEV PIC'(4)9',        
      2   NOIDVER PIC'(3)9';        
 DCL KEY_DEVIS_SSA PIC'(7)9' BASED(ADDR(KEY_DEVIS));        
 DCL 1 CLE_TAB,        
      2   ENTREE,        
       3  CDAPPEL       CHAR(01),        
       3  CDTYLET(10)   CHAR(01),        
       3 KEYDEVIS,        
        4 CDTYKEY       CHAR(1),        
        4 NOIDKEY       PIC'(9)9',        
        4 NOSQDEV       PIC'(7)9',        
        4 NOSQTXT       PIC'(3)9',        
       3  CDLGTRN       PIC'9',        
       3  TBTYPAF       BIT(240),        
       3  FILLER        CHAR(18);        
         
 DCL W_LTNMSCR           CHAR(2000) VARYING;        
 DCL W_LTNMSCR2          CHAR(4000) VARYING;        
         
 IF SPAVAR.VERSDEV = 0 THEN        
   DO;        
     /*        
     put skip list('Derniere version devis 0 ! pas d''envoi e-mail');        
     */        
     ERREUR = ON;        
     RETURN;        
   END;        
         
 CLE_TAB = '';        
 INTER_C11 = SUBSTR(SPAVAR.NOIDDEV,3,11);        
 NOIDDEV_W = INTER_P11;        
 KEY_DEVIS_SSA = 0;        
 KEY_DEVIS.NOIDDEV = MOD(NOIDDEV_W, 10000) ;        
 KEY_DEVIS.NOIDVER = SPAVAR.VERSDEV;####################################        
         
 IF SCENARI.NOPGACT = 'C'        
   THEN CLE_TAB.CDAPPEL = 'S';##########################        
   ELSE CLE_TAB.CDAPPEL = 'W';###################        
 CLE_TAB.CDTYLET(*) = 'N';        
 CLE_TAB.CDTYLET(1) = 'Y';        
 CLE_TAB.CDTYLET(2) = 'Y';        
 CLE_TAB.CDTYLET(5) = 'Y'; ##########################        
 CLE_TAB.KEYDEVIS.CDTYKEY = 'D' ;        
 CLE_TAB.KEYDEVIS.NOIDKEY = NOIDDEV_W / 10000 ; ######################        
 CLE_TAB.KEYDEVIS.NOSQDEV = KEY_DEVIS_SSA ;        
 CLE_TAB.KEYDEVIS.NOSQTXT=1; #####################        
 CLE_TAB.CDLGTRN = SPA.CDLGTRN;        
 CLE_TAB.TBTYPAF = '';        
         
 JSM186.PTRPCB.DBPCB(*)=NULL();        
 JSM186.PTRPCB.DBPCB(1)=GA2016J.DSM88PCB ;        
 JSM186.PTRPCB.DBPCB(2)=GA2016J.DC105PCB ;        
 JSM186.PTRPCB.DBPCB(3)=GA2016J.DS101PCB ;        
 JSM186.PTRPCB.DBPCB(4)=GA2016J.DS102PCB ;        
 JSM186.PTRPCB.DBPCB(5)=GA2016J.DA215PCB;        
 JSM186.PTRPCB.DBPCB(6)=GA2016J.DA216PCB;        
 JSM186.PTRPCB.DBPCB(7)=GA2016J.DS137PCB ;  #################################        
 JSM186.PTRPCB.DBPCB(8)=GA2016J.DA215$PCB ; ################################        
 JSM186.WLTNMSCR_PTR =ADDR(W_LTNMSCR);        
 JSM186.WLTNMSCR2_PTR=ADDR(W_LTNMSCR2);        
 JSM186.ENTREE=CLE_TAB.ENTREE,BY NAME;        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     PUT SKIP LIST ('TDMTHO ENVOI DEVIS E-MAIL XSM702 ....');        
     PUT SKIP LIST ('A2016 => ENVOI DEVIS E-MAIL ....');        
     PUT SKIP DATA (JSM186.ENTREE) ;        
   END;        
         
 CALL XSM702(JSM186,IEU001);        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     PUT SKIP LIST ('CLAIRE_KIPS=>APRES XSM702');        
     PUT SKIP DATA (JSM186.RETOURS) ;        
     PUT SKIP DATA (JSM186.SORTIES) ;        
     PUT SKIP DATA (W_LTNMSCR) ;        
     PUT SKIP DATA (W_LTNMSCR2);        
   END;        
         
 IF JSM186.CDRTPGM ^= '' THEN        
   IF JSM186.CDRTPGM= '9' THEN        
      DO ;        
         IF JWB001.CDTRACE >= 3 THEN        
         PUT SKIP LIST ('CLAIRE_KIPS=>ERREUR APPEL XSM702 , CDRTPGM=9');        
         ERREUR   = ON;        
         JWB001.LSTCALL = JSM186.LASTDLI;        
         CALL ERR_DL1;        
         RETURN;        
      END;        
   ELSE        
      DO ;        
        IF JWB001.CDTRACE >= 3 THEN        
        DO;        
        PUT SKIP LIST ('CLAIRE_KIPS=>ERREUR APPEL XSM702 !!!');        
        PUT SKIP EDIT('CLAIRE_KIPS=>ERREUR NON DB',JSM186.CDRTPGM)(A);        
        END;        
        ERREUR = ON;        
        RETURN;        
      END;        
         
         
 /* PUT SKIP DATA(SPA); */        
         
 DCL 1   TB_DCTT,        
      2  EL_DCTT (35),        
       3 KEY_DCTT         CHAR (09),        
       3 DATA_DCTT        CHAR (191),        
      2  NB_DCTT          FIXED (3);        
 DCL 1   LETTRE,        
      2  LIGNE (999),        
       3 CDDBCL           CHAR (01),        
       3 NOIDCL           CHAR (03),        
       3 NOSQCL           FIXED (5),        
       3 LTLILT           CHAR (75);        
 DCL 1   VARLET,        
      2  VARIAB (2000),        
       3 NOSQCL           FIXED (5),        
       3 LTTXVA           CHAR (75),        
       3 LTNMVA           CHAR (14),        
       3 NUTXVA           FIXED DEC (15,2);        
 DCL     II               FIXED BIN (31);        
         
 JSM171 = '';        
         
 PTRPCB_TAB(*)   = NULL();        
         
 JSM171.IOPCB    = GA2016J.IOPCB;        
 JSM171.ALTRPCB  = GA2016J.ALTPCB;        
 JSM171.TABPCB   = GA2016J.DC105PCB;        
 JSM171.CLAUSPCB = GA2016J.DSM07PCB;        
 JSM171.DS101PCB = GA2016J.DS101PCB;        
 JSM171.DS102PCB = GA2016J.DS102PCB;        
 JSM171.DS124PCB = GA2016J.DS124PCB;        
 JSM171.DSM09PCB = GA2016J.DSM09PCB;        
 JSM171.DSM19PCB = NULL;        
 JSM171.DSM22PCB = GA2016J.DSM22PCB;        
 JSM171.DSM60PCB = GA2016J.DSM60PCB;        
 JSM171.DSM61PCB = GA2016J.DSM61PCB;        
 JSM171.DSM62PCB = GA2016J.DSM62PCB;        
 JSM171.DSM63PCB = GA2016J.DSM63PCB;        
 JSM171.DSM64PCB = GA2016J.DSM64PCB;        
 JSM171.DSM65PCB = GA2016J.DSM65PCB;        
 JSM171.DSM66PCB = GA2016J.DSM66PCB;        
 JSM171.DSM67PCB = GA2016J.DSM67PCB;        
 JSM171.DSM68PCB = GA2016J.DSM68PCB;        
 JSM171.DSM69PCB = GA2016J.DSM69PCB;        
 JSM171.DSM01PCB = GA2016J.DSM01PCB;        
 JSM171.DSM06PCB = GA2016J.DSM06PCB;        
 JSM171.DA105PCB = NULL;        
 JSM171.DA106PCB = NULL;        
 /* TDMTHO 21/03/2005 ajout ptr DS137 */        
 JSM171.DS137PCB = GA2016J.DS137PCB;        
 JSM171.DSMB9PCB = GA2016J.DSMB9PCB;        
         
 JSM171.NOIDAFF = SPAVAR.IDENTI.NOIDAFF;        
 JSM171.NOIDPOL = 0;        
 JSM171.NOIDSIN = SPAVAR.IDENTI.NOIDAFF;        
 IF SPAVAR.IDENTI.CDLGEAF = 'F'        
   THEN JSM171.CDCMGES = 'PWEBFR';        
   ELSE JSM171.CDCMGES = 'PWEBNL';        
 JSM171.CDOPTRN = 'S1GSI';        
 JSM171.MEMOCMD = '';        
 JSM171.MEMOCMD.CDNATOP = 'E';        
 JSM171.MEMOCMD.CDTYPOP = 'S';        
 JSM171.NOSQMEM   = '';        
 JSM171.WLTNMSCR  = W_LTNMSCR;        
 JSM171.WLTNMSCR2 = W_LTNMSCR2;        
 JSM171.NBLIGNE = '';        
 JSM171.CDSCTRN = '';########################        
 JSM171.NORFPRT = '';        
 JSM171.CDRTPGM = '';        
 JSM171.CDTTAPP = 'CC';############################        
 JSM171.LASTDLI = '';        
 JSM171.NBVAR = '';        
 JSM171.LTOBJOP = 'M:' !! SPAVAR.IDENTI.EMAILAF;        
 JSM171.LTSCTRN = 'ETHI';#########################        
 SUBSTR(JSM171.WLTNMSCR,45,1)= ' ';        
 SUBSTR(JSM171.WLTNMSCR,54,12)= '#LTOBJOP';        
 JSM171.CDIMPDV = 'T';        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
     PUT SKIP LIST ('CLAIRE_KIPS=>AVANT APPEL XSM664');        
     PUT SKIP DATA (        
       JSM171.NOIDAFF,        
       JSM171.NOIDPOL,        
       JSM171.NOIDSIN,        
       JSM171.CDCMGES,        
       JSM171.CDOPTRN,        
       JSM171.MEMOCMD,        
       JSM171.NOSQMEM,        
       JSM171.WLTNMSCR,        
       JSM171.WLTNMSCR2,        
       JSM171.NBLIGNE,        
       JSM171.CDSCTRN,        
       JSM171.NORFPRT,        
       JSM171.CDRTPGM,        
       JSM171.CDTTAPP,        
       JSM171.LASTDLI,        
       JSM171.NBVAR,        
       JSM171.LTOBJOP,        
       JSM171.LTSCTRN);        
   END;        
         
 LETTRE = '';        
 TB_DCTT = '';        
 VARLET = '';        
         
 CALL XSM664 (IEU001, JSM171, LETTRE, TB_DCTT, VARLET);        
         
 IF JSM171.CDRTPGM ^= ''        
   THEN DO;        
     IF JWB001.CDTRACE >= 3 THEN        
       DO;        
         PUT SKIP EDIT ('CLAIRE_KIPS=>PROBLEM IN XSM664')(A);        
         PUT DATA (JSM171.CDRTPGM, JSM171.LASTDLI);        
         DO II=1 TO JSM171.NBLIGNE;        
           PUT SKIP DATA (LETTRE.LIGNE(II));        
         END;        
         DO II=1 TO NB_DCTT;        
           PUT SKIP DATA (KEY_DCTT(II), DATA_DCTT(II));        
         END;        
       END;        
   END;        
         
 IF JWB001.CDTRACE >= 3 THEN        
   DO;        
 PUT SKIP EDIT ('CLAIRE_KIPS=>APRES XSM664')(A);        
     PUT SKIP DATA (        
       JSM171.NOIDAFF,        
       JSM171.NOIDPOL,        
       JSM171.NOIDSIN,        
       JSM171.CDCMGES,        
       JSM171.CDOPTRN,        
       JSM171.MEMOCMD,        
       JSM171.NOSQMEM,        
       JSM171.WLTNMSCR,        
       JSM171.WLTNMSCR2,        
       JSM171.NBLIGNE,        
       JSM171.CDSCTRN,        
       JSM171.NORFPRT,        
       JSM171.CDRTPGM,        
       JSM171.CDTTAPP,        
       JSM171.LASTDLI,        
       JSM171.NBVAR,        
       JSM171.LTOBJOP,        
       JSM171.LTSCTRN);        
   END;        
         
 /* maj stat nbre de devis envoye par e-mail */        
 STAT_W = TRANSLATE(SPA.CDLGTRN,'FNF','123') !! 'A201001';        
 CALL STATSITE(STAT_W,13,1,'M');        
         
     TRACE = 'GA2016C ===> ' !! 'END ENV_E_MAIL';        
         
     CALL PT;        
 $END ENVOYER_DEVIS_MAIL;        
         
 /*------------------------------------------------------------------*/        
 IMPRIMER_DEVIS: PROC(CHOIX) REORDER ;        
     TRACE = 'GA2016C ===> ' !! 'IMP_DEVIS';        
         
     CALL PT;        
         
 DCL CHOIX CHAR(1);        
         
 DCL NOIDDEV_W          FIXED(11);        
 DCL 1   KEY_DEVIS,        
      2   NOIDDEV PIC'(4)9',        
      2   NOIDVER PIC'(3)9';        
 DCL KEY_DEVIS_SSA PIC'(7)9' BASED(ADDR(KEY_DEVIS));        
 DCL 1 CLE_TAB,        
      2   ENTREE,        
       3  CDAPPEL       CHAR(01),        
       3  CDTYLET(10)   CHAR(01),        
       3 KEYDEVIS,        
        4 CDTYKEY       CHAR(1),        
        4 NOIDKEY       PIC'(9)9',        
        4 NOSQDEV       PIC'(7)9',        
        4 NOSQTXT       PIC'(3)9',        
       3  CDLGTRN       PIC'9',        
       3  TBTYPAF       BIT(240),        
       3  FILLER        CHAR(18);        
         
 DCL W_LTNMSCR           CHAR(2000) VARYING;        
 DCL W_LTNMSCR2          CHAR(4000) VARYING;        
         
 IF SPAVAR.VERSDEV = 0 THEN        
   DO;        
     IF JWB001.CDTRACE >= 3 THEN        
     PUT SKIP LIST('Derniere version devis 0 ! pas d''envoi e-mail');        
     ERREUR = ON;        
     RETURN;        
   END;        
         
 CLE_TAB = '';        
 INTER_C11 = SUBSTR(SPAVAR.NOIDDEV,3,11);        
 NOIDDEV_W = INTER_P11;        
 KEY_DEVIS_SSA = 0;        
 KEY_DEVIS.NOIDDEV = MOD(NOIDDEV_W, 10000) ;        
 KEY_DEVIS.NOIDVER = SPAVAR.VERSDEV;####################################        
         
 IF SCENARI.NOPGACT = 'C'        
   THEN CLE_TAB.CDAPPEL = 'C';##############################        
   ELSE CLE_TAB.CDAPPEL = 'B';#######################        
 CLE_TAB.CDTYLET(*) = 'N';        
 CLE_TAB.CDTYLET(1) = 'Y';        
 CLE_TAB.CDTYLET(2) = 'Y';        
 CLE_TAB.CDTYLET(5) = 'Y'; ##########################        
 IF SCENARI.NOPGACT = '6'        
    THEN DO;        
    IF CHOIX = 'J'        
       THEN DO;        
         CLE_TAB.CDTYLET(2) = 'Y';        
         CLE_TAB.CDTYLET(5) = 'N';        
       END;        
    IF CHOIX = 'K'        
       THEN DO;        
         CLE_TAB.CDTYLET(2) = 'N';        
         CLE_TAB.CDTYLET(5) = 'Y';        
       END;        
    END;        
 CLE_TAB.KEYDEVIS.CDTYKEY = 'D' ;        
 CLE_TAB.KEYDEVIS.NOIDKEY = NOIDDEV_W / 10000 ; ######################        
 CLE_TAB.KEYDEVIS.NOSQDEV = KEY_DEVIS_SSA ;        
 CLE_TAB.KEYDEVIS.NOSQTXT=1; #####################        
 CLE_TAB.CDLGTRN = SPA.CDLGTRN;        
 CLE_TAB.TBTYPAF = '';        
         
 JSM186.PTRPCB.DBPCB(*)=NULL();        
 JSM186.PTRPCB.DBPCB(1)=GA2016J.DSM88PCB ;        
 JSM186.PTRPCB.DBPCB(2)=GA2016J.DC105PCB ;        
 JSM186.PTRPCB.DBPCB(3)=GA2016J.DS101PCB ;        
 JSM186.PTRPCB.DBPCB(4)=GA2016J.DS102PCB ;        
 JSM186.PTRPCB.DBPCB(5)=GA2016J.DA215PCB;        
 JSM186.PTRPCB.DBPCB(6)=GA2016J.DA216PCB;        
 JSM186.PTRPCB.DBPCB(7)=GA2016J.DS137PCB ;        
 JSM186.PTRPCB.DBPCB(8)=GA2016J.DA215$PCB;        
 JSM186.WLTNMSCR_PTR =ADDR(W_LTNMSCR);        
 JSM186.WLTNMSCR2_PTR=ADDR(W_LTNMSCR2);        
 JSM186.ENTREE=CLE_TAB.ENTREE,BY NAME;        
         
 /*        
 PUT SKIP LIST ('AVANT XSM702');        
 PUT SKIP DATA (JSM186.ENTREE) ;        
 */        
 CALL XSM702(JSM186,IEU001);        
 /*        
 PUT SKIP LIST ('CLAIRE_KIPS=>APRES XSM702');        
 PUT SKIP DATA (JSM186.RETOURS) ;        
 PUT SKIP DATA (JSM186.SORTIES) ;        
 PUT SKIP DATA (W_LTNMSCR) ;        
 PUT SKIP DATA (W_LTNMSCR2);        
         
         
 PUT SKIP LIST ('FAB        =>Avant modif ',substr(w_ltnmscr,45,1));        
 /* SUBSTR(W_LTNMSCR,67,1) ='E'; */        
 SUBSTR(W_LTNMSCR,45,1) ='L';        
 /*        
 PUT SKIP DATA (W_LTNMSCR) ;        
 PUT SKIP LIST ('FAB        =>APRES modif ',substr(w_ltnmscr,45,1));        
 */        
         
         
 IF JSM186.CDRTPGM ^= '' THEN        
   IF JSM186.CDRTPGM= '9' THEN        
      DO ;        
         IF JWB001.CDTRACE >= 3 THEN        
         PUT SKIP LIST ('ERREUR APPEL XSM702 , CDRTPGM=9');        
         ERREUR   = ON;        
         JWB001.LSTCALL = JSM186.LASTDLI;        
         CALL ERR_DL1;        
         RETURN;        
      END;        
   ELSE        
      DO ;        
        IF JWB001.CDTRACE >= 3 THEN        
        DO;        
        PUT SKIP LIST ('ERREUR APPEL XSM702 !!!');        
        PUT SKIP EDIT('ERREUR NON DB',JSM186.CDRTPGM)(A);        
        END;        
        ERREUR = ON;        
        RETURN;        
      END;        
         
         
 /* PUT SKIP DATA(SPA); */        
         
 DCL 1   TB_DCTT,        
      2  EL_DCTT (35),        
       3 KEY_DCTT         CHAR (09),        
       3 DATA_DCTT        CHAR (191),        
      2  NB_DCTT          FIXED (3);        
 DCL 1   LETTRE,        
      2  LIGNE (999),        
       3 CDDBCL           CHAR (01),        
       3 NOIDCL           CHAR (03),        
       3 NOSQCL           FIXED (5),        
       3 LTLILT           CHAR (75);        
 DCL 1   VARLET,        
      2  VARIAB (2000),        
       3 NOSQCL           FIXED (5),        
       3 LTTXVA           CHAR (75),        
       3 LTNMVA           CHAR (14),        
       3 NUTXVA           FIXED DEC (15,2);        
 DCL     II               FIXED BIN (31);        
         
 JSM171.IOPCB    = GA2016J.IOPCB;        
 JSM171.ALTRPCB  = GA2016J.ALTPCB;        
 JSM171.TABPCB   = GA2016J.DC105PCB;        
 JSM171.CLAUSPCB = GA2016J.DSM07PCB;        
 JSM171.DS101PCB = GA2016J.DS101PCB;        
 JSM171.DS102PCB = GA2016J.DS102PCB;        
 JSM171.DS124PCB = GA2016J.DS124PCB;        
 JSM171.DSM09PCB = GA2016J.DSM09PCB;        
 JSM171.DSM19PCB = NULL;        
 JSM171.DSM22PCB = GA2016J.DSM22PCB;        
 JSM171.DSM60PCB = GA2016J.DSM60PCB;        
 JSM171.DSM61PCB = GA2016J.DSM61PCB;        
 JSM171.DSM62PCB = GA2016J.DSM62PCB;        
 JSM171.DSM63PCB = GA2016J.DSM63PCB;        
 JSM171.DSM64PCB = GA2016J.DSM64PCB;        
 JSM171.DSM65PCB = GA2016J.DSM65PCB;        
 JSM171.DSM66PCB = GA2016J.DSM66PCB;        
 JSM171.DSM67PCB = GA2016J.DSM67PCB;        
 JSM171.DSM68PCB = GA2016J.DSM68PCB;        
 JSM171.DSM69PCB = GA2016J.DSM69PCB;        
 JSM171.DSM01PCB = GA2016J.DSM01PCB;        
 JSM171.DSM06PCB = GA2016J.DSM06PCB;        
 JSM171.DA105PCB = NULL;        
 JSM171.DA106PCB = NULL;        
 JSM171.DS137PCB = GA2016J.DS137PCB;        
 JSM171.DSMB9PCB = GA2016J.DSMB9PCB;        
         
 JSM171.NOIDAFF = SPAVAR.IDENTI.NOIDAFF;        
 JSM171.NOIDPOL = 0;        
 JSM171.NOIDSIN = SPAVAR.IDENTI.NOIDAFF;        
 IF SPAVAR.IDENTI.CDLGEAF = 'F'        
   THEN JSM171.CDCMGES = 'PWEBFR';        
   ELSE JSM171.CDCMGES = 'PWEBNL';        
 JSM171.CDOPTRN = 'S1GSI';        
 JSM171.MEMOCMD = '';        
 JSM171.MEMOCMD.CDNATOP = 'E';        
 JSM171.MEMOCMD.CDTYPOP = 'S';        
 JSM171.MEMOCMD.CDOBJOP  = '';        
 JSM171.NOSQMEM   = '';        
 JSM171.WLTNMSCR  = W_LTNMSCR;        
 JSM171.WLTNMSCR2 = W_LTNMSCR2;        
 JSM171.NBLIGNE = '';        
 JSM171.CDSCTRN = '';########################        
 /* Si fonctionne, recup. l'imprimante bureau*/        
 /* JSM171.NORFPRT = 'S52'; /*S35'; */        
 JSM171.NORFPRT = CDRFPRT_W;        
 JSM171.CDRTPGM = '';        
 JSM171.CDTTAPP = 'CC';############################        
 JSM171.LASTDLI = '';        
 JSM171.NBVAR = '';        
 /* JSM171.LTOBJOP = 'S52';*/        
 JSM171.LTOBJOP = CDRFPRT_W;        
 JSM171.LTSCTRN = 'ETHI';#########################        
         
 SUBSTR(JSM171.WLTNMSCR,54,12)= '#LTOBJOP';        
 /*        
 SUBSTR(JSM171.WLTNMSCR,45,1)= ' ';        
 put skip list('fab 54-12',SUBSTR(JSM171.WLTNMSCR,54,12));*/        
 /*        
 put skip list('fab 54-12',SUBSTR(JSM171.WLTNMSCR,54,12));        
         
 /*        
     PUT SKIP LIST ('CLAIRE_KIPS=>AVANT APPEL XSM664');        
     PUT SKIP DATA (        
       JSM171.NOIDAFF,        
       JSM171.NOIDPOL,        
       JSM171.NOIDSIN,        
       JSM171.CDCMGES,        
       JSM171.CDOPTRN,        
       JSM171.MEMOCMD,        
       JSM171.NOSQMEM,        
       JSM171.WLTNMSCR,        
       JSM171.WLTNMSCR2,        
       JSM171.NBLIGNE,        
       JSM171.CDSCTRN,        
       JSM171.NORFPRT,        
       JSM171.CDRTPGM,        
       JSM171.CDTTAPP,        
       JSM171.LASTDLI,        
       JSM171.NBVAR,        
       JSM171.LTOBJOP,        
       JSM171.LTSCTRN);        
 */        
 LETTRE = '';        
 TB_DCTT = '';        
 VARLET = '';        
         
 CALL XSM664 (IEU001, JSM171, LETTRE, TB_DCTT, VARLET);        
         
 IF JSM171.CDRTPGM ^= ''        
   THEN DO;        
     IF JWB001.CDTRACE >= 3 THEN        
     DO;        
     PUT SKIP EDIT ('PROBLEM IN XSM664')(A);        
     PUT DATA (JSM171.CDRTPGM, JSM171.LASTDLI);        
     DO II=1 TO JSM171.NBLIGNE;        
       PUT SKIP DATA (LETTRE.LIGNE(II));        
     END;        
     DO II=1 TO NB_DCTT;        
       PUT SKIP DATA (KEY_DCTT(II), DATA_DCTT(II));        
     END;        
     END;        
   END;        
 /*        
 PUT SKIP EDIT ('CLAIRE_KIPS=>APRES XSM664')(A);        
     PUT SKIP DATA (        
       JSM171.NOIDAFF,        
       JSM171.NOIDPOL,        
       JSM171.NOIDSIN,        
       JSM171.CDCMGES,        
       JSM171.CDOPTRN,        
       JSM171.MEMOCMD,        
       JSM171.NOSQMEM,        
       JSM171.WLTNMSCR,        
       JSM171.WLTNMSCR2,        
       JSM171.NBLIGNE,        
       JSM171.CDSCTRN,        
       JSM171.NORFPRT,        
       JSM171.CDRTPGM,        
       JSM171.CDTTAPP,        
       JSM171.LASTDLI,        
       JSM171.NBVAR,        
       JSM171.LTOBJOP,        
       JSM171.LTSCTRN);        
 */        
         
     TRACE = 'GA2016C ===> ' !! 'END IMP_DEVIS';        
         
     CALL PT;        
 $END IMPRIMER_DEVIS;        
 /*-----------------------------------------------------------------*/        
 F_MTCTF: PROC(MT_W,DC_W) RETURNS(FIXED(15));        
             TRACE = 'GA2016C ===> ' !! 'F_MTCTF';        
         
             CALL PT;        
 /***********************************        
 * CONVERSION MONTANT CHAR EN FIXED *        
 * RETURN : MONTANT EN FIXED        *        
 ***********************************/        
 DCL MT_W CHAR(*); ################################        
 DCL DC_W PIC '9';   ##################################        
         
 KGI012J = '';        
 KGI012J_RI = '';        
 KGI012J_RO = '';        
 KGI012J_RI.CDFMTMT  = 'LTIN_C25';        
 KGI012J_RI.CDDVTRN  = IEU001.CDDVTRN;        
 KGI012J_RI.CDLGTRN  = SPA.CDLGTRN;        
 KGI012J_RI.LTIN_C25 = MT_W;        
 KGI012J_RI.NBDECIN  = DC_W;        
 JWB001.LTNMMTH = 'VALID_MONTANT';        
 JWB001.LSTCALL = 'FMTCF.1';        
 KGI012J_RI.TBEGCOD(1) = ON;###########################        
 KGI012J_RI.TBEGCOD(2) = ON;#############################################        
 KGI012J_RI.TBEGCOD(3) = ON;#############################################        
 KGI012J_RI.TBEGCOD(5) = ON;#############################################        
 KGI012J_RI.TBEGCOD(7) = ON;#############################################        
         
 CALL KGI012(IEU001,JWB001,KGI012J);        
         
 SELECT(JWB001.CDRTPGM);        
   WHEN('') RETURN(KGI012J_RO.MTMNT_F15);        
   OTHER DO;        
         IF JWB001.CDTRACE >= 3 THEN        
         PUT SKIP EDIT('ERREUR INTERNE CONVERSION MONTANT')(A);        
         ERREUR = ON;        
   END;        
 END;        
         
 RETURN(0);        
         
 $END F_MTCTF;        
         
 /*------------------------------------------------------------------*/        
 F_MTFTC: PROC(MT_W,MS_W,DC_W,LN_W) RETURNS(CHAR(10));        
         TRACE = 'GA2016C ===> ' !! 'F_MTFTC';        
         
         CALL PT;        
 /*******************************        
 * FORMATAGE DU MONTANT         *        
 * RETURN : MONTANT FORMATE     *        
 *******************************/        
 DCL MT_W              FIXED(15);        
 DCL MS_W              CHAR(11);        
 DCL DC_W              PIC '9';        
 DCL LN_W              PIC '99';        
         
 KGI012J_RI = '';        
 KGI012J_RO = '';        
 KGI012J_RI.CDFMTMT     = 'MTIN_F15';        
 KGI012J_RI.CDDVTRN     = IEU001.CDDVTRN;        
 KGI012J_RI.CDLGTRN     = SPA.CDLGTRN;        
 KGI012J_RI.MTIN_F15 = MT_W;        
 KGI012J_RI.CDMSKOUT = MS_W;        
 KGI012J_RI.NBLENOUT = LN_W;        
 KGI012J_RI.NBDECIN  = DC_W;        
 JWB001.LTNMMTH = 'FORMATAGE';        
 JWB001.LSTCALL = 'FIX_TO_CH.1';        
         
 CALL KGI012(IEU001,JWB001,KGI012J);        
         
 SELECT(JWB001.CDRTPGM);        
   WHEN('') RETURN(SUBSTR(KGI012J_RO.LTMNT_C26, 1,LN_W));        
   OTHER    RETURN('');        
 END;        
         
 $END F_MTFTC;        
         
 /*------------------------------------------------------------------*/        
         
 /*------------------------------------------------------------------*/        
         
 STATSITE: PROC (TYPE,CPTEUR,IND,CDMAJ);        
        TRACE='===> STATSITE  <===';        
      CALL PT;        
         
 DCL     DATEINVR           PIC '(7)9',        
     1   DATEIR                         DEF DATEINVR,        
      2  SS                 PIC '9',        
      2  AA                 PIC '99',        
      2  MM                 PIC '99',        
      2  JJ                 PIC '99';        
 /***********************************************        
 *  Appel interface statistiques devis internet *        
 ***********************************************/        
 /*    compteur 1  = nbre de devis anonymes        
                2  = nbre de branchement vers l'identification        
                3  = nbre de nouveaux prospects        
                4  = nbre de prospects confirmes        
                5  = nbre de devis identifies        
                6  = nbre de souscriptions avec CDR ok        
                7  = nbre de documentations demandee        
                8  = nbre de rejet au CDR        
                9  = nbre de contact CC        
               10  = nbre de contact e-mail        
               11  = nbre de contact courrier        
               12  = nbre de devis sauves en My Ethias        
               13  = nbre envoi de devis par mail        
         
       TYPE = CHAR(8)        
            = F/N(1) !! KERNEL(2) !! PRODUIT (5)        
       IND = indice de l'element du tableau        
       CDMAJ =  'C' memoriser compteur stat        
                'M' memoriser ET appel  e xsm532        
 */        
 DCL 1 TYPE_R DEF TYPE,        
       2 CDLGTYP  CHAR(1),        
       2 CDPRTYP  CHAR(7);        
         
 DCL TYPEXT   CHAR(10);        
 DCL TYPET    CHAR(8);        
 DCL TYPE     CHAR(8);        
 DCL SITE     CHAR(10);        
 DCL CPTEUR   PIC'99';        
 DCL IND      FIXED BIN(15);        
 DCL CDMAJ    CHAR;        
 IF IND = 0  THEN IND = 1;        
 DATEINVR = #DATE_SAAMMJJ;        
         
 IF IND = 1 THEN DO;        
    JSM131.PARAM = '';        
    JSM131.ALTPCB = ALTPCB;        
    JSM131.CDSCTRN = '';        
    JSM131.CDEVTRN = IEU001_R.CDEVTRN;        
    JSM131.NBTYSTA = 0;        
 END;        
         
    TYPET = TRANSLATE(TYPE,'.',' ');        
    IF TYPE ^= TYPET THEN        
    DO;        
    TYPE = TYPET;        
    END;        
         
         
 IF JWB001.CDEVCLI = 'E' &        
 /******************************************        
 * ALIMENTATION COMPTEUR Extranet          *        
 *                                         *        
 * si on est en extranet, le type contient *        
 *    le r{parateur (entr{e de la table    *        
 *    EXRA)                                *        
 *                                         *        
 *                                         *        
 ******************************************/        
   (CPTEUR = 1 ! CPTEUR = 6)        
    THEN DO;                                                                    
    TYPEXT = SUBSTR(SPA.INFOS_USER.TYPUSER,1,2)!!        
             SUBSTR(SPA.INFOS_USER.NOIDUSR,4)!!        
             SPA.INFOS_USER.NOSQUSR !!        
             SUBSTR(TYPE,2,2); #####################        
         
    TYPEXT = TRANSLATE(TYPEXT,'+',' ');        
    JSM131.NBTYSTA = JSM131.NBTYSTA + 1;        
    JSM131.CDTYSTA(JSM131.NBTYSTA) = 'EXRAG';                                   
    JSM131.MTVAINC(JSM131.NBTYSTA) = 1;        
    JSM131.DAOPGES(JSM131.NBTYSTA) = DATEINVR;        
    JSM131.LTIDCLE(JSM131.NBTYSTA) = TYPEXT;        
    SELECT (CPTEUR);        
    WHEN (1) JSM131.NOIDCPT(JSM131.NBTYSTA) = 1 ;#########################        
    WHEN (6) JSM131.NOIDCPT(JSM131.NBTYSTA) = 2 ;#########################        
    OTHER;        
    END;        
    IF CDMAJ= 'M' ! JSM131.NBTYSTA = 9 THEN DO;        
        CALL XSM532(JSM131);        
        IF JSM131.CDRTPGM ^='' THEN        
        DO;        
           RETURN;        
        END;        
    END;        
    RETURN;        
    END;        
         
 /* if spa.cdstat ^= 'MYETH' then do; */        
    JSM131.NBTYSTA = JSM131.NBTYSTA + 1;        
    JSM131.CDTYSTA(JSM131.NBTYSTA) = 'ETHW1';        
    JSM131.NOIDCPT(JSM131.NBTYSTA) = CPTEUR;        
    JSM131.MTVAINC(JSM131.NBTYSTA) = 1;        
    JSM131.DAOPGES(JSM131.NBTYSTA) = DATEINVR;        
    JSM131.LTIDCLE(JSM131.NBTYSTA) = TYPE;        
 /* end; */        
         
    IF SPA.CDMSETH = 'Y' THEN DO;        
    JSM131.NBTYSTA = JSM131.NBTYSTA + 1;        
    JSM131.CDTYSTA(JSM131.NBTYSTA) = 'ETHW3';        
    JSM131.NOIDCPT(JSM131.NBTYSTA) = CPTEUR;        
    JSM131.MTVAINC(JSM131.NBTYSTA) = 1;        
    JSM131.DAOPGES(JSM131.NBTYSTA) = DATEINVR;        
    JSM131.LTIDCLE(JSM131.NBTYSTA) = TYPE;        
    END;        
 /**************************************        
 * ALIMENTATION COMPTEUR PARTENAIRES   *        
 **************************************/        
 IF                                                                             
   (SPA.CDSTAT ^= '' & SPA.CDSTAT ^= 'MYETH')  &                                
   (CPTEUR = 1 ! CPTEUR = 6 ! CPTEUR =7 !        
    CPTEUR = 9 ! CPTEUR = 10 ! CPTEUR= 11)        
    THEN DO;                                                                    
 /* TYPE = SUBSTR(TYPE,2); */        
    JSM131.NBTYSTA = JSM131.NBTYSTA + 1;        
    JSM131.CDTYSTA(JSM131.NBTYSTA) = SPA.CDSTAT;                                
    JSM131.MTVAINC(JSM131.NBTYSTA) = 1;        
    JSM131.DAOPGES(JSM131.NBTYSTA) = DATEINVR;        
    IF SPA.CDSTAT = 'INTPA' ! SPA.CDSTAT = 'INTAF' !        
       SPA.CDSTAT = 'SELFI'        
       THEN JSM131.LTIDCLE(JSM131.NBTYSTA) = SPA.LTSITE !! CDPRTYP;        
       ELSE JSM131.LTIDCLE(JSM131.NBTYSTA) = CDPRTYP;                           
    SELECT (CPTEUR);        
    WHEN (1) JSM131.NOIDCPT(JSM131.NBTYSTA) = 1;        
    WHEN (6) JSM131.NOIDCPT(JSM131.NBTYSTA) = 2;        
    WHEN (7) JSM131.NOIDCPT(JSM131.NBTYSTA) = 3;        
    WHEN (9,10,11) JSM131.NOIDCPT(JSM131.NBTYSTA) = CPTEUR - 5;        
    OTHER;        
    END;        
    END;        
 IF JSM131.NBTYSTA = 9 THEN DO;        
    JSM131.PARAM = '';        
    JSM131.ALTPCB = ALTPCB;        
    JSM131.CDSCTRN = '';        
    JSM131.CDEVTRN = IEU001_R.CDEVTRN;        
    JSM131.NBTYSTA = 0;        
 END;        
 /**************************************        
 * ALIMENTATION COMPTEUR MY ETHIAS     *        
 **************************************/        
 IF                                                                             
   SPA.CDSTAT = 'MYETH' &                                                       
   (CPTEUR = 1 ! CPTEUR = 6 ! CPTEUR = 12)        
    THEN DO;                                                                    
    JSM131.NBTYSTA = JSM131.NBTYSTA + 1;        
    JSM131.CDTYSTA(JSM131.NBTYSTA) = 'MYSMA';                                   
    JSM131.MTVAINC(JSM131.NBTYSTA) = 1;        
    JSM131.DAOPGES(JSM131.NBTYSTA) = DATEINVR;        
    IF SPA.CDLGTRN = 1        
       THEN JSM131.LTIDCLE(JSM131.NBTYSTA) = 'METHFR' !! CDPRTYP;        
       ELSE JSM131.LTIDCLE(JSM131.NBTYSTA) = 'METHNL' !! CDPRTYP;               
    SELECT (CPTEUR);        
    WHEN (1) JSM131.NOIDCPT(JSM131.NBTYSTA) = 13;#########################        
    WHEN (6) JSM131.NOIDCPT(JSM131.NBTYSTA) = 11;#########################        
    WHEN (12) JSM131.NOIDCPT(JSM131.NBTYSTA) = 14;############################        
    OTHER;        
    END;        
    END;        
         
 IF CDMAJ= 'M' ! JSM131.NBTYSTA = 9 THEN DO;        
     CALL XSM532(JSM131);        
     IF JSM131.CDRTPGM ^='' THEN        
     DO;        
        RETURN;        
     END;        
 END;        
 IF JSM131.NBTYSTA = 9 THEN DO;        
    JSM131.PARAM = '';        
    JSM131.ALTPCB = ALTPCB;        
    JSM131.CDSCTRN = '';        
    JSM131.CDEVTRN = IEU001_R.CDEVTRN;        
    JSM131.NBTYSTA = 0;        
 END;        
 $END STATSITE;        
 /*------------------------------------------------------------*/        
 /* ------------------------------------------------------------------*/        
 $$END GA2016C;        
