 GA2016E:PROC OPTIONS(MAIN)(IEU001,JWB001) OPTIONS(FETCHABLE) REORDER;        
 /********************************************************************/        
 /* GA2016E                                                          */        
 /*                                                                  */        
 /*                                                                  */        
 /*         DEVIS AUTO INTERNET ETHIAS / MY ETHIAS / AFFINITY        */        
 /*                                                                  */        
 /*               SCENARIO 14 : CONSULTER DEVIS DANS MY ETHIAS       */        
 /*                             IMPRIMER UN DEVIS                    */        
 /*               ============================================       */        
 /*                                                                  */        
 /********************************************************************/        
 /* EURO=YES AUTHOR=TDMKIP/KIPS C.       INTERV= KIPS C.      .......*/        
 /*                                                                  */        
 /********************************************************************/        
 /*  -------------------------------                                 */        
 /*  -  M O D I F I C A T I O N S  -                                 */        
 /*------------------------------------------------------------------*/        
 /* TDMKIP ! 27/08/03 ! CREATION DU PROGRAMME                        */        
 /* TDMSOX ! 10/04/08 ! Mobilite plus                                */        
 /* TDMBGN ! 05/11/08 ! #002 ! ADAPTATION A LA TABLE 500             */        
 /* TDMKIP ! 15/06/10 ! #003 ! Nouveaux tarif V3 (projet 15250)      */        
 /********************************************************************/        
         
         
 DCL ABS       BUILTIN;        
 DCL ADDR      BUILTIN;        
 DCL CEIL      BUILTIN;        
 DCL DATE      BUILTIN;        
 DCL DATETIME  BUILTIN;        
 DCL DIM       BUILTIN;        
 DCL FLOOR     BUILTIN;        
 DCL INDEX     BUILTIN;        
 DCL LENGTH    BUILTIN;        
 DCL LOW       BUILTIN;        
 DCL MAX       BUILTIN;        
 DCL MIN       BUILTIN;        
 DCL MOD       BUILTIN;        
 DCL NULL      BUILTIN;        
 DCL ONCODE    BUILTIN;        
 DCL ONLOC     BUILTIN;        
 DCL REPEAT    BUILTIN;        
 DCL STG       BUILTIN;        
 DCL SUBSTR    BUILTIN;        
 DCL TIME      BUILTIN;        
 DCL TRANSLATE BUILTIN;        
 DCL UNSPEC    BUILTIN;        
 DCL VERIFY    BUILTIN;        
 /* TDMOHL 03/05/2005 AJOUT DE ONSOURCE, PLIRETC ET PLIRETV */        
 DCL ONSOURCE  BUILTIN;        
 DCL PLIRETC   BUILTIN;        
 DCL PLIRETV   BUILTIN;        
         
 /* TDMSLE : 041103 */        
 DCL CENTER    BUILTIN;        
 DCL LEFT      BUILTIN;        
 DCL RIGHT     BUILTIN;        
 DCL TRIM      BUILTIN;        
 DCL UPPERCASE BUILTIN;        
 DCL PTRADD    BUILTIN;        
 /* TDMSLE FIN : 041103 */        
         
 /* TDMSLE : 041103 -                                         */        
 /*  MISE EN COMMENTAIRE CAR IL FAUT UTILISER 'TRIM' DE VAPLI */        
 /* DCL TRIM      EXT ENTRY RETURNS(CHAR(133) VAR BYVALUE);   */        
 /* DCL LTRIM     EXT ENTRY RETURNS(CHAR(133) VAR BYVALUE);   */        
 /* DCL RTRIM     EXT ENTRY RETURNS(CHAR(133) VAR BYVALUE);   */        
 /* TDMSLE FIN : 041103                                       */        
         
 /*--------------------------------------------------------- ATTRINIT */        
  /* Enterprise PL1*/        
 DCL ATTR1 CHAR(2) VALUE('00C8'X); ##############################        
 DCL ATTR2 CHAR(2) VALUE('00C9'X); ############################        
 DCL ATTR3 CHAR(2) VALUE('00F1'X); ###########################        
 DCL ATTR4 CHAR(2) VALUE('00F9'X); ##############################        
 DCL ATTR5 CHAR(2) VALUE('00E1'X); #######################        
 DCL ATTR6 CHAR(2) VALUE('00F0'X); #############################        
 DCL ATTR7 CHAR(2) VALUE('00F8'X); ################################        
 DCL ATTR8 CHAR(2) VALUE('00D9'X); ################################        
         
 DCL NUMERR_E CHAR(2) VALUE('C0D9'X); ################################        
 DCL ALPERR_E CHAR(2) VALUE('C0C9'X); ################################        
 DCL NUMCSR_E CHAR(2) VALUE('C0D1'X); ################################        
 DCL ALPCSR_E CHAR(2) VALUE('C0C1'X); ################################        
 DCL NUMDEP_E CHAR(2) VALUE('00D1'X); ################################        
 DCL ALPDEP_E CHAR(2) VALUE('00C1'X); ################################        
 DCL NODCSR_E CHAR(2) VALUE('C0C5'X); ################################        
 DCL NODDEP_E CHAR(2) VALUE('00C5'X); ################################        
 DCL NODPRT_E CHAR(2) VALUE('00E5'X); ################################        
         
 DCL HEX00 CHAR(1)   VALUE('00'X);        
 DCL HEX02 CHAR(1)   VALUE('02'X);   ################################        
 DCL HEXFF CHAR(1)   VALUE('FF'X);        
 DCL HEX3F CHAR(1)   VALUE('3F'X);        
 DCL HEX15 CHAR(1)   VALUE('15'X);  ##################        
 DCL HEX4A CHAR(1)   VALUE('4A'X);  ###################        
 DCL HEX403F CHAR(2) VALUE('403F'X);        
 DCL HEX40 CHAR(1)   VALUE('40'X);        
 DCL HEX4B CHAR(1)   VALUE('4B'X);        
 DCL SCA1  CHAR(2)   VALUE('0080'X); #########################        
 DCL SCA2  CHAR(2)   VALUE('00C0'X); ##################################        
 DCL SCA3  CHAR(2)   VALUE('00A0'X); ############################################        
 DCL SCA4  CHAR(2)   VALUE('0090'X); ############################        
 /*----------------------------------------------------- END ATTRINIT */        
 /* -------------------------------------------------------- ATTRIMOD */        
 /* exemples:   ZONE_A   CHAR(6)                                      */        
 /*  reverse:   ZONE_A = '  '!!REV_E;                                 */        
 /*  neutral:   ZONE_A = '  '!!NEU_E;                                 */        
 /*  rev+neu:   ZONE_A = '  '!!REV_E!!NEU_E;                          */        
 /* sans effet: ZONE_A = SEF_E;                                       */        
 /* ----------- 1 Commentaire = 1 ligne ---------------- JCC 09-12-02 */        
         
         
 DCL    SEF_E   CHAR(6)  STATIC INIT('');  ##########################        
        SEF_E  = LOW(LENGTH(SEF_E));        
 DCL    BLI_E   CHAR(2)  STATIC ,     #############################        
        REV_E   CHAR(2)  STATIC ,     #############################        
        UND_E   CHAR(2)  STATIC ;     #############################        
 UNSPEC(BLI_E) = '1100000111110001'B;        
 UNSPEC(REV_E) = '1100000111110010'B;        
 UNSPEC(UND_E) = '1100000111110100'B;        
 DCL    BLU_E   CHAR(2)  STATIC ,     #############################        
        RED_E   CHAR(2)  STATIC ,     #############################        
        PIN_E   CHAR(2)  STATIC ,     #############################        
        GRN_E   CHAR(2)  STATIC ,     #############################        
        TRQ_E   CHAR(2)  STATIC ,     #############################        
        YEL_E   CHAR(2)  STATIC ,     #############################        
        NEU_E   CHAR(2)  STATIC ;     #############################        
 UNSPEC(BLU_E) = '1100001011110001'B;        
 UNSPEC(RED_E) = '1100001011110010'B;        
 UNSPEC(PIN_E) = '1100001011110011'B;        
 UNSPEC(GRN_E) = '1100001011110100'B;        
 UNSPEC(TRQ_E) = '1100001011110101'B;        
 UNSPEC(YEL_E) = '1100001011110110'B;        
 UNSPEC(NEU_E) = '1100001011110111'B;        
 /*----------------------------------------------------- END ATTRIMOD */        
         
 /*---------------------------------------------------------- $DATTIM */        
 /*      Date & Heure ordinateur sous toutes les formes     */        
 /*     ------------------------------------------------    */        
 /*     ->     call $Dates_Times pour rafraichir      <-    */        
 /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - */        
 DCL $DATE_TIME          CHAR(17) INIT(''); #################################        
 DCL $DATE_MSK           CHAR(17);        
 DCL $DATE_HEURE         CHAR(18) INIT(''); #################################        
 DCL 1 $DATE_TIME_W BASED(ADDR($DATE_TIME)),        
      2 S    CHAR(1),        
      2 A    CHAR(1),        
      2 AA   CHAR(2),        
      2 MM   CHAR(2),        
      2 JJ   CHAR(2),        
      2 HH   CHAR(2),        
      2 MI   CHAR(2),        
      2 SS   CHAR(2),        
      2 CCC  CHAR(3);        
         
 DCL $DATE_AAAAMMJJ      CHAR(08);    ####################################        
 DCL #DATE_AAAAMMJJ      PIC'(08)9'        
      BASED(ADDR($DATE_AAAAMMJJ));        
 DCL $DATE_AAMMJJ        CHAR(06);    ####################################        
 DCL #DATE_AAMMJJ        PIC'(06)9'        
      BASED(ADDR($DATE_AAMMJJ));        
 DCL $DATE_SAAMMJJ       CHAR(07);    ####################################        
 DCL #DATE_SAAMMJJ       PIC'(07)9'        
      BASED(ADDR($DATE_SAAMMJJ));        
 DCL $DATE_JJMMAAAA      CHAR(08);    ####################################        
 DCL #DATE_JJMMAAAA      PIC'(08)9'        
      BASED(ADDR($DATE_JJMMAAAA));        
 DCL $DATE_JJMMAA        CHAR(06);    ####################################        
 DCL #DATE_JJMMAA        PIC'(06)9'        
      BASED(ADDR($DATE_JJMMAA));        
         
 DCL $DATE_AAAA          CHAR(04);    ####################################        
 DCL #DATE_AAAA          PIC'(04)9'        
      BASED(ADDR($DATE_AAAA));        
 DCL $DATE_AA            CHAR(02);    ####################################        
 DCL #DATE_AA            PIC'(02)9'        
      BASED(ADDR($DATE_AA));        
 DCL $DATE_S             CHAR(01);    ####################################        
 DCL #DATE_S             PIC'(01)9'        
      BASED(ADDR($DATE_S));        
 DCL $DATE_SAA           CHAR(03);    ####################################        
 DCL #DATE_SAA           PIC'(03)9'        
      BASED(ADDR($DATE_SAA));        
         
 DCL $DATE_MM            CHAR(02);    ####################################        
 DCL #DATE_MM            PIC'(02)9'        
      BASED(ADDR($DATE_MM));        
 DCL $DATE_JJ            CHAR(02);    ####################################        
 DCL #DATE_JJ            PIC'(02)9'        
      BASED(ADDR($DATE_JJ));        
         
 DCL $TIME_HHMMSSCCC     CHAR(09);    ####################################        
 DCL #TIME_HHMMSSCCC     PIC'(09)9'        
      BASED(ADDR($TIME_HHMMSSCCC));        
 DCL $TIME_HHMMSS        CHAR(06);    ####################################        
 DCL #TIME_HHMMSS        PIC'(06)9'        
      BASED(ADDR($TIME_HHMMSS));        
 DCL $TIME_HHMM          CHAR(04);    ####################################        
 DCL #TIME_HHMM          PIC'(04)9'        
      BASED(ADDR($TIME_HHMM));        
 DCL $TIME_HH            CHAR(02);    ####################################        
 DCL #TIME_HH            PIC'(02)9'        
      BASED(ADDR($TIME_HH));        
 DCL $TIME_MM            CHAR(02);    ####################################        
 DCL #TIME_MM            PIC'(02)9'        
      BASED(ADDR($TIME_MM));        
         
 DCL $DATE_JJ_MM_AAAA    CHAR(10);    ####################################        
 DCL $DATE#JJ#MM#AAAA    CHAR(10);    ####################################        
 DCL $DATE_JJ_MM_AA      CHAR(08);    ####################################        
         
 DCL $TIME_HH_MM_SS_CCC  CHAR(12);    ####################################        
 DCL $TIME_HH_MM_SS      CHAR(08);    ####################################        
 DCL $TIME#HH#MM#SS      CHAR(08);    ####################################        
 DCL $TIME_HH_MM         CHAR(05);    ####################################        
         
 DCL $TIME_STAMP         CHAR(26);    ###########################################        
 DCL $TIME_STAMP_PL1     CHAR(20);    ###########################################        
 /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - */        
 $DATE_MSK = 'ABCDEFGHIJKLMNOPQ';        
         
 CALL $DATES_TIMES;        
         
 $DATES_TIMES: PROC;        
 $DATE_TIME      = DATETIME();        
 $DATE_HEURE     = $DATE_TIME_W.JJ!!'/'!!$DATE_TIME_W.MM!!'/'!!        
                   $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                   ' - '!!$DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI;        
 $DATE_AAAAMMJJ     = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                      $DATE_TIME_W.MM!!$DATE_TIME_W.JJ;        
 $DATE_JJMMAAAA     = $DATE_TIME_W.JJ!!$DATE_TIME_W.MM!!$DATE_TIME_W.S!!        
                      $DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE_AAMMJJ       = $DATE_TIME_W.AA!!$DATE_TIME_W.MM!!$DATE_TIME_W.JJ;        
 $DATE_JJMMAA       = $DATE_TIME_W.JJ!!$DATE_TIME_W.MM!!$DATE_TIME_W.AA;        
 $DATE_SAAMMJJ      = $DATE_TIME_W.S!!$DATE_TIME_W.AA!!$DATE_TIME_W.MM!!        
                      $DATE_TIME_W.JJ;        
 $DATE_AAAA         = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE_AA           = $DATE_TIME_W.AA;        
 $DATE_S            = $DATE_TIME_W.S;        
 $DATE_SAA          = $DATE_TIME_W.S!!$DATE_TIME_W.AA;        
 $DATE_MM           = $DATE_TIME_W.MM;        
 $DATE_JJ           = $DATE_TIME_W.JJ;        
 $DATE_JJ_MM_AAAA   = $DATE_TIME_W.JJ!!'/'!!        
                      $DATE_TIME_W.MM!!'/'!!$DATE_TIME_W.S!!        
                      $DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE#JJ#MM#AAAA   = $DATE_TIME_W.JJ!!'.'!!        
                      $DATE_TIME_W.MM!!'.'!!$DATE_TIME_W.S!!        
                      $DATE_TIME_W.A!!$DATE_TIME_W.AA;        
 $DATE_JJ_MM_AA     = $DATE_TIME_W.JJ!!'/'!!        
                      $DATE_TIME_W.MM!!'/'!!$DATE_TIME_W.AA;        
 $TIME_HHMMSSCCC    = $DATE_TIME_W.HH!!$DATE_TIME_W.MI!!        
                      $DATE_TIME_W.SS!!$DATE_TIME_W.CCC;        
 $TIME_HHMMSS       = $DATE_TIME_W.HH!!$DATE_TIME_W.MI!!        
                      $DATE_TIME_W.SS;        
 $TIME_HHMM         = $DATE_TIME_W.HH!!$DATE_TIME_W.MI;        
 $TIME_HH           = $DATE_TIME_W.HH;        
 $TIME_MM           = $DATE_TIME_W.MI;        
 $TIME_HH_MM_SS_CCC = $DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI!!':'!!        
                      $DATE_TIME_W.SS!!':'!!$DATE_TIME_W.CCC;        
 $TIME_HH_MM_SS     = $DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI!!':'!!        
                      $DATE_TIME_W.SS;        
 $TIME#HH#MM#SS     = $DATE_TIME_W.HH!!'.'!!$DATE_TIME_W.MI!!'.'!!        
                      $DATE_TIME_W.SS;        
 $TIME_HH_MM        = $DATE_TIME_W.HH!!':'!!$DATE_TIME_W.MI;        
 $TIME_STAMP        = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                      '-'!!$DATE_TIME_W.MM!!'-'!!$DATE_TIME_W.JJ!!'-'!!        
                      $DATE_TIME_W.HH!!'.'!!$DATE_TIME_W.MI!!'.'!!        
                      $DATE_TIME_W.SS!!'.'!!$DATE_TIME_W.CCC!!'000';        
 $TIME_STAMP_PL1    = $DATE_TIME_W.S!!$DATE_TIME_W.A!!$DATE_TIME_W.AA!!        
                      $DATE_TIME_W.MM!!$DATE_TIME_W.JJ!!        
                      $DATE_TIME_W.HH!!$DATE_TIME_W.MI!!        
                      $DATE_TIME_W.SS!!$DATE_TIME_W.CCC!!'000';        
 $END $DATES_TIMES;        
 /*------------------------------------------------------ END $DATTIM */        
         
 /********************************************        
 * DECLARATION DES PARAMETRES DE LA ROUTINE  *        
 ********************************************/        
 /*********************************************************************/        
 /*                                                                   */        
 /*         INTERFACE DE COMMUNICATION AVEC BEU001                    */        
 /*         ======================================                    */        
 /*                                                                   */        
 /* USAGE :                                                           */        
 /* CALL BEU001(IEU001,COUNT,FUNCT,DATAPCB,IOAREA,                    */        
 /*             SSA1, SSA2, SSA3, SSA4, SSA5, SSA6, SSA7);            */        
 /*********************************************************************/        
 /* MODE CONVERSION :                                                 */        
 /*                                                                   */        
 /* CALL BEU001(IEU001,THREE,'GCV',DATAPCB,IOAREA);                   */        
 /*                                                                   */        
 /*********************************************************************/        
 /*                                                                   */        
 /* PROCEDURE DE COMPILATION : TDMFOG.LIB.CNTL(FETCH)                 */        
 /* MODULE A TRANSFERER PAR L'EQUIPE SYSTEME : FEUT.T.LOAD(BEU001)    */        
 /*                                                                   */        
 /*********************************************************************/        
 /* DESCRIPTION DES MESSAGES D'ERREURS : CDRTPGM                      */        
 /* -----------------------------------                               */        
 /* DB : PROBLEME BASE DE DONNEES : VOIR LE PCB DATA                  */        
 /* 01 : COEFFICIENT DE CONVERSION EURO --> FB ERRONE                 */        
 /* 02 : PARAM. CODE DEVISE DIFFERENT DE 'F' ET 'E'                   */        
 /* 03 : PARAM. CODE PAGE DIFFERENT DE '500' ET '274'                 */        
 /* 04 : PARAM. CODE USAGE APPLICATION DIFF. DE : 3 = 3270            */        
 /*                                        P = HOST PRINTER           */        
 /*                                        L = LOCAL PRINTER          */        
 /*                                        Q = MQSERIES               */        
 /* 05 : CODE DEVISE MAL INSTALLE DANS LE DICTIONNAIRE                */        
 /* 06 : CODE PAGE MAL INSTALLE DANS LE DICTIONNAIRE                  */        
 /* 07 : CODE VERSION DE LA DB MAL INSTALLE DANS LE DICTIONNAIRE      */        
 /* 08 : DESCRIPTION FORME EXTERNE DU SEGMENT ABSENTE DU DICTIONNAIRE */        
 /* 09 : ERREUR BASE DE DONNEE SUR LA DB DICTIONNAIE                  */        
 /* 10 : LONGUEUR D'ATTRIBUT MODIFIEE POUR FORMAT TYPE : BF/BE/DE     */        
 /* 11 : LE FORMAT DE MONTANT DEVISE OU DATE  <> DZ/DF/BF             */        
 /* 12 : EN ISRT, REPL, LA DATE DOIT OBLIG. ETRE EXPRIMEE EN SAAMMJJ  */        
 /* 13 : FORMAT DE DONNEE NON RECONNU                                 */        
 /* 14 : LONGUEUR EN BYTE INADEQUATE POUR UN TYPE BF                  */        
 /* 15 : LONGUEUR TYPE BF <> 2/4                                      */        
 /* 16 : LONGUEUR TYPE DE/BE <> 4/8                                   */        
 /* 17 : EN ISRT, REPL, LA D. COMPLEM. DOIT ETRE EXPRIMEE EN SAAMMJJ  */        
 /* 18 : MONTANT AU FORMAT ZONED DECIMAL NON NUMERIQUE EN LECTURE     */        
 /* 19 : MONTANT AU FORMAT PACKED DECIMAL NON NUMERIQUE EN LECTURE    */        
 /* 20 : MONTANT AU FORMAT ZONED DECIMAL NON NUMERIQUE EN M A J       */        
 /* 21 : MONTANT AU FORMAT PACKED DECIMAL NON NUMERIQUE EN M A J      */        
 /* 22 : COUNT < 2 OU > 10                                            */        
 /* 23 : FONCTION NON IMPLEMENTEE CAR NON SPECIFIQUE A DL1            */        
 /* 24 : FONCTION INCONNUE                                            */        
 /* 25 : NOMBRE D'ATTRIBUTS DU SEGMENT DEPASSANT LE MAXIMUM AUTORISE  */        
 /* 26 : LONGUEUR DE RUBRIQUE MAL DEFINIE AU DICTIONNAIRE             */        
 /* 27 : COUNT PARAMETER > 7                                          */        
 /* 28 : PROTOCOLE EURO POSTPOSE JUSQU'A LA CONVERSION DE LA CAISSE   */        
 /* 29 : PARAMETRE SOCIETE NON RECONNU                                */        
 /* 30 : PROTOCOLE EURO INTERDIT CAR DB NON CONVERTIE A L'EURO        */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1     IEU001,        
 /*------------------------- I N P U T -------------------------------*/        
      2    PTR,                        #################################################################        
       3   METAPCB      PTR,           ####################################################        
       3   ALTPCB       PTR,           ####################################################        
      2    INPUT,                      ###############################################################        
       3   LTSCTRN      CHAR (4),      ###############################################        
       3   CDDVTRN      CHAR (3),      ###############################################        
       3   CDPGTRN      CHAR (3),      ###############################################        
       3   CDTYUSR      CHAR (1),      ###############################################        
       3   CDPGMID      CHAR (8),      ###############################################        
       3   CDDFSEG      CHAR (8),      ###############################################        
       3   LASTCALL     CHAR (30),     ##############################################        
       3   TBEGCOD(32)  BIT(1),        #################################################        
                                       /*--!  BIT 1: MAJ EURO         */        
                                       /*--!    AUTORISEE AVANT PIVOT */        
                                       /*--!  BIT 2: NE PAS CONVERTIR */        
                                       /*--!  BIT 3: MAJ BEF          */        
                                       /*--!    AUTORISEE APRES PIVOT */        
       3   TBDISPO(128),        
        4  DBDNAME      CHAR(8),       ################################################        
        4  DBSTATE      CHAR(1),       ################################################        
                                       /*--! 0 : UPDATABLE            */        
                                       /*--! 1 : READ ONLY (NU)       */        
                                       /*--! 2 : NO ACCESS (NA)       */        
       3   FILLER       CHAR(200),     ##############################################        
         
 /*------------------------ O U T P U T ------------------------------*/        
      2    OUTPUT,                     ##############################################################        
       3   CDRTPGM      CHAR (6),      ###############################################        
       3   LTRTPGM      CHAR (60),     ##############################################        
       3   DBPTR        PTR,           ####################################################        
       3   LASTDLI      CHAR (10);     ##############################################        
         
 /*------------------- REDEFINITIONS DE IEU001 -----------------------*/        
 DCL 1     IEU001_R     BASED(ADDR(IEU001.INPUT.FILLER)),        
       2   CDEVTRN      CHAR(001),     ##############################################        
                                       /*--!  P : VALEUR PAR DEFAUT   */        
       2   CDDEVDB      CHAR(003),     ##############################################        
                                       /*--!  BEF / EUR               */        
       2   TBDFDBD_PTR  PTR,        
       2   TBDFATT_PTR  PTR,        
       2   TBDFSEG_PTR  PTR,        
       2   SYSTIME      BIN FIXED(31),        
       2   DATEORD      PIC '(7)9',        
       2   NBMXCOP_C    FIXED BIN(15),        
       2   FILLER       CHAR(170);     ##############################################        
 /*********************************************************************/        
              /* INTERFACE DL1          */        
 DCL 1    GA2016J           BASED(JWB001.GXXXXXJ_P),        
 /*------------------------- I N P U T -------------------------------*/        
      2   INPUT,        
       3  IOPCB             PTR,        
       3  ALTPCB            PTR,        
       3  PRTPCB            PTR,        
       3  SPA_PTR           PTR,        
       3  MID_PTR           PTR,        
       3  PAGE_PTR          PTR,        
       3  PAGEER_PTR        PTR,        
       3  LTNMMTH           CHAR(20),        
       3  DXI10PCB          PTR,                                                
       3  DC105PCB          PTR,                                                
       3  DSM88PCB          PTR,        
       3  DXI04PCB          PTR,        
       3  DXI05PCB          PTR,        
       3  DXI06PCB          PTR,        
       3  DA215PCB          PTR,                                                
       3  DA215$PCB         PTR,                                                
       3  DA2152PCB         PTR,                                                
       3  DA216PCB          PTR,                                                
       3  DA223PCB          PTR,                                                
       3  DEU02PCB          PTR,                                                
       3  DS101PCB          PTR,        
       3  DS101S2PCB        PTR,        
       3  DS101S3PCB        PTR,        
       3  DS106PCB          PTR,        
       3  DS108PCB          PTR,        
       3  DS124PCB          PTR,        
       3  DSM19PCB          PTR,        
       3  DS102PCB          PTR,        
       3  DSM40PCB          PTR,        
       3  DS133PCB          PTR,        
       3  DS103PCB          PTR,        
       3  DS139PCB          PTR,        
       3  DSM22PCB          PTR,        
       3  DSM18PCB          PTR,        
       3  DSM18BPCB         PTR,        
       3  DD201PCB          PTR,        
       3  DSM43PCB          PTR,        
       3  DEU02MPCB         PTR,        
       3  DEU02DPCB         PTR,        
       3  DSM55PCB          PTR,        
       3  DC105MPCB         PTR,        
       3  DS125PCB          PTR,        
       3  DS137PCB          PTR,        
       3  DCO15PCB          PTR,        
       3  DCO26PCB          PTR,        
       3  DSM25MPCB         PTR,        
       3  DS101MPCB         PTR,        
       3  DS101M2PCB        PTR,        
       3  DS101M3PCB        PTR,        
       3  DS106MPCB         PTR,        
       3  DS108MPCB         PTR,        
       3  DS124MPCB         PTR,        
       3  DS125MPCB         PTR,        
       3  DS137MPCB         PTR,        
       3  DCO15MPCB         PTR,        
       3  DCO26MPCB         PTR,        
       3  DSM22MPCB         PTR,        
       3  DDO01PCB          PTR,        
       3  DDO02PCB          PTR,        
       3  DDO03PCB          PTR,        
       3  DC105SPCB         PTR,                                                
       3  DSM60PCB          PTR,                                                
       3  DSM61PCB          PTR,                                                
       3  DSM62PCB          PTR,                                                
       3  DSM63PCB          PTR,                                                
       3  DSM64PCB          PTR,                                                
       3  DSM65PCB          PTR,                                                
       3  DSM66PCB          PTR,                                                
       3  DSM67PCB          PTR,                                                
       3  DSM68PCB          PTR,                                                
       3  DSM69PCB          PTR,                                                
       3  DS102$PCB          PTR,                                               
       3  DS128PCB          PTR,                                                
       3  DS132PCB          PTR,                                                
       3  DS134PCB          PTR,                                                
       3  DS137$PCB          PTR,                                               
       3  DSM01PCB          PTR,                                                
       3  DSM06PCB          PTR,                                                
       3  DSM07PCB          PTR,                                                
       3  DSM09PCB          PTR,                                                
       3  DS146PCB          PTR, ################################################                   
       3  DSM80PCB          PTR, ################################################                   
       3  DSMB9PCB          PTR; ################################################                   
             /* SERVICE                */        
 /*******************************************************************/        
 /* INTERFACE GENERAL POUR TOUS LES SERVICES                        */        
 /*******************************************************************/        
         
 DCL 1  JWB001,        
      2   CDEVCLI    CHAR(01),      ########################################        
      2   RETOUR     BIT (1),       #########################################        
      2   LEVEL      PIC '9',       #########################################        
      2   ATTRIB     CHAR(02),      ########################################        
      2   LTNMSER    CHAR(08),      ########################################        
      2   ENTREE,        
       3  DBSCRAT,        
        4 METAPCB    PTR,           ##############################################        
        4 DBSCRPCB   PTR,           ##############################################        
        4 LTSGSCR    CHAR(08),      #########################################        
       3  DBTABLE,        
        4 METAPCB    PTR,           ##############################################        
        4 DBTABPCB   PTR,           ##############################################        
        4 LTSGTAB    CHAR(08),      #########################################        
        4 CDDFTAB    CHAR(08),      #########################################        
       3  DBCOMDE,        
        4 METAPCB    PTR,           ##############################################        
        4 DBCDEPCB   PTR,           ##############################################        
        4 LTSGCDE    CHAR(08),      #########################################        
        4 CDDFCDE    CHAR(08),      #########################################        
       3  CDTRACE    PIC '9',       ##########################################        
       3  TBTRACE_I  FIXED (5),     ########################################        
       3  BOTBDB2    BIT (1),       ##########################################        
       3  LTNMBUS    CHAR(20),      #########################################        
       3  LTNMOBJ    CHAR(20),      #########################################        
       3  LTNMMTH    CHAR(20),      #########################################        
      2   SORTIE,        
       3  CDRTPGM    CHAR(09),      #########################################        
       3  CDRTDB2    BIN FIXED(31), ####################################        
       3  SQLERRM    CHAR (70) VAR, ####################################        
       3  CDROLLB    BIT(1),        ###########################################        
       3  LSTCALL    CHAR(12),      #########################################        
       3  LSTSERV    CHAR(12),      #########################################        
       3  TBTRACE (100),            ###############################################        
        4 FLAG_TRACE CHAR(01),        
        4 MSGE_TRACE CHAR(40),        
      2   GXXXXXJ_P  PTR;           ##############################################        
         
 /* EXPLICATIONS:                                                    */        
 /*                                                                  */        
 /* APPEL DU BUS 'LTNMBUS' POUR EXECUTION DE LA FONCTION 'LTNMFCT'   */        
 /* DE L'OBJET 'LTNMOBJ'                                             */        
 /*                                                                  */        
 /* LES TRACES SONT AFFICHEES EN FCT DE CDTRACE (0->9)               */        
 /* ->  0 PAS DE TRACE, 9 TRACE COMPLETES                            */        
         
         
              /* BUS                    */        
         
 /********************************************        
 * INTERFACES AVEC LES SCENARIOS             *        
 ********************************************/        
 DCL XEU100  ENTRY OPTIONS(FETCHABLE);        
         
 DCL KGI012  ENTRY;        
 /*********************************************************************/        
 /* INTERFACE : KGI012J POUR LES METHODES DE TRAITEMENT DES MONTANTS  */        
 /*********************************************************************/        
 /*********************************************************************/        
 /* ATTENTION : TDMSLE - LOGIQUE PREVUE EN FRANCAIS UNIQUEMENT        */        
 /* 06/06/2002            AU NIVEAU DU MONTANT EN LETTRE              */        
 /*********************************************************************/        
         
 DCL 1 KGI012J,        
      2 INPUT        CHAR (300),    ################################################        
      2 OUTPUT       CHAR (600);    ################################################        
         
 /*********************************************************************/        
 /*                                                                   */        
 /*             REDEFINITION EN INPUT                                 */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1 KGI012J_RI BASED(ADDR(KGI012J.INPUT)),        
    /* ----- FORMAT D'ENTREE OBLIGATOIRE ---- */        
     /* CHAMPS PERMETTANT LE TRAITEMENT SUIVANT LA METHODE */        
      2 CDFMTMT     CHAR (20),     #################################################        
      2 MTIN_F15    FIXED (15),    ################################################        
         
      2 LTIN_C25    CHAR (25) VAR, #############################################        
                                   /*  + EVENTUELLEMENT              */        
                                   /*    + LA VIRGULE                */        
                                   /*    + LA DEVISE (AVANT/APRES)   */        
                                   /*    + LE SIGNE  (AVANT/APRES)   */        
         
      2 NBDECIN     FIXED (02),    ################################################        
                                   /*  OBLIGATOIRE                   */        
         
      2 CDMSKOUT    CHAR (11),     #################################################        
                                   /*  EN SORTIE                     */        
         
      2 CDDVTRN     CHAR (03),     #################################################        
      2 CDLGTRN     PIC '9',       ###################################################        
         
      2 NBLENOUT    FIXED (03),    ################################################        
                                   /*  MAX 26 POUR LE MASQUE         */        
                                   /*  MIN 20 POUR LES LETTRES       */        
                                   /*   -> SEPARATEUR APRES 'NBLENOUT*/        
                                   /* SI =0 ALORS UTILISATION DE LA  */        
                                   /*   TAILLE NECESSAIRE            */        
         
      2 TBEGCOD (32)     BIT (01),    #############################################        
           /*   BIT  1 : VALABLE POUR LA VALIDATION ET LE FORMATAGE  */        
           /*             MAIS TOUJOURS UNE VIRGULE EN SORTIE        */        
           /*   BIT  1 : 0 = MONTANT AVEC VIRGULE COMME SEPARATEUR   */        
           /*                 DE DECIMALE                            */        
           /*            1 = MONTANT AVEC POINT OU VIRGULE           */        
           /*                 COMME SEPARATEUR DE DECIMALE           */        
           /*                                                        */        
           /*   BIT  2 : VALABLE UNIQUEMENT POUR LE FORMATAGE        */        
           /*   BIT  2 : 0 = NBDECIN = NBR DECIMALE EN ENTREE        */        
           /*                 OBLIGATOIRE                            */        
           /*            1 = NBDECIN = NBR DECIMALE EN ENTREE        */        
           /*                 MAXIMALE ENCODEE                       */        
           /*                                                        */        
           /*   BIT  3 : VALABLE UNIQUEMENT POUR LE FORMATAGE        */        
           /*   BIT  3 : 0 = VALEUR MONETAIRE SANS CHANGEMENT        */        
           /*                 MTMNT_F15 - SANS MODIF NOMBRE DECIMALE */        
           /*                 ENCODE                                 */        
           /*            1 = VALEUR MONETAIRE EN ENTIER MTMNT_F15    */        
           /*                 - AVEC MODIF NOMBRE DECIMALE ENCODE    */        
           /*                                                        */        
           /*   BIT  4 : VALABLE POUR LE FORMATAGE DES MONTANTS NULS */        
           /*             AVEC P OU B POUR LA POSITION 5             */        
           /*   BIT  4 : 0 = MONTANT NUL -> AFFICHAGE DE BLANCS      */        
           /*            1 = MONTANT NUL -> AFFICHAGE 0,XX SUIVANT   */        
           /*                 LE NOMBRE DE CHIFFRES APRES LA VIRGULE */        
           /*                                                        */        
           /*   BIT  4 : VALABLE POUR LE FORMATAGE DES MONTANTS NULS */        
           /*             AVEC Z POUR LA POSITION 5                  */        
           /*   BIT  4 : 0 = MONTANT NUL -> AFFICHAGE 0,XX SUIVANT   */        
           /*                 LE NOMBRE DE CHIFFRES APRES LA VIRGULE */        
           /*            1 = MONTANT NUL -> AFFICHAGE DE BLANCS      */        
           /*                                                        */        
           /*   BIT  5 : VALABLE ACCEPTATION MONTANT POSITIF         */        
           /*             UNIQUEMENT                                 */        
           /*   BIT  5 : 0 = MONTANT POSITIF ET NEGATIF ACCEPTE      */        
           /*            1 = MONTANT POSITIF UNIQUEMENT              */        
           /*                                                        */        
           /*   BIT  6 : VALABLE ACCEPTATION OU REFUS MONTANT        */        
           /*             NUL                                        */        
           /*   BIT  6 : 0 = MONTANT NUL ACCEPTE                     */        
           /*            1 = MONTANT NUL REFUSE                      */        
           /*                                                        */        
           /*   BIT  7 : VALABLE ACCEPTATION OU REFUS MONTANT        */        
           /*             .99 AU LIEU DE 0.99                        */        
           /*   BIT  7 : 0 = MONTANT 0.99 OBLIGATOIRE                */        
           /*            1 = MONTANT .99 ET 0.99 ACCEPTE             */        
           /*                                                        */        
           /*   BIT  8 : SUPPRESSION DU 1ER SEPARATEUR (EXTREME GCHE)*/        
           /*           QUAND DEPASSEMENT D'UN CHIFFRE (ERREUR '006')*/        
           /*           EX : 1234.567.890,12 AU LIEU DE              */        
           /*             1.234.567.890,12                           */        
           /*           MASQUE = $....12V02$                         */        
           /*          ATTENTION : UNIQUEMENT AVEC SEPARATEUR        */        
           /*   BIT  8 : 0 = MONTANT 1.234.567.890,12 ERREUR CLASSIQ.*/        
           /*            1 = MONTANT 1234.567.890,12 AUCUNE ERREUR   */        
           /*                                                        */        
         
      2 FILLER      CHAR (222);        
         
 /*********************************************************************/        
 /*                                                                   */        
 /*             REDEFINITION EN OUTPUT                                */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1 KGI012J_RO BASED(ADDR(KGI012J.OUTPUT)),        
    /* FORMAT DE SORTIE */        
      2 LTMNT_C26   CHAR (26) VAR, #############################################        
                                   /*  CADRAGE A GAUCHE SUIVANT      */        
                                   /*  LA LONG. DE 'NBLENOUT'        */        
         
      2 MTMNT_F15   FIXED (15),    ################################################        
      2 NBDECOUT    FIXED (02),    ################################################        
                                   /*  AVEC LE FIXED (15)            */        
         
      2 LTMTLET_C250 CHAR (250) VAR, ###########################################        
         
      2 FILLER      CHAR (310);        
         
         
 /********************************************************************/        
 /*                                                                  */        
 /* METHODE :                                                        */        
 /*    - VALID_MONTANT         : VALIDATION DU MONTANT               */        
 /*                                                                  */        
 /*    - FORMATAGE             : FORMATAGE SUIVANT LE MASQUE         */        
 /*                            :  (UN SEUL FORMAT PAR MASQUE EN      */        
 /*                            :   SORTIE)                           */        
 /*                                                                  */        
 /*    - CONVERT_EN_LETTRES    : CONVERSION D'UN MONTANT EN LETTRES  */        
 /*                                                                  */        
 /* ATTENTION :                                                      */        
 /*    TOUTES METHODES VALIDENT LE MONTANT EN ENTREE                 */        
 /*    TOUTES METHODES DOIVENT ALIMENTER 'NBDECIN'                   */        
 /*    UTILISATION DU CODE DEVISE VENANT DE IEU001 SI CDDVTRN NON    */        
 /*        INITIALISE                                                */        
 /*                                                                  */        
 /********************************************************************/        
 /********************************************************************/        
 /* MASQUE CDMSKOUT :                                                */        
 /*                                                                  */        
 /*    - POS 1    : $ TOUJOURS                                       */        
 /*    - POS 2    : DEVISE                                           */        
 /*                   -> G : AVEC DEVISE A GAUCHE DU MONTANT         */        
 /*                   -> D : AVEC DEVISE A DROITE DU MONTANT         */        
 /*                   -> B : SANS DEVISE                             */        
 /*    - POS 3,4  : SIGNE DEVANT OU DERRIERE LE MONTANT              */        
 /*                   -> SG : TOUJOURS LE SIGNE A GAUCHE DU MONTANT  */        
 /*                   -> SD : TOUJOURS LE SIGNE A DROITE DU MONTANT  */        
 /*                   -> -G : AFFICHE - A GAUCHE DU MONTANT SI < 0   */        
 /*                   -> -D : AFFICHE - A DROITE DU MONTANT SI < 0   */        
 /*                   -> BB : N'AFFICHE JAMAIS LE SIGNE              */        
 /*    - POS 5    : PRESENTATION DES MONTANTS POUR LES ZEROS NON     */        
 /*               :  SIGNIFICATIFS ET LES SEPARATEURS DE MILLIERS    */        
 /*                   -> Z : AFF. 0 SI MONTANT NUL - SANS SEPARATEUR */        
 /*                   -> * : AFF. * SI MONTANT NUL - SANS SEPARATEUR */        
 /*                        :  TOUJOURS SANS SIGNE FORCE SIGNE = AA   */        
 /*                   -> P : AFFICHE DES . COMME SEPARATEUR          */        
 /*                        :  TOUJOURS DES BLANCS SI MONTANT NUL     */        
 /*                   -> B : AFFICHE DES BLANCS COMME SEPARATEUR     */        
 /*                        :  TOUJOURS DES BLANCS SI MONTANT NUL     */        
 /*    - POS 6,7  : NOMBRE DE CARACTERES AVANT LA VIRGULE            */        
 /*               :  Y COMPRIS LES . OU LES ESPACES                  */        
 /*               :  MAX 19 CARACTERES - MINIMUM 1 CARACTERE         */        
 /*    - POS 8    : V TOUJOURS                                       */        
 /*    - POS 9,10 : NOMBRE DE CHIFFRES APRES LA VIRGULE (MAX (14)    */        
 /*    - POS 11   : $ TOUJOURS                                       */        
 /*                                                                  */        
 /********************************************************************/        
 /********************************************************************/        
 /*                                                                  */        
 /* MESSAGE D'ERREUR (JWB001.CDRTPGM = $LTNMPRJ !! 'XXX')            */        
 /*------------------------------------------------------------------*/        
 /*                                                                  */        
 /*    001 : LA METHODE N'EXISTE PAS                                 */        
 /*    002 : LE CODE DEVISE N'EXISTE PAS                             */        
 /*    003 : LE MASQUE INCORRECT                                     */        
 /*    004 : CODE INCORRECT - INTERNE AU PROGRAMME                   */        
 /*    005 : MONTANT INVALIDE                                        */        
 /*    006 : LA ZONE 'ENTIER' DU MASQUE EST TROP PETITE POUR         */        
 /*        :  CONTENIR LE MONTANT                                    */        
 /*    007 : LA ZONE RECEPTRICE EST TROP PETITE                      */        
 /*    008 : LA TAILLE DU MASQUE EST > A LA TAILLE DE LA VARIABLE    */        
 /*        :  DE RECEPTION                                           */        
 /*    009 : LA NOMBRE DE DECIMALE EST < A 0 OU > 14                 */        
 /*    010 : LA TAILLE DONNEE EST TROP PETITE                        */        
 /*    011 : LE CODE LANGUE DEMANDE N'EST PAS TRAITE                 */        
 /*    012 : LE NOMBRE DE DECIMALE EST TROP GRAND                    */        
 /*    013 : LE CODE FORMAT N'EXISTE PAS                             */        
 /*    014 : LE NBR DECIMALE ATTENDU NE CORRESPOND PAS AU NBR RECU   */        
 /*    015 : LE MONTANT EST NEGATIF - REFUSE                         */        
 /*    016 : LE MONTANT EST NUL - REFUSE                             */        
 /*                                                                  */        
 /********************************************************************/        
         
         
 DCL KS1010  ENTRY;        
 /*********************************************************************/        
 /* KS1010J:                                                          */        
 /*         INTERFACE DU SERVICE KS1010:  CREATE PROSPECT VIA NET     */        
 /*                                                                   */        
 /*********************************************************************/        
         
 /* ------- */        
 /* INCLUDE */        
 /* ------- */        
         
 /* NRB - TDMARE - Generation le 27/01/1998 - 16:14        Lgth=00119 */        
 /*******************        
 *  SEGMENT AFFILIE *        
 *******************/        
 DCL  1 S1AFF00 ,                        ###############################################################        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),          /*NO!  !NUMERO D'AFFILIE 0   */        
       2 HEADER_AFF  PIC'(7)9',          #################################################        
       2 HEADER_POL  PIC'(8)9',          #################################################        
       2 FILLER  CHAR(100);              #####################################################        
                     /* COMPOSTEUR POUR DETERMINER DU NO D'AFFILIE */        
 /* NRB - TDMROO - GENERATION LE 03/05/2010 - 14:32        LGTH=00119 */        
 /********************/        
 /*  SEGMENT AFFILIE */        
 /********************/        
 DCL  1 S1AFFIL ,                   ###############################################################        
                                    /*DB!  !DCR41   !S1AFFIL          */        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),     /*NO!  !NUMERO D'AFFILIE          */        
       2 LTNMAFF  CHAR(30),         #####################################################        
       2 CDRSAFF  CHAR(1),          ######################################################        
       2 CDSEXAF  CHAR(1),          ######################################################        
       2 DANAIAF  DEC FIXED(10),    ################################################        
       2 CDLGEAF  CHAR(1),          ######################################################        
       2 NORULOC  DEC FIXED(7),     #################################################        
       2 NOHA1AF  BIN FIXED(15),    ################################################        
       2 NOHA2AF  CHAR(4),          ######################################################        
       2 CDEGCOU  CHAR(1),          ######################################################        
       2 TBEGCOD  BIT(40),          ######################################################        
                                    /*--!  !01 : PROFESSION           */        
                                    /*--!  !02 : EXTENSION DU NOM     */        
                                    /*--!  !03 : LIEU DE NAISSANCE    */        
                                    /*--!  !04 : INSPECTEUR-CPT-FACT. */        
                                    /*--!  !05 : MOTIF DE LA MODIF.   */        
                                    /*--!  !06 : NOM CONDENSE MEMBRE  */        
                                    /*--!  !07 : NOM CONJOINT EN MEGA */        
                                    /*--!  !08 : NUMERO PIC DU CCB    */        
                                    /*--!  !09 : --- VIDE --9/11/2000 */        
                                    /*--!  !10 : TELEPHONE EMPLOYEUR  */        
                                    /*--!  !11 : NO AFFILIE AUTRE SOC */        
                                    /*--!  !12 : REFERENCE CHGT ADR.  */        
                                    /*--!  !13 : REF. DE LA M-A-J     */        
                                    /*--!  !14 : 1 PARTIE NOM DU MBRE */        
                                    /*--!  !15 : 2 PARTIE NOM DU MBRE */        
                                    /*--!  !16 : --- VIDE --9/11/2000 */        
                                    /*--!  !17 : MATRICULE CIE LGCP   */        
                                    /*--!  !18 : PRESENCE RELATIONS   */        
                                    /*--!  !19 : NO DOMICILIATION     */        
                                    /*--!  !20 :                      */        
                                    /*--!  !21 : INFOS ACCIDENTS      */        
                                    /*--!  !22 : NOM COMPTE TIERS     */        
                                    /*--!  !23 : INFO CAISSE AG       */        
                                    /*--!  !24 : QUALITE DELEGUE AG   */        
                                    /*--!  !25 : AFF.AMEL A BLANC     */        
                                    /*--!  !26 : SUPPR. FAT VIA S1DAT */        
                                    /*--!  !27 : NO COMPTE IBAN       */        
                                    /*--!  !28 : CODE BIC             */        
                                    /*--!  !29 : IMAGE 1 CARTE IDENT. */        
                                    /*--!  !30 : IMAGE 2 CARTE IDENT. */        
                                    /*--!  !31 : DATE DER.MAJ EMVC OL */        
                                    /*--!  !32 : DATE CHGT ADRESSE    */        
                                    /*--!  !33 : NR BCE INTRA-CEE     */        
                                    /*--!  !34 : NR IBAN (ZOOMIT)     */        
       2 TBTYPAF  BIT(240),         #####################################################        
                                    /*--!  !VOIR DEFINITION IPS1006   */        
                                    /*--!  !01 : AFFILIE SECONDAIRE   */        
                                    /*--!  !02 : AFFILIE PRINCIPAL    */        
                                    /*--!  !03 : BILINGUE FRANCAIS    */        
                                    /*--!  !04 : BILINGUE NEERLANDAIS */        
                                    /*--!  !05 : NO TVA DS DANAIAF    */        
                                    /*--!  !11 : EPOUX DE ...         */        
                                    /*--!  !12 : EPOUDE DE ...        */        
                                    /*--!  !13 : ENFANT DE ...        */        
                                    /*--!  !14 : PARENT DE ...        */        
                                    /*--!  !15 : CONCUBIN DE ...      */        
                                    /*--!  !16 : CONCUBINE DE ...     */        
                                    /*--!  !17 : DIVERS DE ...        */        
                                    /*--!  !18 : DIVERSES DE ...      */        
                                    /*--!  !29 : CLIENT A REFUSER     */        
                                    /*--!  !30 : CHGT ADRESSE EN COUR */        
                                    /*--!  !31 : VIP                  */        
                                    /*--!  !32 : VIP TRES IMPORTANT   */        
                                    /*--!  !33 : PAS D'AGENDA         */        
                                    /*--!  !34 : CLIENT CCB           */        
                                    /*--!  !35 : CLIENT PASSIF        */        
                                    /*--!  !36 : MEMBRE DU PERSONNEL  */        
                                    /*--!  !37 : PAS DE MAILING       */        
                                    /*--!  !38 : CLIENT A SURVEILLER  */        
                                    /*--!  !39 : EXPERT AUTO ^AUTOMAT */        
                                    /*--!  !40 : CONVENTION DE GESTIO */        
                                    /*--!  !41 : CLIENT FICTIF        */        
                                    /*--!  !42 : MEMO                 */        
                                    /*--!  !43 : CHGT D'ADRESSE EN CO */        
                                    /*--!  !44 : AFFILIE PERIME       */        
                                    /*--!  !45 : CONTENTIEUX          */        
                                    /*--!  !46 : CLUB BLOSO           */        
                                    /*--!  !47 : MEMBRE VLB           */        
                                    /*--!  !48 : PAS DE TP INFORMEX   */        
                                    /*--!  !49 : FONCTIONNAIRE CEE    */        
                                    /*--!  !50 : A NE PAS RAPPELER    */        
                                    /*--!  !51 : ADRESSE SOPRESS      */        
                                    /*--!  !52 : CONTRAT BILINGUE     */        
                                    /*--!  !53 : AFFILIE DECEDE       */        
                                    /*--!  !54 : PRODUCTION FICTIVE   */        
                                    /*--!  !55 : GESTION PROTEGEE     */        
                                    /*--!  !56 : CLIENT CGFP          */        
                                    /*--!  !57 : CELLULE DE DISTRIBUT */        
                                    /*--!  !58 : GESTION SIN. DEDICAE */        
                                    /*--!  !59 : AD.COURRIER SINISTRE */        
                                    /*--!  !60 : DOCUMENT EURO/DEFAUT */        
                                    /*--!  !61 : PROSPECT             */        
                                    /*--!  !62 : SUIVI GESTIONNAIRE   */        
                                    /*--!  !63 : MEMBRE               */        
                                    /*--!  !64 : FAUX-MEMBRE          */        
                                    /*--!  !65 : IMPOSABLE            */        
                                    /*--!  !72 : ACTIF DEFINITIF      */        
                                    /*--!  !73 : ACTIF TEMPORAIRE     */        
                                    /*--!  !74 : INACTIF              */        
                                    /*--!  !75 : RETRAITE             */        
                                    /*--!  !76 : UTILISATEUR EXTERNE  */        
                                    /*--!  !77 : FONCTIONNAIRE        */        
                                    /*--!  !78 : CTRL RSQ : W=BLOQUE  */        
                                    /*--!  !79 : CTRL RSQ : S=SURVEIL */        
                                    /*--!  !80 : SMAP-INFOS           */        
                                    /*--!  !81 : FICHE PERSONNELLE V  */        
                                    /*--!  !82 : NOUV. ADR. INCONNUE  */        
                                    /*--!  !83 : BENEFICIE DE 3 APPEL */        
                                    /*--!  !     AU CC JURIDIQUE LEGI */        
                                    /*--!  !84:FAIT PART. D'1 AFFINIT */        
                                    /*--!  !85:VIE PURE (AME)         */        
                                    /*--!  !86:ENVOI ENQUETE MIEUX... */        
                                    /*--!  !87:RETOUR ENQ. MIEUX...   */        
                                    /*--!  !88:RETOUR ENQ.MIEUX+SIGN. */        
                                    /*--!  !89 : SPONSORING (VIP)     */        
                                    /*--!  !90 : STOP PHONING         */        
                                    /*--!  !91 : ROBINSON             */        
                                    /*--!  !92 : CTL RSQ:Z=BLOQUE ISI */        
                                    /*--!  !93 : PRES. CARTE IDENTIT. */        
                                    /*--!  !94 : FAILLITE             */        
                                    /*--!  !95:STOP TRANSFERT SMAP BQ */        
                                    /*--!  !96 : CODE CERTI-POST      */        
                                    /*--!  !97 : PROSPECT CORPORATE   */        
                                    /*--!  !98 : PROSPECT + DE 5 ANS  */        
                                    /*--!  !99 :ACCEPTATION EXPLICITE */        
                                    /*--!  !     E-MAIL PUBLICITAIRE  */        
                                    /*--!  !100: CLIENT REFUSE EN VIE */        
                                    /*--!  !     PARTICULIERS         */        
                                    /*--!  !101: ENQUTE VIE          */        
                                    /*--!  !     PARTICULIERS EN COURS*/        
                                    /*--!  !102: ACCEPTATION APRES    */        
                                    /*--!  !     ENQUTE VIE PARTIC.  */        
                                    /*--!  !103: REFUS EXPLICITE      */        
                                    /*--!  !     E-MAIL PUBLICITAIRE  */        
                                    /*--!  !104: PAS D'AGENDA ACTIF   */        
                                    /*--!  !     AV.ACTIVATION NVELLE */        
                                    /*--!  !     ADRESSE INCONNUE     */        
                                    /*--!  !105: PAS DE MAILING ACTIF */        
                                    /*--!  !     AV.ACTIVATION NVELLE */        
                                    /*--!  !     ADRESSE INCONNUE     */        
                                    /*--!  !106: CLIENT ETHIAS BANQUE */        
                                    /*--!  !107: ANCIEN CLIENT BANQUE */        
                                    /*--!  !     SEGMENTATION CLIENT  */        
                                    /*--!  !108: SEGMENT TOP          */        
                                    /*--!  !109: SEGMENT POTENTIEL    */        
                                    /*--!  !110: SEGMENT LOW          */        
                                    /*--!  !111: SEGMENT QUESTION MRK */        
                                    /*--!  !112: RESERVER             */        
                                    /*--!  !113: RESERVER             */        
                                    /*--!  !114: RESERVER             */        
                                    /*--!  !115: RESERVER             */        
                                    /*--!  !116: RESERVER             */        
                                    /*--!  !117: RESERVER             */        
                                    /*--!  !     SEGMENTATION CLIENT  */        
                                    /*--!  !118: PARRAIN POTENTIEL    */        
                                    /*--!  !119: FONCT. ASSIMILE      */        
                                    /*--!  !120: FONCT. PARRAINE      */        
                                    /*--!  !121: CONTRATS DS MENAGE   */        
                                    /*--!  !122: CLIENT E-DOCUMENT    */        
                                    /*--!  !123: AGPM                 */        
                                    /*--!  !124: MAGAZINE ETHIAS      */        
                                    /*--!  !125: FIDEL:FRANCHISE 20   */        
                                    /*--!  !126: FIDEL:FRANCHISE 50   */        
                                    /*--!  !127: FIDEL:FRANCHISE 100  */        
                                    /*--!  !128: FIDEL:TRIGGER        */        
                                    /*--!  !129: FIDELISATION         */        
                                    /*--!  !SEGMENT MENAGE            */        
                                    /*--!  !    LIFESTAGE             */        
                                    /*--!  !130: ENS (ENSEIGNANT)     */        
                                    /*--!  !131: YPR (YOUNG PROFES.)  */        
                                    /*--!  !132: SIN (SINGLES)        */        
                                    /*--!  !133: CWC (COUPLES SS ENF) */        
                                    /*--!  !134: FAM (FAMILY LIFE)    */        
                                    /*--!  !135: MED (MEDIORS)        */        
                                    /*--!  !136: SEN (SENIORS)        */        
                                    /*--!  !137: LIBRE (RESERVE)      */        
                                    /*--!  !138: LIBRE (RESERVE)      */        
                                    /*--!  !139: LIBRE (RESERVE)      */        
                                    /*--!  !    INCOME/WEALTH         */        
                                    /*--!  !140: LOWER (<1100 EUR)    */        
                                    /*--!  !141: MASS  (1100 e 3000)  */        
                                    /*--!  !142: AFFLUENT (>3000 EUR) */        
                                    /*--!  ! SEGMENT MENAGE           */        
       2 NOTL1AF  DEC FIXED(3),     #################################################        
       2 NOTL2AF  DEC FIXED(9),     #################################################        
       2 NONATAF  DEC FIXED(11),    ################################################        
       2 DADERMJ  DEC FIXED(7),     #################################################        
       2 CDLGRUE  CHAR(1),          ######################################################        
       2 NOAF1EX  DEC FIXED(7),     #################################################        
       2 NOAF2EX  BIN FIXED(15),    ################################################        
       2 CDPOGEO  DEC FIXED(7),     #################################################        
       2 NBFICDO  BIN FIXED(15);    ################################################        
         
         
    DCL 1 SSA_S1AFFIL,        
         2 FIL1         CHAR (8)     INIT ('S1AFFIL'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1AFFIL'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        FIXED (7),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMGUA - GENERATION LE 11/03/2010 - 09:30        LGTH=00110 */        
 /**************************/        
 /*  SEGMENT ENTETE POLICE */        
 /**************************/        
 DCL  1 S1POLIC ,                   ###############################################################        
                                    /*DB!  !DCR41   !S1POLIC          */        
 /*K*/ 2 NOIDPOL  DEC FIXED(8),     /*NO!  !NO. DE POLICE             */        
       2 CDTYPOL  CHAR(2),          ######################################################        
       2 CDLGPOL  CHAR(1),          ######################################################        
       2 CDETAPO  CHAR(1),          ######################################################        
                                    /*--!  !A : ACTIVE                */        
                                    /*--!  !C : CLOTUREE / ANNULEE    */        
                                    /*--!  !P : PASSIVE / EN ATTENTE  */        
                                    /*--!  !S : SUSPENDUE/SANS SUITE  */        
       2 CDCMPRO  CHAR(1),          ######################################################        
       2 CDCMGES  CHAR(8),          ######################################################        
       2 NUSOUPO  DEC FIXED(4),     #################################################        
                                    /*--!  !EN IE, VAUT 9999 POUR LE  */        
                                    /*--!  !NUMERO DE CI 000000       */        
       2 CDINSPO  CHAR(2),          ######################################################        
       2 CDINTAG  DEC FIXED(7),     #################################################        
                                    /*--!  !A REMPLACER PAR CDAGINT   */        
       2 NOINTPO  CHAR(12),         #####################################################        
       2 CDMODPA  CHAR(1),          ######################################################        
       2 CDREAPO  CHAR(1),          ######################################################        
       2 CDGAGPO  CHAR(1),          ######################################################        
       2 NODERAV  DEC FIXED(3),     #################################################        
       2 NBEXEPO  DEC FIXED(3),     #################################################        
       2 NODOMPO  DEC FIXED(10),    ################################################        
       2 NOCPTPO  DEC FIXED(10),    ################################################        
       2 CDEGAPO  CHAR(1),          ######################################################        
       2 TBCDPOL(24)  BIT(1),       ###################################################        
                                    /*--!  !01: POLICE COURT TERME    */        
                                    /*--!  !02: FACT MS PAR SOUS GR   */        
                                    /*--!  !03: PRESENCE AD. POLICE   */        
                                    /*--!  !04: MUTATION DE SOCIETE   */        
                                    /*--!  !       SMAP <---> MEGA    */        
                                    /*--!  !05: MS : ATTESTATION      */        
                                    /*--!  !06: BILINGUE/TRILINGUE    */        
                                    /*--!  !07: SINISTRE EN D1        */        
                                    /*--!  !08: SINISTRE EN SA        */        
                                    /*--!  !09: SINISTRE EN AC        */        
                                    /*--!  !10: MEMO POLICE           */        
                                    /*--!  !21: NE PEUT ETRE VUE NET  */        
                                    /*--!  !22: POLICE SOUS PACKAGE   */        
                                    /*--!  !23: POLICE PACKAGE        */        
                                    /*--!  !24: CHGT AFFILIE          */        
       2 NOIDMAT  CHAR(14),         #####################################################        
       2 NOHDRLT  BIN FIXED(15),    ################################################        
       2 CDDVPOL  CHAR(3),          ######################################################        
       2 CDSTAPO  CHAR(1),          ######################################################        
                                    /*--!  !0: POLICE INCOMPLETE      */        
                                    /*--!  !1: PRODUCT. INDIV. OK     */        
                                    /*--!  !2: FACTURAT.INDIV. OK     */        
                                    /*--!  !3: FACTURAT.PACKAGE OK    */        
       2 CDAGINT  CHAR(6),          ######################################################        
       2 NORFEXT  CHAR(12),         #####################################################        
       2 CDTYDOC  CHAR(1),          ######################################################        
       2 CDDOMIM  CHAR(1),          ######################################################        
                                    /*--!  !       2 = GeRe PAR DOMIC */        
       2 CDDOMGR  CHAR(1),          ######################################################        
                                    /*--!  !       ' ' OU 'N' = NON   */        
       2 FILLER  CHAR(7);           #######################################################        
         
    DCL 1 SSA_S1POLIC,        
         2 FIL1         CHAR (8)     INIT ('S1POLIC'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1POLIC'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        FIXED (8),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMOHL - GENERATION LE 20/04/2009 - 15:52        LGTH=00098 */        
 /***************************************        
 *  SEGMENT ADRESSE COURRIER PAR POLICE *        
 ***************************************/        
 DCL  1 S1ADPOL ,                         ###############################################################        
                                          /*DB!  !DCR41   !S1ADPOL    */        
 /*K*/ 2 CDADPOL  CHAR(1),                /*CD!  !CODE ADRESSE        */        
       2 LTNMPOL  CHAR(30),               #####################################################        
       2 CDRSPOL  CHAR(1),                ######################################################        
       2 LTRUEPO  CHAR(30),               #####################################################        
       2 CDCPOPO  CHAR(6),                ######################################################        
       2 LTLOCPO  CHAR(25),               #####################################################        
       2 CDPAYPO  CHAR(3),                ######################################################        
       2 FILLER  CHAR(2);                 #######################################################        
         
 DCL 1 SSA_S1ADPOL,        
         2 FIL1         CHAR (8)       INIT ('S1ADPOL'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KS1ADPOL'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (1),        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMCLO - Generation le 12/03/2003 - 11:12        Lgth=00059 */        
 /***************************/        
 /* SEGMENT ADRESSE AFFILIE */        
 /***************************/        
 DCL  1 S1ADAFF ,                           ###############################################################        
                                            /*DB!  !DCR41   !S1ADAFF  */        
       2 LTRUEAF  CHAR(25),                 #####################################################        
       2 CDCPOAF  CHAR(6),                  ######################################################        
       2 LTLOCAF  CHAR(25),                 #####################################################        
       2 CDPAYAF  CHAR(3);                  ######################################################        
         
 DCL 1 SSA_S1ADAFF,        
         2 FIL1         CHAR (8)     INIT ('S1ADAFF'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT (' ');        
 /* NRB - TDMOHL - GENERATION LE 20/04/2009 - 15:53        LGTH=00098 */        
 /*****************************************/        
 /*  SEGMENT ADRESSE COURRIER PAR AFFILIE */        
 /*****************************************/        
 DCL  1 S1ADCOU ,                         ###############################################################        
                                          /*DB!  !DCR41   !S1ADCOU    */        
 /*K*/ 2 CDADCOU  CHAR(1),                /*CD!  !CODE ADRESE         */        
       2 LTNMCOU  CHAR(30),               #####################################################        
       2 CDRSCOU  CHAR(1),                ######################################################        
       2 LTRUECO  CHAR(30),               #####################################################        
       2 CDCPOCO  CHAR(6),                ######################################################        
       2 LTLOCCO  CHAR(25),               #####################################################        
       2 CDPAYCO  CHAR(3),                ######################################################        
       2 FILLER  CHAR(2);                 #######################################################        
         
 DCL 1 SSA_S1ADCOU,        
         2 FIL1         CHAR (8)       INIT ('S1ADCOU'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KS1ADCOU'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (1),        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMEBN - Generation le 09/05/2003 - 11:36        Lgth=00006 */        
 /***********************************************/        
 /* SEGMENT RELATIONS ENTRE POLICES ET AFFILIES */        
 /***********************************************/        
 DCL  1 S1RELAT ,                   ###############################################################        
                                    /*DB!  !DCR41   !S1RELAT          */        
 /*K*/ 2 CDNATRE  CHAR(2),          /*CD!  !NATURE DE LA RELATION     */        
       2 NOAFFRE  DEC FIXED(7);     #################################################        
         
    DCL 1 SSA_S1RELAT,        
         2 FIL1         CHAR (8)     INIT ('S1RELAT'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1RELAT'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        CHAR (2),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMEBN - Generation le 09/05/2003 - 11:41        Lgth=00014 */        
 /********************************/        
 /* SEGMENT CREATION D'ENSEMBLES */        
 /********************************/        
 DCL  1 S1ENSEM ,                         ###############################################################        
                                          /*DB!  !DCR41   !S1ENSEM    */        
       2 TBIDENS(2)  CHAR(7);             ###################################################        
         
 DCL 1 SSA_S1ENSEM,        
        2 FIL1          CHAR (8)       INIT ('S1ENSEM'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (4)       INIT ('---');        
 /* NRB - TDMEBN - Generation le 09/05/2003 - 11:46        Lgth=00036 */        
 /************************************************/        
 /*  SEGMENT DESTINE AUX DONNEES COMPLEMENTAIRES */        
 /************************************************/        
 DCL  1 S1COMPL ,                   ###############################################################        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),     /*NO!  !NO. D'AFFILIE             */        
 /*K*/ 2 CDTYINF  CHAR(2),          /*CD!  !CODIF. TYPE D'INFORAMTION */        
       2 LTNMINF  CHAR(30);         #####################################################        
         
    DCL 1 SSA_S1COMPL,        
         2 FIL1         CHAR (8)     INIT ('S1COMPL'),        
         2 FIL2         CHAR (1)     INIT ('*'),        
         2 CC           CHAR (3)     INIT ('---'),        
         2 PAR          CHAR (1)     INIT ('('),        
         2 FIL3         CHAR (8)     INIT ('KS1COMPL'),        
         2 OPER         CHAR (2)     INIT ('= '),        
         2 VALUE        CHAR (6),        
         2 FIL4         CHAR (1)     INIT (')');        
 /* NRB - TDMALL - GENERATION LE 06/10/2004 - 08:49        LGTH=00600 */        
 /******************************/        
 /* SEGMENT HISTORIQUE AFFILIE */        
 /* L': 600 DS125 HDAM S1AHS   */        
 /******************************/        
 DCL  1 S1HISAF ,                     ###############################################################        
 /*K*/ 2 NOIDAFF  DEC FIXED(7),       /*NO!  !NO. D'AFFILIE           */        
 /*K*/ 2 NOSQAFF  BIN FIXED(15),      /*NO!  !NO. DE SEQUENCE AFFILIE */        
       2 NBSQAFF  BIN FIXED(15),      ################################################        
         
       2 CDCMGES  CHAR(8),            ######################################################        
       2 DAMAJAF  DEC FIXED(7),       #################################################        
       2 HHMAJAF  DEC FIXED(7),       #################################################        
       2 NOIDTER  CHAR(8),            ######################################################        
         
       2 LTNMAFF  CHAR(30),           #####################################################        
       2 LTEXTNM  CHAR(30),           #####################################################        
       2 CDRSAFF  CHAR(1),            ######################################################        
       2 CDSEXAF  CHAR(1),            ######################################################        
       2 CDLGEAF  CHAR(1),            ######################################################        
       2 DANAIAF  DEC FIXED(10),      ################################################        
       2 LTNMCDS  CHAR(21),           #####################################################        
       2 LTRUEAF  CHAR(25),           #####################################################        
       2 CDCPOAF  CHAR(6),            ######################################################        
       2 LTLOCAF  CHAR(25),           #####################################################        
       2 CDPAYAF  CHAR(3),            ######################################################        
       2 LTLINAI  CHAR(30),           #####################################################        
       2 LTPROAF  CHAR(30),           #####################################################        
       2 NOTL1AF  DEC FIXED(3),       #################################################        
       2 NOTL2AF  DEC FIXED(9),       #################################################        
       2 NOTLBUR  CHAR(16),           #####################################################        
       2 NBFACAF  PIC'9',             #######################################################        
       2 CDINSAF  CHAR(2),            ######################################################        
       2 NOCPTAF  PIC'(12)9',         ###################################################        
       2 LTCOMAF  CHAR(30),           #####################################################        
         
       2 LTNMCOU  CHAR(30),           #####################################################        
       2 CDRSCOU  CHAR(1),            ######################################################        
       2 LTRUECO  CHAR(30),           #####################################################        
       2 CDCPOCO  CHAR(6),            ######################################################        
       2 LTLOCCO  CHAR(25),           #####################################################        
       2 CDPAYCO  CHAR(3),            ######################################################        
         
       2 LTNM1MB  CHAR(30),           #####################################################        
       2 LTNM2MB  CHAR(30),           #####################################################        
         
       2 NOHA1AF  BIN FIXED(15),      ################################################        
       2 NOHA2AF  CHAR(4),            ######################################################        
       2 NOFA1AF  DEC FIXED(3),       #################################################        
       2 NOFA2AF  DEC FIXED(9),       #################################################        
       2 CDCHAL1  CHAR(2),            ######################################################        
       2 CDETCIV  CHAR(2),            ######################################################        
       2 CDORGAF  CHAR(2),            ######################################################        
       2 CDRCTAF  CHAR(2),            ######################################################        
       2 NOGSMAF  CHAR(15),           #####################################################        
       2 DADECAF  DEC FIXED(7),       #################################################        
       2 CDNATAF  CHAR(3),            ######################################################        
       2 RSVHIST  CHAR(93);           #####################################################        
         
         
    DCL 1 SSA_S1HISAF,        
         2 FIL1         CHAR (8)       INIT ('S1HISAF'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KS1HISAF'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE1       FIXED (7),        
         2 VALUE2       FIXED BIN (15),        
         2 FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMBAI - GENERATION LE 16/09/2005 - 15:26        LGTH=00100 */        
         
 /***********************************        
 * SIGNALETIQUE ACTIVITES           *        
 ***********************************/        
 DCL  1 S1CLACT ,                       ###############################################################        
 /*K*/ 2 NOIDCLI  DEC FIXED(9),         /*NO!  !IDENTIFICATION CLIENT */        
       2 TBEGCOD(16)  BIT(1),           ###################################################        
       2 ADREMP  CHAR(50),              ######################################################        
       2 LTACTEMP  CHAR(20),            ####################################################        
       2 FILLER  CHAR(23);              ######################################################        
         
 DCL 1     SSA_S1CLACT,        
      2    FIL1         CHAR (8)       INIT ('S1CLACT'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLACT'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        FIXED(09),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMNET - GENERATION LE 19/11/2009 - 09:28        LGTH=00150 */        
 /****************************************/        
 /* SIGNALETIQUE ACTIVITE PROFESSIONELLE */        
 /****************************************/        
         
 DCL  1 S1CLPRO ,                          ###############################################################        
 /*K*/ 2 DAEFPRO  DEC FIXED(7),            /*DC!  !DA. EFF. COMPL.    */        
 /*K*/ 2 NOSQRUE  BIN FIXED(15),           /*SC!  !NO. SEQ. COMPL.999 */        
       2 CDTYPRO  CHAR(2),                 ######################################################        
       2 CDTYEMP  CHAR(2),                 ######################################################        
       2 CDPOEMP  CHAR(4),                 ######################################################        
       2 LOPOEMP  CHAR(20),                #####################################################        
       2 TXDETVA  DEC FIXED(3),            #################################################        
       2 NUDETVA  CHAR(9),                 ######################################################        
       2 LTCMPRO  CHAR(40),                #####################################################        
       2 LTCMEMP  CHAR(40),                #####################################################        
       2 CDHANDI  CHAR(1),                 ######################################################        
       2 CDRETVA  CHAR(1),                 ######################################################        
       2 CDASTVA  CHAR(1),                 ######################################################        
       2 CDTRANS  CHAR(1),                 ######################################################        
       2 TBEGCOD(16)  BIT(1),              ###################################################        
                                           /*--!  !01:SECTEUR PRIVE   */        
                                           /*--!  !02:SECTEUR PUBLIC  */        
                                           /*--!  !03:SECT.ASSOCIATIF */        
       2 CDFONCT  CHAR(1),                 ######################################################        
       2 CDGEPRO  CHAR(2),                 ######################################################        
       2 CDGEEMP  CHAR(2),                 ######################################################        
       2 CDTAENT  CHAR(2),                 ######################################################        
       2 CDPAYEM  CHAR(3),                 ######################################################        
       2 CDDEFCT  CHAR(2),                 ######################################################        
       2 CDREVME  CHAR(1),                 ######################################################        
       2 CDENFAN  CHAR(1),                 ######################################################        
       2 FILLER  CHAR(5);                  #######################################################        
         
 DCL 1     SSA_S1CLPRO,        
      2    FIL1         CHAR (8)       INIT ('S1CLPRO'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLPRO'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE1       FIXED(07),        
      2    VALUE2       BIN FIXED(15,0),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMROO - Generation le 09/04/2002 - 13:26        Lgth=00100 */        
 /*****************************************        
 * SIGNALETIQUE ACTIVITES COMPLEMENTAIRES *        
 *****************************************/        
 DCL  1 S1CLACC ,                         ###############################################################        
 /*K*/ 2 NOSQACC  BIN FIXED(15),          /*SQ!  !NO DE SEQUENCE      */        
       2 CDTYACC  CHAR(2),                ######################################################        
       2 LTCMACC  CHAR(40),               #####################################################        
       2 TBEGCOD(16)  BIT(1),             ###################################################        
       2 CDTYASC  CHAR(2),                ######################################################        
       2 LTLIACC  CHAR(30),               #####################################################        
       2 FILLER  CHAR(22);                ######################################################        
         
 DCL 1     SSA_S1CLACC,        
       2    FIL1         CHAR (8)       INIT ('S1CLACC'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT ('('),        
       2    FIL3         CHAR (8)       INIT ('KS1CLACC'),        
       2    OPER         CHAR (2)       INIT ('= '),        
       2    VALUE1       BIN FIXED(15,0),        
       2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:34        Lgth=00100 */        
 /***********************************        
 * SIGNALETIQUE DES CONTACTS        *        
 ***********************************/        
 DCL  1 S1CLCON ,                       ###############################################################        
 /*K*/ 2 NOIDCLI  DEC FIXED(9),         /*NO!  !IDENTIFICATION CLIENT */        
       2 TBEGCOD(16)  BIT(1),           ###################################################        
       2 FILLER  CHAR(93);              ######################################################        
         
 DCL 1     SSA_S1CLCON,        
      2    FIL1         CHAR (8)       INIT ('S1CLCON'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLCON'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        FIXED(09),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMNET - GENERATION LE 24/06/2009 - 14:10        LGTH=00200 */        
 /******************************************        
 * SIGNALETIQUE DES ADRESSES               *        
 ******************************************/        
 DCL  1 S1CLADR ,                     ###############################################################        
 /*K*/ 2 CDTYADR  CHAR(2),            /*CD!  !CODE TYPE ADRESSE       */        
 /*K*/ 2 DAEFPRO  DEC FIXED(7),       /*DC!  !DATE EFFEF COMPLEMENTEE */        
       2 LTADNO1  CHAR(30),           #####################################################        
       2 LTADNO2  CHAR(30),           #####################################################        
       2 CDADRSO  CHAR(3),            ######################################################        
       2 LTADADR  CHAR(30),           #####################################################        
       2 NOADCPO  CHAR(5),            ######################################################        
       2 NOADBTE  CHAR(5),            ######################################################        
       2 CDADCPO  CHAR(6),            ######################################################        
       2 LOADLOC  CHAR(20),           #####################################################        
       2 CDADPAY  CHAR(3),            ######################################################        
       2 NUADTEL  CHAR(15),           #####################################################        
       2 NUADFAX  CHAR(15),           #####################################################        
       2 TBEGCOD(16)  BIT(1),         ###################################################        
       2 NOCPLPR  CHAR(10),           #####################################################        
       2 NORULOC  DEC FIXED(7),       #################################################        
       2 NOIDAFP  DEC FIXED(7),       #################################################        
       2 DADMACT  DEC FIXED(7),       #################################################        
       2 FILLER  CHAR(8);             #######################################################        
         
 DCL 1     SSA_S1CLADR,        
       2    FIL1         CHAR (8)       INIT ('S1CLADR'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT ('('),        
       2    FIL3         CHAR (8)       INIT ('KS1CLADR'),        
       2    OPER         CHAR (2)       INIT ('= '),        
       2    VALUE1       CHAR (2),        
       2    VALUE2       FIXED(07),        
       2    FIL4         CHAR (1)       INIT (')');        
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
         
 /* NRB - TDMNET - GENERATION LE 24/06/2009 - 14:10        LGTH=00100 */        
 /*****************************************        
 * SIGNALETIQUE COMPLEMENT D'ADRESSE      *        
 *****************************************/        
 DCL  1 S1CLCPL ,                        ###############################################################        
       2 CDTYACC  CHAR(2),               ######################################################        
       2 LTCLCPL  CHAR(30),              #####################################################        
       2 TBEGCOD(16)  BIT(1),            ###################################################        
       2 LTADEML  CHAR(50),              #####################################################        
       2 FILLER  CHAR(16);               ######################################################        
         
 DCL 1     SSA_S1CLCPL,        
       2    FIL1         CHAR (8)       INIT ('S1CLCPL'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT (')') ;        
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:34        Lgth=00250 */        
 /******************************************        
 * SIGNALETIQUE DES CONTACTS PRIVILEGIES   *        
 ******************************************/        
 /* 2) PARTICULIER */        
 DCL  1 S1CLCOP ,                         ###############################################################        
       2 NOIDAFF(10)  CHAR(6),            ##################################################        
       2 TBEGCOD(16)  BIT(1),             ###################################################        
       2 FILLER  CHAR(188);               #####################################################        
 DCL 1     SSA_S1CLCOP,        
      2    FIL1         CHAR (8)       INIT ('S1CLCOP '),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT (')');        
 /* NRB - TDMGAS - GENERATION LE 23/11/2009 - 14:03        LGTH=00300 */        
 /****************************/        
 /** COMPLEMENT SIGNALETIQUE */        
 /****************************/        
 DCL  1 S1CLCOM ,                   ###############################################################        
 /*K*/ 2 NOIDCLI  DEC FIXED(9),     /*NO!  !IDENTIFICATION CLIENT     */        
       2 DADECAF  DEC FIXED(7),     #################################################        
       2 DAPERMI  DEC FIXED(7),     #################################################        
       2 TBNBCTC(5),        
        3 CDTYCTC  CHAR(2),         #####################################################        
        3 NBCONTR  DEC FIXED(7),    ################################################        
       2 NBENFAN  BIN FIXED(15),    ################################################        
       2 NBENFHA  BIN FIXED(15),    ################################################        
       2 NBAUTCH  BIN FIXED(15),    ################################################        
       2 NOID_CI  DEC FIXED(7),     #################################################        
       2 DACIDEN  DEC FIXED(7),     #################################################        
       2 DAENVAG  DEC FIXED(7),     #################################################        
       2 NBENVAG  DEC FIXED(3),     #################################################        
       2 TBEGCOD(16)  BIT(1),       ###################################################        
                                    /*--!  !01 A CHARGE               */        
                                    /*--!  !02 CLIENT HANDICAPE       */        
                                    /*--!  !03 MOT PASSE TRANSMIS CL  */        
                                    /*--!  !04 NE PAS VOIR LES CONT   */        
                                    /*--!  !05 ABONNEMENT NEWSLETTER  */        
                                    /*--!  !06 NEWSLETTER HTML        */        
                                    /*--!  !07 COLLECTIV.:PRES.COCOM  */        
                                    /*--!  !08 REFUS ABONNEMENT       */        
                                    /*--!  !   NEWSLETTER             */        
                                    /*--!  !09 ABO. MY ETHIAS         */        
                                    /*--!  !10 ABO. WEB BNQ PARTICUL  */        
                                    /*--!  !11 ABO. PER ETHIAS        */        
                                    /*--!  !12 ABO. WEB BNQ CORPORA.  */        
       2 NOPERMI  CHAR(10),         #####################################################        
       2 CDLGSEC  CHAR(1),          ######################################################        
       2 CDORAFF  CHAR(2),          ######################################################        
       2 CDNATCL  CHAR(3),          ######################################################        
       2 LTPRECL  CHAR(15),         #####################################################        
       2 NUGSMCL  CHAR(15),         #####################################################        
       2 NOSEQUI  CHAR(3),          ######################################################        
                                    /*--!  !GENERE ALEATOIREMENT      */        
       2 CDGSTAM  CHAR(1),          ######################################################        
                                    /*--!  !VAL. POSS : I/R/S/BLANC   */        
                                    /*--!  !I : ISRT 1ERE DEM DE MDP  */        
                                    /*--!  !R : NEW MDP-GARDE USERID  */        
                                    /*--!  !S : SUP MDP POUR USERID   */        
       2 CDGSPWD  CHAR(1),          ######################################################        
                                    /*--!  !EMPECHE LA DEM. DE PLS    */        
                                    /*--!  !MDP SIMULTANEMENT         */        
                                    /*--!  !VAL. POSS : E/U/P/BLANC   */        
                                    /*--!  !E : DMD DE MDP EN COURS   */        
                                    /*--!  !U : USERID EXPEDIE        */        
                                    /*--!  !P : MDP EXPEDIE           */        
       2 CDORIDE  CHAR(1),          ######################################################        
                                    /*--!  !VAL. POSS : ALPHANUM      */        
                                    /*--!  !A: ASSURANCE              */        
                                    /*--!  !B: BANQUE                 */        
       2 CDWOCK1  CHAR(1),          ######################################################        
                                    /*--!  !MIS A JOUR PAR BMP        */        
                                    /*--!  !SEULEMENT                 */        
       2 CDWOCK2  CHAR(1),          ######################################################        
                                    /*--!  !MIS A JOUR PAR BMP OU     */        
                                    /*--!  !PAR GESTIONNAIRE AUTOR.   */        
       2 CDETCIV  CHAR(2),          ######################################################        
       2 CDCHAL1  CHAR(2),          ######################################################        
       2 CDCHAL2  CHAR(3),          ######################################################        
       2 CDMAJCL  CHAR(2),          ######################################################        
       2 LTMAJCL  CHAR(30),         #####################################################        
       2 AFFINIT(5),        
        3 CDAFIN1  CHAR(2),         #####################################################        
        3 CDAFIN2  CHAR(15),        ####################################################        
        3 CDFAMIL  CHAR(1),         #####################################################        
       2 CDCIDEN  CHAR(1),          ######################################################        
       2 DADERMS  PIC'(07)9',       ###################################################        
       2 NBCONMS  PIC'(05)9',       ###################################################        
       2 DAEXPCI  PIC'(07)9',       ###################################################        
       2 DAABNWL  PIC'(07)9',       ###################################################        
       2 CDSTACI  CHAR(1),          ######################################################        
       2 DASTACI  PIC'(07)9',       ###################################################        
       2 NOBCEAF  CHAR(10),         #####################################################        
       2 CDCTF2F  CHAR(1),          ######################################################        
       2 CDPEP  CHAR(1),            ########################################################        
       2 CDCOMMEN  CHAR(1),         #####################################################        
       2 CDPTIENF  CHAR(1),         #####################################################        
       2 CDEINVO  CHAR(1),          ######################################################        
       2 CDGEMAG  CHAR(1),          ######################################################        
       2 CDMLEIN  CHAR(1);          ######################################################        
         
  DCL 1     SSA_S1CLCOM,        
       2    FIL1         CHAR (8)       INIT ('S1CLCOM'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT ('('),        
       2    FIL3         CHAR (8)       INIT ('KS1CLCOM'),        
       2    OPER         CHAR (2)       INIT ('= '),        
       2    VALUE        FIXED(09),        
       2    FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMFOG - Generation le 26/04/2001 - 15:11        Lgth=00100 */        
 /******************************************        
 * SIGNALETIQUE DES RELATIONS              *        
 ******************************************/        
 DCL  1 S1CLREL ,                          ###############################################################        
 /*K*/ 2 NOSEQRE  BIN FIXED(15),           /*SQ!  !NUM. DE SEQUENCE   */        
       2 NOIDREL  CHAR(2),                 ######################################################        
       2 CDTYREL  CHAR(1),                 ######################################################        
       2 NOCLREL  DEC FIXED(7),            #################################################        
       2 TBEGCOD(16)  BIT(1),              ###################################################        
       2 REC_VOTE  CHAR(27),               ####################################################        
       2 DAASSEM  DEC FIXED(7),            #################################################        
       2 FILLER  CHAR(58);                 ######################################################        
 DCL 1     SSA_S1CLREL,        
      2    FIL1         CHAR (8)       INIT ('S1CLREL'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLREL'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        BIN FIXED(15,0),        
      2    FIL4         CHAR (1)       INIT (')');        
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:35        Lgth=00100 */        
 /*****************************************        
 * SIGNALETIQUE AUTRES PRENOMS            *        
 *****************************************/        
 DCL  1 S1CLPRE ,                           ###############################################################        
       2 LTPRCL1  CHAR(15),                 #####################################################        
       2 LTPRCL2  CHAR(15),                 #####################################################        
       2 TBEGCOD(16)  BIT(1),               ###################################################        
       2 FILLER  CHAR(68);                  ######################################################        
 DCL 1     SSA_S1CLPRE,        
       2    FIL1         CHAR (8)       INIT ('S1CLPRE'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT (')') ;        
 /* NRB - TDMGIL - Generation le 29/01/2001 - 17:35        Lgth=00100 */        
 /*****************************************        
 * SIGNALETIQUE ADRESSES E_MAIL           *        
 *****************************************/        
 DCL  1 S1CLEML ,                     ###############################################################        
       2 DAADEML  DEC FIXED(7),       #################################################        
       2 TBEGCOD(16)  BIT(1),         ###################################################        
                                      /*--!  !1 - ADRESSE INACTIVE    */        
       2 LTADEML  CHAR(50),           #####################################################        
       2 LTORIGI  CHAR(10),           #####################################################        
       2 CDPREML  CHAR(1),            ######################################################        
       2 FILLER  CHAR(33);            ######################################################        
 DCL 1     SSA_S1CLEML,        
       2    FIL1         CHAR (8)       INIT ('S1CLEML'),        
       2    FIL2         CHAR (1)       INIT ('*'),        
       2    CC           CHAR (3)       INIT ('---'),        
       2    PAR          CHAR (1)       INIT (')') ;        
 /* NRB - TDMGAS - GENERATION LE 12/05/2004 - 15:23        LGTH=00200 */        
 /**********************************************        
 * SIGNALETIQUE DES DEVIS INTERNET ET AUTRES  *        
 **********************************************/        
 DCL  1 S1CLDEV ,                     ###############################################################        
 /*KC*/2 DADVINT  DEC FIXED(11),      /*NO!  !DATE+SEQUENCE COMPL     */        
 /*F*/ 2 NODVINT  DEC FIXED(13),      /*NO!  !NUMeRO DEVIS            */        
       2 CDIDINT  DEC FIXED(9),       #################################################        
       2 HHMMINT  DEC FIXED(5),       #################################################        
       2 TBEGCOD(16)  BIT(1),         ###################################################        
                                      /*--!  ! 1 - INTERNET           */        
                                      /*--!  ! 2 - DELETE MYSMAP      */        
                                      /*--!  ! 3 - SAVE CRM PUR       */        
                                      /*--!  ! 4 - REMPLACE           */        
                                      /*--!  ! 5 - SAUVEGARDE MY SMAP */        
                                      /*--!  ! 6 - Souscription       */        
       2 CDTYPDV  CHAR(2),            ######################################################        
       2 CDORIDV  CHAR(2),            ######################################################        
       2 CDTYPRO  CHAR(7),            ######################################################        
         
       2 FILLER  CHAR(166);           #####################################################        
         
 DCL 1     SSA_S1CLDEV,        
      2    FIL1         CHAR (8)       INIT ('S1CLDEV'),        
      2    FIL2         CHAR (1)       INIT ('*'),        
      2    CC           CHAR (3)       INIT ('---'),        
      2    PAR          CHAR (1)       INIT ('('),        
      2    FIL3         CHAR (8)       INIT ('KS1CLDEV'),        
      2    OPER         CHAR (2)       INIT ('= '),        
      2    VALUE        FIXED(11),        
      2    FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMLIS - GENERATION LE 03/02/2009 - 15:12        LGTH=00110 */        
 /**************************************/        
 /*  DSM22 - DETAIL MEMO GESTIONNAIRE  */        
 /*  HDAM     SEGMENT : 110 BYTES      */        
 /**************************************/        
 /* AJOUT CDTYACT (TDMLIS 02-02-09)    */        
 /**************************************/        
         
 DCL  1 SMMEMOG ,                    ###############################################################        
                                     /*DB!  !DCR39   !SMMEMOG         */        
                                     /*DB!  !DDO10   !SMMEMOG         */        
                                     /*DB!  !DSM98   !SMMEMOG         */        
 /*K*/ 2 NOIDMEM  DEC FIXED(9),      /*NO!  !EX + GESTIONNAIRE        */        
 /*K*/ 2 NOSQMEM  BIN FIXED(15),     /*NO!  !NO SEQUENCE COMPL. 32767 */        
       2 DAOPEVN  DEC FIXED(7),      #################################################        
       2 CDNATEV  CHAR(3),           ######################################################        
       2 NOTIERL  CHAR(3),           ######################################################        
       2 TBEGCOD(16)  BIT(1),        ###################################################        
                                     /*--!  !01 : INTITULE=MESSAGE    */        
                                     /*--!  !02 : INTITULE AVEC VAR.  */        
                                     /*--!  !03 : BLANCHIMENT ARGENT  */        
                                     /*--!  !06 : FICHIER ATTACH      */        
                                     /*--!  !07 : LIGN NON VISIB NET  */        
                                     /*--!  !09 : LIGNE VISIBLE NET   */        
                                     /*--!  !10 : DOCUMENT DOC1       */        
                                     /*--!  !11 : LIGNE RETIREE       */        
                                     /*--!  !12 : LETTRE LG PORTRAIT  */        
                                     /*--!  !13 : LETTRE LG PAYSAGE   */        
                                     /*--!  !14 : NOMGINF !! NOTXTEV  */        
                                     /*--!  !15 : NOSQINT !! NOSQSUJ  */        
                                     /*--!  !     INTERVENTION+ SUJET */        
                                     /*--!  !     2 FB15 SUR NOMGINF  */        
                                     /*--!  !16 : NON MODIF           */        
       2 LTNATEV  CHAR(40),          #####################################################        
       2 NOEVNRL  BIN FIXED(15),     ################################################        
       2 NOTXTEV  BIN FIXED(15),     ################################################        
       2 CDORGEV  CHAR(8),           ######################################################        
       2 CDTTAPP  CHAR(2),           ######################################################        
       2 CDMMSEL  CHAR(3),           ######################################################        
       2 CDUTTRN  CHAR(8),           ######################################################        
       2 NOMGINF  CHAR(4),           ######################################################        
       2 CDTYCOL  CHAR(1),           ######################################################        
       2 FILLER  CHAR(17),           ######################################################        
       2 NODOCEV  DEC FIXED(7);      #################################################        
         
   DCL      NOTXTEV_MEMOG      CHAR(2)  BASED(ADDR(SMMEMOG.NOTXTEV));        
         
   DCL SMMEMOG_LTNATEV_R_1_4  CHAR(4)  BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_1_6  CHAR(6)  BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_1_11 CHAR(11) BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_1_16 CHAR(16) BASED(ADDR(SMMEMOG.LTNATEV));        
   DCL SMMEMOG_LTNATEV_R_5    CHAR(36)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),4));        
   DCL SMMEMOG_LTNATEV_R_5_2  CHAR(2)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),4));        
   DCL SMMEMOG_LTNATEV_R_7_1  CHAR(1)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),6));        
   DCL SMMEMOG_LTNATEV_R_8    CHAR(33)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_8_5  CHAR(5)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_8_7  CHAR(7)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_8_8  CHAR(8)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),7));        
   DCL SMMEMOG_LTNATEV_R_9_8  CHAR(8)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),8));        
   DCL SMMEMOG_LTNATEV_R_12   CHAR(29)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),11));        
   DCL SMMEMOG_LTNATEV_R_12_2 CHAR(2)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),11));        
   DCL SMMEMOG_LTNATEV_R_16_3 CHAR(3)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),15));        
   DCL SMMEMOG_LTNATEV_R_18_8 CHAR(8)        
                              BASED(PTRADD(ADDR(SMMEMOG.LTNATEV),17));        
         
    DCL 1   SSA_SMMEMOG,        
         2  FIL1        CHAR (8)     INIT ('SMMEMOG'),        
         2  FIL2        CHAR (1)     INIT ('*'),        
         2  CC          CHAR (3)     INIT ('---'),        
         2  PAR         CHAR (1)     INIT ('('),        
         2  FIL3        CHAR (8)     INIT ('KSMMEMOG'),        
         2  OPER        CHAR (2)     INIT ('= '),        
         2  VALUE0      FIXED DEC(9),        
         2  VALUE1      BIN FIXED(15),        
         2  FIL4        CHAR (1)     INIT (')');        
   /* LIGNE  MEMO AFF/POL/SIN FS MEMO */        
 /* NRB - TDMDOD - GENERATION LE 17/08/2004 - 10:48        LGTH=00110 */        
 /**************************************/        
 /*  DSM22 - HEADER MEMO GESTIONNAIRE  */        
 /*  HDAM         SEGMENT : 110 BYTES  */        
 /*  --------------------------------  */        
 /*  TDMDOD 17/08/04 AJOUT NOSQREB     */        
 /**************************************/        
         
 DCL  1 SMMEMOH ,                    ###############################################################        
                                     /*DB!  !DCR39   !SMMEMOG         */        
                                     /*DB!  !DDO10   !SMMEMOG         */        
                                     /*DB!  !DSM98   !SMMEMOG         */        
 /*K*/ 2 NOIDMEM  DEC FIXED(9),      /*NO!  !EX + GESTIONNAIRE        */        
 /*K*/ 2 NOSQMEM  BIN FIXED(15),     /*NO!  !NO SEQUENCE COMPL. 32767 */        
       2 NBSQMEM  BIN FIXED(15),     ################################################        
       2 NBLETEM  BIN FIXED(15),     ################################################        
       2 NBSQEVN  BIN FIXED(15),     ################################################        
       2 NBSQDEM  BIN FIXED(15),     ################################################        
       2 NBLIRET  BIN FIXED(15),     ################################################        
       2 NOSQREM  BIN FIXED(15),     ################################################        
       2 NBSQINT  BIN FIXED(15),     ################################################        
       2 NBSQRES(01)  BIN FIXED(15), ############################################        
       2 NOTXNFO  CHAR(2),           ######################################################        
       2 NOSQREB  BIN FIXED(15),     ################################################        
       2 FILLER  CHAR(51),           ######################################################        
       2 CDDBARC  CHAR(1),           ######################################################        
       2 TBEGSCR(64)  BIT(1),        ###################################################        
       2 TBEGCOD(16)  BIT(1),        ###################################################        
                                     /*--!  !08 = ANNULE              */        
                                     /*--!  !09 = PAS DE SIGNAL       */        
                                     /*--!  !SINISTRE                 */        
       2 DABLCMM  CHAR(4),           ######################################################        
       2 CDEGBLC  CHAR(1),           ######################################################        
       2 CDCMGES  CHAR(6),           ######################################################        
       2 DACLOMM  CHAR(4),           ######################################################        
       2 NOTXTHD  CHAR(2),           ######################################################        
       2 NODOCEM  DEC FIXED(7);      #################################################        
   /* HEADER MEMO AFF/POL/SIN FS MEMO */        
         
 DCL 1  KS1010J,        
         
      2  PTRPCB, ################################################################        
       3 DEU02PCB      PTR,          #####################################################        
       3 DC105PCB      PTR,          #####################################################        
       3 DS101PCB      PTR,          #####################################################        
       3 DS101$PCB     PTR,          #####################################################        
       3 DS102PCB      PTR,          #####################################################        
       3 DS104PCB      PTR,          #####################################################        
       3 DS104$PCB     PTR,          #####################################################        
       3 DS105PCB      PTR,          #####################################################        
       3 DS105$PCB     PTR,          #####################################################        
       3 DS106PCB      PTR,          #####################################################        
       3 DS106BPCB     PTR,          #####################################################        
       3 DS108PCB      PTR,          #####################################################        
       3 DS108$PCB     PTR,          #####################################################        
       3 DS125PCB      PTR,          #####################################################        
       3 DS125$PCB     PTR,          #####################################################        
       3 DS128PCB      PTR,          #####################################################        
       3 DS132PCB      PTR,          #####################################################        
       3 DS134PCB      PTR,          #####################################################        
       3 DS137PCB      PTR,          #####################################################        
       3 DSM22PCB      PTR,          #####################################################        
       3 DS149PCB      PTR,          #####################################################        
         
      2  INPUT, #################################################################        
       3 NOIDAFF       DEC FIXED(7), ############################################        
       3 TBEGCOD_I(64) BIT(1),       ##################################################        
                                     /* 01= screen button SIG         */        
                                     /* 02= ...                       */        
                                     /* 04= devis sauve my ethias     */        
                                     /* 13= screen button EML         */        
       3 CDCMGES       CHAR(08),     ################################################        
       3 CDOPTRN       CHAR(05),     ################################################        
       3 CDTYPOP       CHAR(01),     ################################################        
       3 CDLGTRN       CHAR(01),     ################################################        
       3 CDNATEV       CHAR(03),     ################################################        
       3 LTNATEV       CHAR(40),     ################################################        
       3 DEVIS,        
         4 NODVINT     PIC'(13)9',   ##############################################        
         4 CDIDINT     DEC FIXED(9), ############################################        
         4 CDTYPDV     CHAR(02),     ################################################        
         4 CDORIDV     CHAR(02),     ################################################        
         4 CDTYPRO     CHAR(07),     ################################################        
         
 /*********************************************************************/        
 /* DS101  :                                                          */        
 /*          S1AFFIL                                                  */        
 /*                 S1POLIC                                           */        
 /*                        S1ADPOL                                    */        
 /*                 S1ADAFF                                           */        
 /*                 S1ADCOU                                           */        
 /*                 S1RELAT                                           */        
 /*                 S1ENSEM                                           */        
 /*********************************************************************/        
       3 S1AFFIL_I     LIKE S1AFFIL, ############################################        
       3 S1POLIC_I     LIKE S1POLIC,        
       3 S1ADPOL_I     LIKE S1ADPOL,        
       3 S1ADAFF_I     LIKE S1ADAFF,        
       3 S1ADCOU_I     LIKE S1ADCOU,        
       3 S1RELAT_I     LIKE S1RELAT,        
       3 S1ENSEM_I     LIKE S1ENSEM,        
 /*********************************************************************/        
 /* DS102  :                                                          */        
 /*          S1COMPL                                                  */        
 /*********************************************************************/        
       3 S1COMPL_I     LIKE S1COMPL,        
 /*********************************************************************/        
 /* DS128  :                                                          */        
 /*          S1HISAF                                                  */        
 /*********************************************************************/        
       3 S1HISAF_I     LIKE S1HISAF,        
 /*********************************************************************/        
 /* DS132  :                                                          */        
 /*          S1CLACT                                                  */        
 /*                 S1CLPRO                                           */        
 /*                 S1CLACC                                           */        
 /*********************************************************************/        
       3 S1CLACT_I     LIKE S1CLACT,        
       3 S1CLPRO_I     LIKE S1CLPRO,        
       3 S1CLACC_I     LIKE S1CLACC,        
 /*********************************************************************/        
 /* DS134  :                                                          */        
 /*          S1CLCON                                                  */        
 /*                 S1CLADR                                           */        
 /*                 S1CLCPL                                           */        
 /*                 S1CLCOP                                           */        
 /*********************************************************************/        
       3 S1CLCON_I     LIKE S1CLCON,        
       3 S1CLADR_I     LIKE S1CLADR,        
       3 S1CLCPL_I     LIKE S1CLCPL,        
       3 S1CLCOP_I     LIKE S1CLCOP,        
 /*********************************************************************/        
 /* DS137  :                                                          */        
 /*          S1CLCOM                                                  */        
 /*                 S1CLREL                                           */        
 /*                 S1CLPRE                                           */        
 /*                 S1CLEML                                           */        
 /*********************************************************************/        
       3 S1CLCOM_I     LIKE S1CLCOM,        
       3 S1CLREL_I     LIKE S1CLREL,        
       3 S1CLPRE_I     LIKE S1CLPRE,        
       3 S1CLEML_I     LIKE S1CLEML,        
       3 S1CLDEV_I     LIKE S1CLDEV,        
 /* INPUT MY SMAP */        
       3 MYSMAP,        
         4 CDRSAFF   CHAR(01),        
         4 CDSEXAF   CHAR(01),        
         4 CDLGEAF   CHAR(01),        
         4 CDECVAF   CHAR(01),        
         4 NOTELAF   CHAR(13), ###########################        
         4 NOTEL2F   CHAR(13), ############################        
         4 NOTEL3F   CHAR(13), ########################        
         4 LTEMAIL   CHAR(50),        
         4 LTNMAFF   CHAR(30),        
         4 LTRUEAF   CHAR(25),        
         4 NOHA1AF   BIN FIXED(15),        
         4 NOHA2AF   CHAR(4),        
         4 CDCPOAF   CHAR(06),        
         4 LTLOCAF   CHAR(25),        
         4 CDPAYAF   CHAR(03),        
         4 CDTYPRO   CHAR(02),        
         4 CDGEPRO   CHAR(02),        
         4 NORULOC   FIXED DEC (7),        
         4 DANAIAF   FIXED DEC (7),        
      2 OUTPUT, #################################################################        
       3 TBEGCOD_O(64) BIT(1),       ##################################################        
                                     /* 01= UPDATE EFFECTIF, CAR #    */        
                                     /* 02=...                        */        
         
       3 S1AFFIL_O     LIKE S1AFFIL, ############################################        
       3 S1POLIC_O     LIKE S1POLIC,        
       3 S1ADPOL_O     LIKE S1ADPOL,        
       3 S1ADAFF_O     LIKE S1ADAFF,        
       3 S1ADCOU_O     LIKE S1ADCOU,        
       3 S1RELAT_O     LIKE S1RELAT,        
       3 S1ENSEM_O     LIKE S1ENSEM,        
       3 S1COMPL_O     LIKE S1COMPL,        
       3 S1HISAF_O     LIKE S1HISAF,        
       3 S1CLACT_O     LIKE S1CLACT,        
       3 S1CLPRO_O     LIKE S1CLPRO,        
       3 S1CLACC_O     LIKE S1CLACC,        
       3 S1CLCON_O     LIKE S1CLCON,        
       3 S1CLADR_O     LIKE S1CLADR,        
       3 S1CLCPL_O     LIKE S1CLCPL,        
       3 S1CLCOP_O     LIKE S1CLCOP,        
       3 S1CLCOM_O     LIKE S1CLCOM,        
       3 S1CLREL_O     LIKE S1CLREL,        
       3 S1CLPRE_O     LIKE S1CLPRE,        
       3 S1CLEML_O     LIKE S1CLEML,        
       3 S1CLDEV_O     LIKE S1CLDEV,        
       3 MYSMAP,        
         4 DADUJOU   CHAR(10),        
         4 NOIDAFF   CHAR(10),        
         4 CDRSAFF   CHAR(01),        
         4 LTTITAF   CHAR(15),        
         4 LTNMAFF   CHAR(50),        
         4 LTRUEAF   CHAR(50),        
         4 LTLOCAF   CHAR(50),        
         4 LTPAYAF   CHAR(50),        
         4 CDSEXAF   CHAR(01),        
         4 LTSEXAF   CHAR(10),        
         4 CDLGEAF   CHAR(01),        
         4 LTLGEAF   CHAR(15),        
         4 DANAIAF   CHAR(10),        
         4 CDECVAF   CHAR(01),        
         4 LTECVAF   CHAR(15),        
         4 NOTELAF   CHAR(13), ###########################        
         4 NOTEL2F   CHAR(13), ############################        
         4 NOTEL3F   CHAR(13), ########################        
         4 LTEMAIL   CHAR(50),        
         4 LTRUEAD   CHAR(50),        
         4 NOHA1AD   CHAR(06),        
         4 NOHA2AD   CHAR(06),        
         4 CDPOSAD   CHAR(06),        
         4 LTLOCAD   CHAR(50),        
         4 CDPAYAF   CHAR(03),        
         4 CDTYPRO   CHAR(02),        
         4 CDGEPRO   CHAR(02),        
         4 NOIDAFF_F7 FIXED(7),        
         4 RETOUR,        
          5 TBBOCHA(10) BIT (01),        
       3 DEVIS,        
         4 FIND_DEV  CHAR(1),        
      2 *              CHAR(0);        
         
 /*----------------------------------------------------REDEFINITIONS--*/        
 DCL  S1AFFIL_IR       CHAR( STG(KS1010J.INPUT .S1AFFIL_I))        
                      BASED(ADDR(KS1010J.INPUT .S1AFFIL_I));        
 DCL  S1ADAFF_IR       CHAR( STG(KS1010J.INPUT .S1ADAFF_I))        
                      BASED(ADDR(KS1010J.INPUT .S1ADAFF_I));        
 DCL  S1AFFIL_OR       CHAR( STG(KS1010J.OUTPUT.S1AFFIL_O))        
                      BASED(ADDR(KS1010J.OUTPUT.S1AFFIL_O));        
 DCL  S1ADAFF_OR       CHAR( STG(KS1010J.OUTPUT.S1ADAFF_O))        
                      BASED(ADDR(KS1010J.OUTPUT.S1ADAFF_O));        
 /*********************************************************************/        
 /* METHODES:                                                         */        
 /*                                                                   */        
 /* - CREATE_PROSPECT_NET : CREATION D'UN NOUVEL AFFILIE VIA LE NET   */        
 /*                         INPUT: NOIDAFF   = 0                      */        
 /*                                INFORMATIONS A INSERER             */        
 /*                         OUTPUT :                                  */        
 /*                                                                   */        
 /*********************************************************************/        
 /* CODES RETOURS:                                                    */        
 /*                                                                   */        
 /* - 001 : LA METHODE N'EXISTE PAS                                   */        
 /* - 002 : UN POINTEUR PCB N'EST PAS INITIALISE                      */        
 /* - 003 : LA DB MEMO EST FULL                                       */        
 /* - 004 : NOIDAFF N'EST PAS 0 ==> CREATION PROSPECT NET IMPOSSIBLE  */        
 /*********************************************************************/        
         
 DCL XSM532  ENTRY;           ####################################################        
 /*********************************************************************/        
 /*                                                                   */        
 /*   INTERFACE POUR MAJ DB STAT. VIA TWFI XSM532                     */        
 /*   ===========================================                     */        
 /*                                                                   */        
 /*********************************************************************/        
         
 DCL 1    JSM131,        
 /*------------------------- I N P U T -------------------------------*/        
      2   PTRPCB,                         ###############################################################        
       3  ALTPCB           PTR,           #################################################        
      2   PARAM,                          ################################################################        
       3  CDSCTRN          CHAR  (1),     ###########################################        
       3  CDEVTRN          CHAR  (1),     ###########################################        
       3  NBTYSTA          PIC '9',       #############################################        
       3  TBTYSTA (18),                   #########################################################        
        4 CDTYSTA          CHAR  (5),     ###########################################        
        4 DAOPGES          FIXED DEC (7), #######################################        
        4 LTIDCLE          CHAR  (56),    ##########################################        
        4 NOIDCPT          FIXED BIN (15),######################################        
        4 MTVAINC          FIXED BIN (31),######################################        
         
 /*------------------------ O U T P U T ------------------------------*/        
      2   RETURN_CODE,                    ##########################################################        
       3  CDRTPGM          CHAR (6),      ############################################        
       3  DBPTR            PTR,           #################################################        
       3  LASTDLI          CHAR (10);     ###########################################        
 /*********************************************************************/        
         
 KS1010J.DEU02PCB = GA2016J.DEU02PCB ;        
 KS1010J.DC105PCB = GA2016J.DC105PCB ; #####################        
 KS1010J.DS101PCB = GA2016J.DS101PCB ;        
 KS1010J.DS101$PCB = NULL();        
 KS1010J.DS102PCB = NULL();        
 KS1010J.DS104PCB = NULL();        
 KS1010J.DS104$PCB = NULL();        
 KS1010J.DS105PCB = NULL();        
 KS1010J.DS105$PCB = NULL();        
 KS1010J.DS106PCB = NULL();        
 KS1010J.DS106BPCB = NULL();        
 KS1010J.DS108PCB = NULL();        
 KS1010J.DS108$PCB = NULL();        
 KS1010J.DS125PCB = NULL();        
 KS1010J.DS125$PCB = NULL();        
 KS1010J.DS128PCB = NULL();        
 KS1010J.DS132PCB = NULL();        
 KS1010J.DS134PCB = NULL();        
 KS1010J.DS137PCB = GA2016J.DS137PCB ;        
 KS1010J.DSM22PCB = NULL();        
         
 /* NRB - TDMWEL - Generation le 21/02/2002 - 16:15        Lgth=02010 */        
 /* NRB - TDMSAU - Generation le 27/03/2000 - 09:51        Lgth=02010 */        
 /*******************        
 *  SEGMENT SCRATCH *        
 *******************/        
 DCL  1 SMSCRAT ,                           ###############################################################        
                                            /*DB!  !DCR10   !SMSCRAT  */        
                                            /*DB!  !DDO09   !SMSCRAT  */        
 /*K*/ 2 NOIDSCR  CHAR(10),                 /*CD!  !NOM DE LA SCRATCH */        
       2 LTNMSCR  CHAR(2000);               ###################################################        
         
         
  DCL 1 SSA_SMSCRAT,        
         2 FIL1         CHAR (8)       INIT ('SMSCRAT'),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KSMSCRAT'),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (10),        
         2 FIL4         CHAR (1)       INIT (')');        
  /*DCL   LTNMSCR_R        CHAR (2000)      DEF SMSCRAT.LTNMSCR ; */        
  DCL   LTNMSCR_R CHAR (2000) BASED(ADDR(SMSCRAT.LTNMSCR)) ;        
         
 /********************************************        
 *                    SPA                    *        
 ********************************************/        
 /*---------------------------------------------------------- SCENARI */        
 /*  DFINITION DES VARIABLES D'INITIALISATION DU SCENARIO             */        
 /*  ----------------------------------------------------             */        
              /* BLOCAGE CODE OPERATION */        
              /* NOUVEAU CANEVAS */        
         
 /*---------------------------------------------------------- SPAAREA */        
 DCL     SPA001_P            PTR;        
 DCL 1   SPA001_R            BASED(SPA001_P),        
      2  CDPOSTE             CHAR (4),        
      2  LTPOSTE             CHAR (25),        
      2  RESERVE             CHAR (1);        
 DCL 1   SCENARI             BASED(SPA001_P),        
      2  NOPGACT             CHAR (1),       #########################################        
      2  NOPGPRV(6)          CHAR (1),       #########################################        
      2  NUMIDLL(6)          BIN FIXED(15),  ####################################        
      2  TBCATOP             CHAR (06),      ########################################        
      2  CDTYSEL             CHAR (01),      ########################################        
      2  NBPAGE1             PIC '99',       #########################################        
      2  TBSCENA (16)        BIT (1);        ##########################################        
         
 DCL     SPA002_P            PTR;        
 DCL 1   SCENA02             BASED(SPA002_P),        
      2  NOIDCLI             CHAR (08),      ########################################        
      2  NOIDSCR             PIC '9999',     #######################################        
      2  RFSIGNA             CHAR (08);      ########################################        
         
 SPA001_P = ADDR(SPA.LTOPTR2);        
 SPA002_P = ADDR(SPA.LTRUE1A);        
         
 DCL DADESIN_SPA_F          FIXED DEC(7) BASED (ADDR(SPA.DADESIN_C));        
         
 DCL 1   SPA        BASED(GA2016J.SPA_PTR),        
         
         
     /*  PARTIE FIXE  */        
         
      2  LL_SPA              BIN FIXED(15),        
      2  XXXX                CHAR (4),        
      2  TRANSAC             CHAR (8),        
      2  MSG_SPA             CHAR (1),      ##########################################        
      2  CDTYECR             CHAR (01),     ###############################        
      2  CDRTTSS             CHAR (02),     ########################################        
      2  NORFPRT             CHAR (08),     ##################################        
      2  CDSCTRN             CHAR (01),     #########################################        
      2  CDATTRN             CHAR (02),     ########################################        
      2  LTSCTRN             CHAR (04),     ####################################        
      2  CDEVTRN             CHAR (01),     #########################################        
      2  CDUTTRN             CHAR (08),     #########################################        
      2  CDOPTRN             CHAR (05),     #################################        
      2  TBRETRN(6)          CHAR (08),     #####################################        
      2  TBFCACT(24)         BIT  (1),      ######################################        
      2  CMDEXEC             CHAR (01),     ########################################        
      2  LTOPTRN             CHAR (30),     ######################################        
      2  LTOPTR2             CHAR (30),     ######################################        
      2  TRANS1              CHAR (08),     #######################################        
      2  TRANS2              CHAR (08),     #######################################        
      2  CDLGTRN             PIC '9',       #######################################        
      2  NOIDAFF             FIXED (7),     ################################        
      2  LTNMAFF             CHAR (30),     ##############################        
      2  CDRSAFF             CHAR (1),      #######################################        
      2  CDSEXAF             CHAR (1),      ##############################        
      2  CDLGEAF             CHAR (1),      ###############################        
      2  CDPOGEO             FIXED(5),      #########################################        
      2  NORULOC             FIXED(7),      #########################################        
      2  LTRUE1A             CHAR (20),     ##################################        
      2  CDCPOAF             CHAR (06),     ##############################        
      2  LTLOCAF             CHAR (25),     ##################################        
      2  NOHA1AF             BIN FIXED(15), #############################        
      2  NOHA1FR             CHAR (01),     ##################################        
      2  NOHA2AF             CHAR (04),     #####################################        
      2  LTRUEAF             CHAR(25),      #######################        
      2  CDPAYAF             CHAR(03),      #############################        
      2  NOIDPOL             FIXED (8),     ################################        
      2  CDTYPOL             CHAR (2),      ##################################        
      2  CDLGPOL             CHAR (1),      ######################################        
      2  CDETAPO             CHAR (1),      ##########################################        
      2  LTNMALP             CHAR (06),     #####################################        
      2  NODOMPO             FIXED(11),     ######################################        
      2  NOCPTPO             FIXED(11),     #####################################        
      2  NOIDNAI             FIXED (7),     ##################################        
      2  NOIDPLQ             CHAR (5),      ################################        
      2  NOIDCHA             CHAR (20),     ################################        
      2  TBTYPAF             BIT (240),     ################################        
                                            /* 60 : CHOIX EURO  */        
      2  TBSEXAF (2)         CHAR (01),     #####################################        
      2  CDGRPCL             CHAR (01),     #####################################        
      2  CDCMGES             CHAR (08),     ####################################        
      2  CDCMPRO             CHAR (01),     #######################################        
      2  NOTL1AF             FIXED (3),     ######################################        
      2  NOTL2AF             FIXED (9),     ######################################        
      2  NOIDSIN             FIXED (9),     ######################################        
      2  NOPPAFF             FIXED (7),     ########################################        
      2  CDCATOP             CHAR (01),     ########################################        
      2  LTOPCOM             CHAR (30),     ########################################        
      2  TRANS3              CHAR (08),     ########################################        
      2  NOORAFF             FIXED (7),     ######################################        
      2  NOIDFAC             CHAR (03),     ####################################        
      2  DANAIAF             FIXED (10),    ###################################        
      2  NOIDFND             CHAR  (03),    #################################        
      2  NOIDMAT             CHAR  (11),    #####################################        
      2  NONATAF             FIXED (11),    ##############################        
      2  LTABRFP             CHAR  (30),    ##############################        
                                            /*  OU CAISSE ET TRANSIT*/        
                                            /* VOIR SPACODEF        */        
                                            /* OU GROUPE+MEDECIN    */        
                                            /* OU RENTE T1          */        
      2  CDEGCOU             CHAR  (01),    ########################################        
      2  TBEGCOD_AFF         BIT   (40),    ########################################        
      2  CDNATPA_RT          CHAR  (02),    ########################################        
                                            /* D5: NUMERO DU PROPRIET.*/        
      2  DAIMPPA_RT          FIXED (5),     #########################################        
      2  CDAPPPR             CHAR  (02),    #######################################        
      2  CDCATTR             CHAR (01),     ###############################        
      2  CDRFPRT             CHAR (03),     #########################################        
      2  NOAVECO             PIC'(3)9',     #########################################        
      2  NOIDFAM             FIXED (7),     ####################################        
                                            /* NO INTERVENANT PRODUCT.*/        
      2  CDTRASW             CHAR  (01),    #######################################        
      2  TBCDCLI             CHAR  (09),    #######################################        
      2  CDALCLI             CHAR  (01),    #######################################        
      2  CDLGFAM             CHAR  (01),    #######################################        
      2  CDLGRUE             CHAR  (01),    #######################################        
      2  NOIDREM             PIC '99',      ################################        
      2  NBSINPO             FIXED BIN(15), #################################        
      2  CDEVTRA             CHAR (01),     ####################################        
      2  NOAF1EX             FIXED(07),     #####################################        
      2  SW_MEMOSIN          CHAR (1),      ######################################        
      2  NOAF2EX             BIN FIXED (15),################################        
      2  ANSINPO             PIC '99',      #######################################        
      2  CDTYFND             CHAR  (01),    ####################################        
                                            /* EN SINISTRE, = A SI*/        
                                            /* PAIEMENT TYPE 89 */        
      2  DADESIN_C           CHAR  (04),    ####################################        
      2  NOIDCRT_SC          FIXED (7),     #####################################        
      2  NOIDSIN_RL          FIXED (9),     #######################################        
      2  CDTYPOL_RL          CHAR  (02),    ######################################        
      2  TBEGGES (8)         BIT   (01),    ######################################        
                                            /* 1=SUIVI GESTIONNAIRE */        
                                            /* 2=SUPER GESTIONNAIRE */        
                                            /* 3=COMMANDE DE MAJ    */        
                                            /* 4=CDE NON PROTEGEE   */        
                                            /* 5= ON=KERNEL CONVERTI*/        
                                            /* 6= ON=NOUVEAU CANEVAS*/        
                                            /* 7=DEVISE OUTPUT T.T. */        
                                            /* 8=CLAUSIER TYPE "U"  */        
      2  NORTMEM             CHAR  (02),    ############################        
      2  CDDVTRN             CHAR  (01),    ######################################        
      2  CDPGTRN             CHAR  (01),    ######################################        
      2  CDDVPOL             CHAR  (01),    ######################################        
      2  CDMODTT             CHAR  (01),    ######################################        
      2  NOTYPDC             PIC '99',      ########################################        
         
     /*  PARTIE VARIABLE : A L'USAGE D'UNE TRANSACTION APPELANTE */        
         
            /* SPA FIXE                         */        
 /*------------------------------------------------------------------*/        
 /*          UTILISE :          GA2016                               */        
 /*------------------------------------------------------------------*/        
 /* DCL 1    SPA                                                     */        
 /*------------------------------------------------------------------*/        
 /* ---- SPA COMPLEMENTAIRE LONGUEUR 200 --------------------------- */        
      2  MEMOCMD,                           ##############################################################        
       3 CDNATOP             CHAR(01),      #########################################        
       3 CDTYPOP             CHAR(01),      #########################################        
       3 CDOBJOP             CHAR(03),      #########################################        
      2  LTOBJOP             CHAR(75),      #########################################        
      2  NOSQMEM             BIN FIXED(15), ####################################        
      2  CDTTAPP             CHAR(2),       ##########################################        
      2  CDAPPEL             CHAR(1),       ##########################################        
      2  CDMMSEL             CHAR(3),       ##########################################        
      2  LTINTKN             CHAR(20),      #########################################        
                                            /* VOIR SPAAREAK         */        
      2  CDLASTK             CHAR(1),       ##########################################        
      2  NOIDRSQ             FIXED(05),     ########################################        
      2  NOLTGEN             CHAR(13),      #########################################        
      2  RSVSPAC             CHAR(75),      #########################################        
 /* ---------------------------------------------------------------- */        
      2  INFOS_USER, #####################################        
         3 NOIDUSR   PIC'(7)9',        
         3 NOSQUSR   PIC'99',        
         3 TYPUSER   CHAR(7),        
         3 CDLGUSR   CHAR(1),        
         3 TBEGUSR(16) BIT(1), ####################################        
         
         3 CDSTAT    CHAR(05),        
         3 LTSITE    CHAR(10),        
         3 CDAFGRP   CHAR(07),        
         3 CDMSETH   CHAR(01), ##################################        
         3 CDTYSOU   CHAR(5),        
      2   SPAS1096,        
 /*       sert au retour d'identification quand la personne n'est        
          pas encore affiliee , elle ne peut pas continuer ...        
          PS : ces donnees sont utilisees dans l'identification !!!  */        
       3   CDDEST            CHAR(05),    #########################################        
       3   NODEVI            CHAR(13),    #########################################        
                                          /* 00SAAMMJJnnnn           */        
       3   CDMODULO          CHAR(02),    #########################################        
       3   LTEMAIL           CHAR(50),        
       3   CDTYPRO           CHAR(2),     ##########################################        
       3   CDGEPRO           CHAR(2),     ##########################################        
       3   FILLSP1           CHAR(30),        
         
      2   SPAVAR,        
         
       3   LTOBJOP_016       CHAR(75), #########################################        
         
 /*       Infos identification : Uniquement si SPA.NOIDAFF > 0       */        
       3   IDENTI,        
        4   CDRSAFF          CHAR (1),        
        4   NOIDAFF          FIXED(7),        
        4   LTNMAFF          CHAR (30),        
        4   LTPRAFF          CHAR (15),        
        4   DANAIAF          PIC'(8)9', ########################################        
        4   CDSEXAF          CHAR (1),        
        4   CDLGEAF          CHAR (1),        
        4   LTRUEAF          CHAR (25),        
        4   NOHA1AF          BIN FIXED(15),        
        4   NOHA2AF          CHAR (04),        
        4   LTLOCAF          CHAR (25),        
        4   CDCPOAF          CHAR (06),        
        4   EMAILAF          CHAR (50),        
        4   CDTYPRO          CHAR(2),  ##########################################        
        4   CDGEPRO          CHAR(2),  ##########################################        
        4   DADEPER          PIC'(8)9', ########################################        
         
       3   CDTYPOP           CHAR(01), #########################################        
       3   CDLIMIT           CHAR(01), #########################################        
       3   CDBLOCK           CHAR(01), #########################################        
       3   NEWDEVI           CHAR(01), #########################################        
       3   NOIDDEV           CHAR(13), #########################################        
       3   DEVISAF           CHAR(13), #########################################        
       3   VERSDEV           FIXED(03),########################################        
       3   AUTORSO           CHAR(01), #########################################        
 /*   R_ETAPE = "A2016n" pour etre sr de raz la SPAVAR !!!          */        
       3   R_ETAPE           CHAR(06), #########################################        
       3   DAVALID           CHAR(10), #########################################        
       3   NBRELAN           PIC '9',  ##########################################        
         
       3   FILLSP2           CHAR(10),        
         
 /*       vehicule choisi en guidance WA2083                         */        
      2   SCENARIO_1,        
 /*       ===========                                                */        
       3   ANNCSTR           PIC'(4)9',   ########################################        
       3   MARDEBU           CHAR(40),    #########################################        
       3   TXTCARB           CHAR(08),    #########################################        
         
       3   NOIDMAR           FIXED(07),        
       3   NOIDMOD           FIXED(07),        
       3   NOIDTYP           FIXED(07),        
       3   LTMARQU           CHAR(40),        
       3   LTMODEL           CHAR(40),        
       3   LTTYPEV           CHAR(40),        
       3   NBRTRAN           FIXED(03),        
       3   NBTYPKW           FIXED(03),        
       3   CDTYOP3           CHAR(01),    ##########################################        
       3   CDTYDM3           CHAR(01),    ##########################################        
       3   PRIHTVA           FIXED(9,2),        
       3   NBRPORT           FIXED(03),        
       3   LTBOITE           CHAR(50),        
       3   LTCARBU           CHAR(50),        
       3   TYPCYLI           FIXED(05),        
       3   NBCVDIN           FIXED(03),        
       3   NBVITES           FIXED(03),        
       3   CDSPORT           CHAR(01),        
       3   POIDVID           FIXED(05),        
       3   TAXETMC           FIXED(9,2),        
       3   DAFINIM           PIC'(6)9',        
       3   CDECOV2           CHAR(01),     #########################################        
         
 /*       Options montes d'origine et accessoires supplementaires    */        
 /*       08.06.2010 New Tarifs : on ne passe plus sur cette page    */        
      2   SCENARIO_4,        
 /*       ===========                                                */        
 /*        
       3   TAB_OPT(100),        
        4   NOIDTXT          FIXED(07),        
        4   PRIOPTI          FIXED(09,2),        
 */        
 /*       les 14 accessoires/options e memoriser dans le devis    */        
       3   TAB_SUP(14),        
        4   LTOPTSU          CHAR(50),        
        4   PRIOPSU          FIXED(09,2),        
 /*       Options selectionnees                                      */        
 /*    3   SEL_OPT(100)      CHAR(01),          Y/N                  */        
       3   TOTALAC           FIXED(9,2),        
         
 /*       Infos conducteur                                           */        
      2   SCENARIO_5,        
 /*       ===========                                                */        
       3   DANAIPR           PIC'(8)9',      ############################        
       3   CDPOPRE           PIC'(4)9',        
       3   VACATVH           FIXED(9,2),        
       3   CDPOSRM           CHAR(1),        ##########################################        
       3   CDUSAVH           CHAR(1),        ##########################################        
       3   CDCDC26           CHAR(1),        ##########################################        
       3   CDASTMC           CHAR(1),        ##########################################        
       3   BOVHOCC           CHAR(1),        ##########################################        
       3   NBSINIS           PIC '99',       #########################################        
       3   DAPERMI           PIC'(8)9',      ########################################        
       3   BOAUTCP           CHAR(1),        ##########################################        
       3   CDTYPRO           CHAR(2),        ##########################################        
       3   CDGEPRO           CHAR(2),        ##########################################        
       3   BOHOREC           CHAR(1),        ##########################################        
       3   NBKMPAN           PIC'(6)9',      ########################################        
       3   AGEPREN           PIC'99',        ##########################################        
       3   STARTOK           CHAR(01),       #########################################        
 /*        Si CDJEUNE = 1=> voir donnees du scenario 8               */        
       3   CDJEUNE           PIC'9',         ###########################################        
       3   AGEPERM           PIC'99',        ##########################################        
         
 /*       Resultat devis auto                                        */        
      2   SCENARIO_6,        
 /*       ===========                                                */        
       3   CDPADIV           CHAR(02),       #########################################        
       3   CDBMDET           PIC'99',        ##########################################        
       3   CDCIBCL           CHAR(02),       #########################################        
       3   CDPROMO           CHAR(01),       #########################################        
                                             /* 1= eco + > 10.000kms */        
                                             /* 2= < 10.000kms       */        
                                             /* 3= < 10.000kms + eco */        
       3   NBKMAVH           PIC'999',       #########################################        
       3   RESULTAT_AUTO,        
        4   MTGARCI          FIXED(13,2),    ######################################        
        4   MTGACAS          FIXED(13,2),    ######################################        
        4   MTGACA1          FIXED(13,2),    ######################################        
        4   MTGAASS          FIXED(13,2),    ######################################        
         
 /*         mobility                                                 */        
        4   MTGAMOB          FIXED(13,2),    ######################################        
        4   MTGAMO1          FIXED(13,2),    ######################################        
        4   MTGAMO2          FIXED(13,2),    ######################################        
         
 /*         Montants mini omniums                                    */        
        4   MTGAOM1          FIXED(13,2),    ######################################        
        4   MTGAOM2          FIXED(13,2),    ######################################        
         
 /*         Montants des omniums pour chaque niveau de franchise     */        
        4   TB_OMNI(3),        
          5  MTGAOM3         FIXED(13,2),    ######################################        
          5  MTGAOM4         FIXED(13,2),    ######################################        
         
        4   TBPRIME(20),        
          5  CDTYGAR          CHAR(03),      ########################################        
          5  CDTFGAR          CHAR(02),      ########################################        
          5  NUVSTRF          PIC'99',       #########################################        
          5  MTPBMRD          FIXED(13,2),   #####################################        
         
       3   RESULTAT_AUTO_PROMO,        
        4   MTGARCI          FIXED(13,2),    ######################################        
        4   MTGACAS          FIXED(13,2),    ######################################        
        4   MTGACA1          FIXED(13,2),    ######################################        
        4   MTGAASS          FIXED(13,2),    ######################################        
         
 /*         mobility                                                 */        
        4   MTGAMOB          FIXED(13,2),    ######################################        
        4   MTGAMO1          FIXED(13,2),    ######################################        
        4   MTGAMO2          FIXED(13,2),    ######################################        
         
 /*         Montants mini omniums                                    */        
        4   MTGAOM1          FIXED(13,2),    ######################################        
        4   MTGAOM2          FIXED(13,2),    ######################################        
         
 /*         Montants des omniums pour chaque niveau de franchise     */        
        4   TB_OMNI(3),        
          5  MTGAOM3         FIXED(13,2),    ######################################        
          5  MTGAOM4         FIXED(13,2),    ######################################        
         
        4   TBPRIME(20),        
          5 CDTYGAR          CHAR(03),       #########################################        
          5 CDTFGAR          CHAR(02),       #########################################        
          5 NUVSTRF          PIC'99',        ##########################################        
          5 MTPBMRD          FIXED(13,2),    ######################################        
         
       3   RESULTAT_REM,        
        4   MTRMRCI          FIXED(13,2),    ######################################        
        4   MTRMVO1          FIXED(13,2),    ######################################        
        4   MTRMIN1          FIXED(13,2),    ######################################        
        4   MTRMBRI          FIXED(13,2),    ######################################        
        4   MTRMDM3          FIXED(13,2),    ######################################        
        4   MTRMDM4          FIXED(13,2),    ######################################        
         
        4   TBPRIME(10),        
          5 CDTYGAR          CHAR(03),       #########################################        
          5 CDTFGAR          CHAR(02),       #########################################        
          5 NUVSTRF          PIC'99',        ##########################################        
          5 MTPBMRD          FIXED(13,2),    ######################################        
         
 /*       Garanties choisies                                         */        
       3   SELECT_GAR,        
        4   CDSERCI          CHAR(01),       #########################################        
        4   CDSECAS          CHAR(01),       #########################################        
        4   CDSECA1          CHAR(01),       #########################################        
        4   CDSEASS          CHAR(01),       #########################################        
        4   CDTYPOM          CHAR(01),       #########################################        
                                             /* choisie : 1,2,3,4    */        
        4   CDNIVFR          CHAR(01),       #########################################        
                                             /* choisi 1,2,3         */        
                                             /* !!! si jeune         */        
        4   CDSEMOB          CHAR(01),       #########################################        
        4   CDSEMO1          CHAR(01),       #########################################        
         
 /*       pour la remorque                                           */        
        4   CDRMRCI          CHAR(01),       #########################################        
        4   CDRMVO1          CHAR(01),       #########################################        
        4   CDRMIN1          CHAR(01),       #########################################        
        4   CDRMBRI          CHAR(01),       #########################################        
        4   CDRMDM3          CHAR(01),       #########################################        
        4   CDRMDM4          CHAR(01),       #########################################        
         
 /*       Infos remorque                                             */        
      2   SCENARIO_7,        
 /*       ===========                                                */        
       3   LTMARRM           CHAR(15),        
       3   ANCSTRM           PIC'(4)9',        
       3   MTCATRM           FIXED(9,2),        
       3   MTACTRM           FIXED(9,2),        
       3   NUPDSRM           PIC'(5)9',        
         
 /*       Infos tarif jeune                                          */        
      2   SCENARIO_8,        
 /*       ===========                                                */        
       3   NBSINDM           PIC'99',        
       3   CDJEUFA           CHAR(01), #########################################        
       3   CDTY2PO           CHAR(01), #########################################        
       3   CDSTACO           CHAR(01), #########################################        
       3   CDENFCH           CHAR(01), #########################################        
       3   CDSTART           CHAR(01), #########################################        
         
 /*       souscription 1                                             */        
      2   SCENARIO_9,        
 /*       ===========                                                */        
       3   NUMCPIE           CHAR(5),  ##########################################        
       3   NOIDPOC           CHAR(15), #########################################        
       3   DAECHRC           CHAR(08), #########################################        
       3   CDRESRI           CHAR(01), #########################################        
       3   CDTYPRE           CHAR(01), #########################################        
       3   NUMSMRS           CHAR(06), #########################################        
         
 /*       souscription 2                                             */        
      2   SCENARIO_10,      #########################################################        
 /*       ===========                                                */        
       3   LTNOMCO           CHAR(30), #########################################        
       3   LTPRECO           CHAR(30), #########################################        
       3   DANAICO           CHAR(08), #########################################        
       3   LTEMPPR           CHAR(20), #########################################        
       3   CDTYPPR           CHAR(01), #########################################        
       3   CDCONAL           CHAR(1),  ##########################################        
       3   CDCONIV           CHAR(1),  ##########################################        
       3   CDCONFU           CHAR(1),  ##########################################        
       3   NBSINVO           PIC'9',   ###########################################        
       3   NBSINDM           PIC'9',   ###########################################        
       3   NBDEPER           PIC'9',   ###########################################        
         
 /*       souscription 3                                             */        
      2   SCENARIO_11,       #########################################################        
 /*       ===========                                                */        
       3   LTNMHA1           CHAR(30), #########################################        
       3   LTPRHA1           CHAR(30), #########################################        
       3   DANAIS1           PIC'(8)9',########################################        
       3   ANPERM1           CHAR(04), #########################################        
       3   CDQUHA1           CHAR(01), #########################################        
       3   LTQUHA1           CHAR(12), #########################################        
       3   LTNMHA2           CHAR(30), #########################################        
       3   LTPRHA2           CHAR(30), #########################################        
       3   DANAIS2           PIC'(8)9',########################################        
       3   ANPERM2           CHAR(04), #########################################        
       3   CDQUHA2           CHAR(01), #########################################        
       3   LTQUHA2           CHAR(12), #########################################        
       3   LTNMHA3           CHAR(30), #########################################        
       3   LTPRHA3           CHAR(30), #########################################        
       3   DANAIS3           PIC'(8)9',########################################        
       3   ANPERM3           CHAR(04), #########################################        
       3   CDQUHA3           CHAR(01), #########################################        
       3   LTQUHA3           CHAR(12), #########################################        
         
 /*       souscription 4                                             */        
      2   SCENARIO_12,       #########################################################        
 /*       ===========                                                */        
       3   NUPLQVH           CHAR(07), #########################################        
       3   LTCHAVH           CHAR(17), #########################################        
       3   NUPLQRM           CHAR(07), #########################################        
       3   LTCHARM           CHAR(17), #########################################        
       3   DAEFFRC           PIC'(8)9',########################################        
       3   DAEFFAU           PIC'(8)9',########################################        
       3   CDMODPA           CHAR(01), #########################################        
       3   NBKMCPT           FIXED(7), #########################################        
         
      2   FILLER             CHAR(112);        
         
 /********************************************************************/        
 /* CDPROMO : code promo permanente (nov 2009)                       */        
 /* 1 = 15% sur RC  et Omnium                                        */        
 /* si moins de 10000 kms/an                                         */        
 /*                                                                  */        
 /* 2 = 25% sur RC  et 15% sur Omnium                                */        
 /* si moins de 10000 kms/an ET vehicule eco                         */        
 /*                                                                  */        
 /* 3 = 10% sur RC                                                   */        
 /* si vehicule eco (et pas < 10000kms/an)                           */        
 /********************************************************************/        
             /* SPA VARIABLE                     */        
         
 /***************************/        
 /*    FICHIERS             */        
 /***************************/        
 DCL SYSPRINT FILE STREAM OUTPUT PRINT;        
         
 /***************************/        
 /*    DESCRIPTION DU MID   */        
 /***************************/        
 DCL 1 MIDE BASED(GA2016J.MID_PTR),        
 /* >>> HEADER DU MID         */        
      2   LL                  BIN FIXED(15),        
      2   Z1                  CHAR(1),        
      2   Z2                  CHAR(1),        
      2   HEADER,        
       3  TRANSAC             CHAR (08),  ############################        
       3  NOIDCLI             CHAR (08),  ############################        
       3  NOIDSCR             CHAR (04),  ############################        
       3  RFSIGNA             CHAR (08),  ############################        
       3  CDLGTRN             CHAR (01),  ############################        
       3  CDDVTRN             CHAR (01),  ############################        
       3  CLE                 CHAR (01),  ############################        
       3  CDOPTRN             CHAR (05),  ############################        
       3  CDIDSES             CHAR (01),  ############################        
       3  NODOACT             CHAR (02),  ############################        
       3  RESERVE             CHAR (07),  ############################        
 /*     HEADER DU MID     <<< */        
         
 /* ------------------------------------------------------------ */        
 /* DCL 1   MIDE   UTILISE : TA2016   TA2016   GA2016E           */        
 /* ------------------------------------------------------------ */        
  /* INFOS_STAT */        
 /*-----------------------------------------------------------*/        
 /*   MID    UTILISE POUR LES STATISTIQUES DU SITE ETHIAS     */        
 /*-----------------------------------------------------------*/        
 /* CKI 17.02.06 : SI MFS => AJOUT DANS INPUT JSM328M LONG 59 */        
 /*   (VOIR PPH102)                                           */        
 /*-----------------------------------------------------------*/        
      2  CDLGPAG     CHAR (01),        
      2  CDENTREE    CHAR (01),        
      2  CDTYPVI     CHAR (07),        
      2  NOPGACT     CHAR (16),        
      2  NOPGDEM     CHAR (16),        
      2  NOIDUSR     PIC '(07)9',        
      2  NOSQUSR     PIC '99',        
      2  BANNER      CHAR (09),        
         
   2  CDTYPOP          CHAR(01);             ###########################################        
         
 /* SI SOUSRIPTION => MIDE.CLE = 'S'                             */        
 /* SI RETOUR DEVIS=> MIDE.CLE = 'R'                             */        
         
 /***************************/        
 /*    DESCRIPTION DU MOD   */        
 /***************************/        
 DCL 1 PAGEE BASED(GA2016J.PAGE_PTR),        
 /* >>> HEADER PAGE 1       */        
      2  LL                 BIN FIXED(15),        
      2  ZZ                 BIN FIXED(15),        
      2  LPG                CHAR(02),        
      2  SCA                CHAR(02),        
      2  CDEXTOP            CHAR(08),  ##################################        
      2  NOIDSCR            CHAR(04),  ##################################        
      2  RFSIGNA            CHAR(08),  ##################################        
      2  CDLGTRN            CHAR(01),  ##################################        
      2  CDSCTRN            CHAR(01),  ##################################        
      2  LTSCTRN_A          CHAR(08),        
      2  LTSCTRN            CHAR(04),        
      2  LTOPTRN            CHAR(30),        
      2  CDOPTRN_A          CHAR(08),        
      2  CDOPTRN            CHAR(05),        
      2  BOMETRN            CHAR(01),        
      2  LTMETRN            CHAR(79),        
      2  RESERVE            CHAR(10),        
 /*     HEADER PAGE  1  <<< */        
 /* -------------------------------------------------------------- */        
 /* DCL 1   PAGEE     TRANSACTION: TA2016   TA2016   GA2016E       */        
 /* MY ETHIAS : CONSULTER DEVIS AUTO                               */        
 /* -------------------------------------------------------------- */        
 /* >>> HEADER 2 MOD      */        
      2  LTRFCSR            CHAR (07),  ####################################        
      2  NURFCSI            CHAR (03),  ####################################        
      2  NURFCSJ            CHAR (03),  ####################################        
      2  LTRFPOS            CHAR (07),  ####################################        
      2  NURFPSI            CHAR (03),  ####################################        
      2  NURFPSJ            CHAR (03),  ####################################        
      2  CDBTENT            CHAR (10),  ####################################        
      2  LTOPCDE            CHAR (60),  ####################################        
      2  RSERVE2            CHAR (60),  ####################################        
 /*     HEADER 2 MOD  <<< */        
      2 NOIDUSR         PIC'(7)9',        
      2 NOSQUSR         PIC '99',        
      2 NEWUSER         CHAR(1),        
      2 CDENTREE        CHAR (01),        
      2 NOIDPAG         CHAR(07),        
         
   2  NOIDDEV          CHAR(13),             #############################################        
   2  LTNMAFF          CHAR(30),             #############################################        
   2  DANAIAF          CHAR(08),             #############################################        
   2  LTRUEAF          CHAR(25),             #############################################        
   2  NOHA1AF          CHAR(04),             #############################################        
   2  NOHA2AF          CHAR(04),             #############################################        
   2  CDCPOAF          CHAR(06),             #############################################        
   2  LTLOCAF          CHAR(25),             #############################################        
   2  LTMARQU          CHAR(30),             #############################################        
   2  LTMODEL          CHAR(30),             #############################################        
   2  NUPUIVH          CHAR(03),             #############################################        
   2  TYPCYLI          CHAR(05),             #############################################        
   2  ANNCSTR          CHAR(04),             #############################################        
   2  NBPRTAV          CHAR(03),             #############################################        
   2  LTCARBU          CHAR(15),             #############################################        
   2  VACATVH          CHAR(10),             #############################################        
   2  VATAXIM          CHAR(10),             #############################################        
         
   2  BOVHOCC          CHAR(01),             #############################################        
   2  NBSINIS          CHAR(02),             #############################################        
   2  DAPERMI          CHAR(08),             #############################################        
   2  BOAUTCP          CHAR(01),             #############################################        
   2  CDTYPRO          CHAR(02),             #############################################        
   2  CDGEPRO          CHAR(02),             #############################################        
   2  BOHOREC          CHAR(01),             #############################################        
   2  NBKMPAN          CHAR(06),             #############################################        
   2  CDCDC26          CHAR(01),             #############################################        
   2  CDUSAVH          CHAR(01),             #############################################        
         
   2  CDPOSRM          CHAR(01),             #############################################        
   2  LTMARRM          CHAR(15),             #############################################        
   2  ANCSTRM          CHAR(04),             #############################################        
   2  MTCATRM          CHAR(10),             #############################################        
   2  MTACTRM          CHAR(10),             #############################################        
   2  NUPDSRM          CHAR(05),             #############################################        
         
   2  CDGARCI          CHAR(01),             #############################################        
   2  MTGARCI          CHAR(10),             #############################################        
   2  MTRCPRO          CHAR(10),             #############################################        
   2  CDGACAS          CHAR(01),             #############################################        
   2  MTGACAS          CHAR(10),             #############################################        
   2  CDGACA1          CHAR(01),             #############################################        
   2  MTGACA1          CHAR(10),             #############################################        
   2  CDGAASS          CHAR(01),             #############################################        
   2  MTGAASS          CHAR(10),             #############################################        
         
   2  CDGAMOB          CHAR(01),             #############################################        
   2  MTGAMOB          CHAR(10),             ##############################################        
         
   2  CDGAMO1          CHAR(01),             #############################################        
   2  MTGAMO1          CHAR(10),             ##############################################        
         
   2  CDTYPOM          CHAR(01),             #############################################        
   2  CDNIVFR          CHAR(01),             ###############################################        
   2  TB_LTFR(03),        
    3  LTFRAGR         CHAR(05),             #############################################        
    3  LTFRNAG         CHAR(05),             #############################################        
   2  MTOMNIU          CHAR(10),             #############################################        
   2  MTOMPRO          CHAR(10),             ###############################################        
         
   2  CDRMRCI          CHAR(01),             #############################################        
   2  MTRMRCI          CHAR(10),             #############################################        
   2  CDRMVO1          CHAR(01),             #############################################        
   2  MTRMVO1          CHAR(10),             #############################################        
   2  CDRMIN1          CHAR(01),             #############################################        
   2  MTRMIN1          CHAR(10),             #############################################        
   2  CDRMBRI          CHAR(01),             #############################################        
   2  MTRMBRI          CHAR(10),             #############################################        
   2  CDRMDM3          CHAR(01),             #############################################        
   2  MTRMDM3          CHAR(10),             #############################################        
   2  CDRMDM4          CHAR(01),             #############################################        
   2  MTRMDM4          CHAR(10),             #############################################        
   2  AUTORSO          CHAR(01),             #############################################        
   2  CDPROMO          CHAR(01),             #############################################        
   2  MTPROMO          CHAR(10),             #############################################        
   2  MTBENEF          CHAR(10),             #############################################        
   2  MTTOTAL          CHAR(10),             #############################################        
   2  DAVALID          CHAR(10),             #############################################        
   2  CDVVERT          CHAR(01);             #############################################        
         
 DCL  1  PAGEETXT       CHAR(STG(PAGEE)) BASED(ADDR(PAGEE));        
         
         
 /***************************************/        
 /*    DESCRIPTION DU MESSAGE D'ERREUR  */        
 /***************************************/        
 DCL 1 PAGEER BASED(GA2016J.PAGEER_PTR),        
         
 /************************************************************/        
 /*    PAGE D'ERREUR                                         */        
 /************************************************************/        
      2  LL                 BIN FIXED(15),        
      2  ZZ                 BIN FIXED(15),        
      2  LPG                CHAR (1),        
      2  LTOPTRN            CHAR(30),        
      2  LTMETRN            CHAR(79),        
      2  CDLGTRN            CHAR(01),   ##############################        
      2  LTRTPG1            CHAR(79),   ##############################        
      2  LTRTPG2            CHAR(79),   ##############################        
      2  LTRTPG3            CHAR(79);   ##############################        
         
         
 /*================== CONSTANTES ================================*/        
         
 DCL ON                  BIT(1)     VALUE('1'B);        
 DCL OFF                 BIT(1)     VALUE('0'B);        
 DCL NUM                 CHAR(10)   VALUE('0123456789');        
 DCL NUMB                CHAR(11)   VALUE('0123456789 ');        
 /********************************************************************/        
 /*     DECLARATION DES CARACTERES POUR TABLE 274                    */        
 /********************************************************************/        
         
 DCL MINUS274 CHAR (41)        
              VALUE ('abcdefghijklmnopqrstuvwxyzeee');        
         
      /*CARACTERES MINUSCULES EN CODE PAGE 274*/        
 /********************************************************************/        
 /*     DECLARATION DES CARACTERES POUR TABLE 500                    */        
 /********************************************************************/        
         
 DCL MINUS500 CHAR (41)        
              VALUE ('abcdefghijklmnopqrstuvwxyz{}@\');        
         
      /*CARACTERES MINUSCULES EN CODE PAGE 500*/        
 /********************************************************************/        
 /*     DECLARATION DES CARACTERES POUR TABLE 274 ET TABLE 500       */        
 /********************************************************************/        
         
 DCL MINUS CHAR (41);        
 DCL MAJUS CHAR (41)        
           VALUE ('ABCDEFGHIJKLMNOPQRSTUVWXYZEEEEUUUAAAIIOOC');        
         
                        /*CARACTERES MAJUSCULES + DECLARATION DE MINUS*/        
         
 /*================== VARIABLES =================================*/        
         
 DCL ERREUR       STATIC BIT(1)     INIT('0'B);        
         
 DCL CDRTPGM_W    STATIC CHAR (09)  INIT ('');        
         
 DCL (IND,I, J, K ,X, Y) FIXED BIN (31);        
         
 /**************************************************        
 * AUTRES DECLARATIONS                             *        
 **************************************************/        
         
 DCL INTER_C1            CHAR(1);        
 DCL INTER_P1            PIC'9'       DEF INTER_C1;        
 DCL INTER_C2            CHAR(2);        
 DCL INTER_P2            PIC'(2)9'    DEF INTER_C2;        
 DCL INTER_Z2            PIC'Z9';        
 DCL INTER_C3            CHAR(3);        
 DCL INTER_P3            PIC'(3)9'    DEF INTER_C3;        
 DCL INTER_Z3            PIC'ZZ9';        
 DCL INTER_F3            FIXED(03);        
 DCL INTER_C4            CHAR(4);        
 DCL INTER_P4            PIC'(4)9'    DEF INTER_C4;        
 DCL INTER_F4            FIXED(04);        
 DCL INTER_Z4            PIC'ZZZ9';        
 DCL INTER_C5            CHAR(5);        
 DCL INTER_P5            PIC'(5)9'    DEF INTER_C5;        
 DCL INTER_Z5            PIC'(4)Z9';        
 DCL INTER_F5            FIXED(05);        
 DCL INTER_C6            CHAR(6);        
 DCL INTER_P6            PIC'(6)9'    DEF INTER_C6;        
 DCL INTER_Z6            PIC'(5)Z9';        
 DCL INTER_C7            CHAR(7);        
 DCL INTER_P7            PIC'(7)9'    DEF INTER_C7;        
 DCL INTER_Z7            PIC'ZZZZZZ9';        
 DCL INTER_F7            FIXED(07);        
 DCL INTER_C8            CHAR(8);        
 DCL INTER_P8            PIC'(8)9'    DEF INTER_C8;        
 DCL INTER_F8            FIXED(08);        
 DCL INTER_C9            CHAR(9);        
 DCL INTER_P9            PIC'(9)9'    DEF INTER_C9;        
 DCL INTER_F9            FIXED(09);        
 DCL INTER_P10           PIC'(10)9';        
 DCL INTER_C10           CHAR(10)     DEF INTER_P10;        
 DCL INTER_C11           CHAR(11);        
 DCL INTER_P11           PIC'(11)9'   DEF INTER_C11;        
 DCL INTER_F11           FIXED(11);        
 DCL INTER_F15           FIXED(15);        
         
 DCL W_MTPLEIN           FIXED(15);        
 DCL W_MTPROMO           FIXED(15);        
 DCL W_MTBENEF           FIXED(15);        
 DCL W_MTTOTAL           FIXED(15);        
         
 DCL STAT_W              CHAR(08);        
         
 /********************************************        
 * DECLARATION DES PCB                       *        
 ********************************************/        
 /*---------------------------------------------------------- PCBINIT */        
 /*------------------------------------------------------ END PCBINIT */        
 /*-------------------------------------------------------- FCTINIVA */        
    DCL  CEETDLI ENTRY OPTIONS (ASM);        
    DCL  PLITDLI ENTRY;        
    DCL  GN    CHAR(4)               VALUE ('GN  ');        
    DCL  GU    CHAR(4)               VALUE ('GU  ');        
    DCL  GHU   CHAR(4)               VALUE ('GHU ');        
    DCL  GNP   CHAR(4)               VALUE ('GNP ');        
    DCL  GHN   CHAR(4)               VALUE ('GHN ');        
    DCL  GHNP  CHAR(4)               VALUE ('GHNP');        
    DCL  GCV   CHAR(4)               VALUE ('GCV ');        
    DCL  ISRT  CHAR(4)               VALUE ('ISRT');        
    DCL  DLET  CHAR(4)               VALUE ('DLET');        
    DCL  REPL  CHAR(4)               VALUE ('REPL');        
    DCL  CHNG  CHAR(4)               VALUE ('CHNG');        
    DCL  LOG   CHAR(4)               VALUE ('LOG ');        
    DCL  STAT  CHAR(4)               VALUE ('STAT');        
    DCL  ROLL  CHAR(4)               VALUE ('ROLL');        
    DCL  ROLB  CHAR(4)               VALUE ('ROLB');        
    DCL  PURG  CHAR(4)               VALUE ('PURG');        
    DCL  CMD   CHAR(4)               VALUE ('CMD ');        
    DCL  GCMD  CHAR(4)               VALUE ('GCMD');        
    DCL  CHKP  CHAR(4)               VALUE ('CHKP');        
    DCL  XRST  CHAR(4)               VALUE ('XRST');        
    DCL  DEQ   CHAR(4)               VALUE ('DEQ ');        
    DCL  ONE   FIXED BIN (31)        VALUE (0001B);        
    DCL  TWO   FIXED BIN (31)        VALUE (0010B);        
    DCL  THREE FIXED BIN (31)        VALUE (0011B);        
    DCL  FOUR  FIXED BIN (31)        VALUE (0100B);        
    DCL  FIVE  FIXED BIN (31)        VALUE (0101B);        
    DCL  SIX   FIXED BIN (31)        VALUE (0110B);        
    DCL  SEVEN FIXED BIN (31)        VALUE (0111B);        
    DCL  EIGHT FIXED BIN (31)        VALUE (1000B);        
    DCL  NINE  FIXED BIN (31)        VALUE (1001B);        
 /*----------------------------------------------------- END FCTINIVA */        
 /*-------------------------------------------------------- TPPCBMSK */        
   DCL ALTPCB PTR;        
    DCL  1  ALT      BASED(ALTPCB),        
           2  LTERM                CHAR(8),        
           2  RESERVED             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  DATEIMS              FIXED(7),        
           2  TIMEIMS              FIXED(7,1),        
           2  SEQUENCE             BIN FIXED(31),        
           2  MODNAME              CHAR(8),        
           2  USERFIELD            CHAR(8);        
 /*---------------------------------------------------- END TPPCBMSK */        
 ALTPCB= GA2016J.ALTPCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DC105PCB             PTR;        
    DCL  LKEY_DC105 FIXED BINARY(31,0);        
         
    DCL  1  DC105           BASED(DC105PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DC105 REFER(DC105.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DC105PCB= GA2016J.DC105PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA215PCB             PTR;        
    DCL  LKEY_DA215 FIXED BINARY(31,0);        
         
    DCL  1  DA215           BASED(DA215PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA215 REFER(DA215.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DA215PCB= GA2016J.DA215PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA215$PCB             PTR;        
         
    DCL  LKEY_DA215$ FIXED BINARY(31,0);        
         
    DCL  1  DA215$           BASED(DA215$PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA215$ REFER(DA215$.KEYLEN)        
 );        
 /*---------------------------------------------------- END DBPCBMSK */        
 DA215$PCB= GA2016J.DA215$PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA2152PCB             PTR;        
         
    DCL  LKEY_DA2152 FIXED BINARY(31,0);        
         
    DCL  1  DA2152           BASED(DA2152PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA2152 REFER(DA2152.KEYLEN)        
 );        
 /*---------------------------------------------------- END DBPCBMSK */        
 DA2152PCB= GA2016J.DA2152PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA216PCB             PTR;        
    DCL  LKEY_DA216 FIXED BINARY(31,0);        
         
    DCL  1  DA216           BASED(DA216PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA216 REFER(DA216.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DA216PCB= GA2016J.DA216PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DA223PCB             PTR;        
    DCL  LKEY_DA223 FIXED BINARY(31,0);        
         
    DCL  1  DA223           BASED(DA223PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DA223 REFER(DA223.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DA223PCB= GA2016J.DA223PCB;        
         
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DEU02PCB             PTR;        
    DCL  LKEY_DEU02 FIXED BINARY(31,0);        
         
    DCL  1  DEU02           BASED(DEU02PCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_DEU02 REFER(DEU02.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DEU02PCB= GA2016J.DEU02PCB;        
         
 /**************************************************        
 * AUTRES DECLARATIONS                             *        
 **************************************************/        
         
 /********************************************        
 * GESTION DES ERREURS                       *        
 ********************************************/        
 DCL 1   MESS_TRACE  STATIC,                ################################################        
      2  LL_TR              BIN FIXED(15)   INIT(44),        
      2  ZZ_TR              BIN FIXED(15)   INIT(0),        
      2  TRACE              CHAR(40);        
 DCL 1   TB_TRACE(100) STATIC,        
      2  FLAG_TRACE         CHAR(01),        
      2  MSGE_TRACE         CHAR(40);        
 DCL     ITRACE             BIN FIXED (31)  STATIC;        
 DCL     ERR_MSG     STATIC CHAR(79);        
 DCL     PTRMSG             PTR;        
 DCL 1   ERR_DBA            BASED(PTRMSG),        
      2  FILL1              CHAR(12),        
      2  FILL2              CHAR(04),        
      2  DBD_DBA            CHAR(08),        
      2  FILL3              CHAR(08),        
      2  CALL_DBA           CHAR(10),        
      2  FILL4              CHAR(05),        
      2  KEY_DBA            CHAR(24),        
      2  FILL5              CHAR(05),        
      2  ST_DBA             CHAR(02),        
      2  FILL6              CHAR(01);        
 TB_TRACE(*)='';        
 ITRACE=0;        
 PTRMSG=ADDR(ERR_MSG);        
         
         
 /* VARIABLE PERMETTANT D'AFFICHER LA DATE ET L'HEURE DE COMPILATION */        
         
 /* VARIABLE MAX CHECK POINT : NBR MAX. DE LOTS AUTORISE AVANT CHKPT */        
 /*------------------------------------------------------------ DEBUG */        
 PT: PROC;        
 /******************************/        
 /*       MEMO TRACE           */        
 /******************************/        
 JWB001.TBTRACE_I = JWB001.TBTRACE_I+1;        
 IF JWB001.TBTRACE_I > 100        
    THEN DO;        
         JWB001.TBTRACE_I = 1;        
         JWB001.FLAG_TRACE(*) = '';        
         END;        
 JWB001.FLAG_TRACE(JWB001.TBTRACE_I) = '*';        
 JWB001.MSGE_TRACE(JWB001.TBTRACE_I) = TRACE;        
                               IF JWB001.CDTRACE > 0 THEN        
      PUT SKIP EDIT(TRACE)(A);        
 $END PT;        
         
 DEBUG: PROC;        
 /**************************************/        
 /*       PRINTING   TRACE             */        
 /**************************************/        
 DCL KT BIN FIXED(31);        
 PUT FILE(SYSPRINT) EDIT('- PROGRAM TRACE: -')        
                        (SKIP(3),A)        
                        ('------------------')        
                        (SKIP,A);        
 DO KT=1 TO 100;        
    IF JWB001.MSGE_TRACE(KT)^=''        
       THEN PUT FILE(SYSPRINT)        
            EDIT(JWB001.FLAG_TRACE(KT),        
                 JWB001.MSGE_TRACE(KT))        
                                   (SKIP,A,A);        
 END;        
 PUT FILE(SYSPRINT) EDIT('------------------')        
                        (SKIP,A);        
 $END DEBUG;        
 /*-------------------------------------------------------- END DEBUG */        
 /*-------------------------------------------------------------------*/        
 ERR_DL1:PROC REORDER;        
 /********************************************************************/        
 /*                                                                  */        
 /*                PROCEDURE DL1 : ERREUR DATA BASE                  */        
 /*                                                                  */        
 /********************************************************************/        
 JWB001.CDRTPGM = 'ERR_DL1';        
 PUT PAGE EDIT('A2016E',  ' - VERSION DU : * 18.AUG.10 16.17.38 * - ',        
         
               'LAST SV CALL = ',JWB001.LSTCALL,        
               'LAST DB CALL = ',JWB001.LSTSERV)        
              (SKIP,A, A,(2) (SKIP,A,A));        
         
         
 CALL DEBUG;        
         
 $END ERR_DL1;        
 /*-------------------------------------------------------------------*/        
                        /* ERREUR DE DATA BASE - 'ERR_DL1' + JWB001  */        
 ON ERROR SNAP        
    BEGIN ;        
          ON ERROR SYSTEM;        
          PUT PAGE EDIT('A2016E', ' - VERSION DU : * 18.AUG.10 16.17.38        
 * - ',        
          ' ON ERROR CONDITION',        
          'ONCODE    = ',ONCODE,        
          'ONLOC     = ',ONLOC,        
          'ONSOURCE  = ',ONSOURCE)        
          (SKIP,A,A,        
           SKIP,A,        
           SKIP,A,F(5),        
           SKIP,A,A(10),        
           SKIP,A,A);        
         
           PUT SKIP EDIT('LAST SERV CALL = ',JWB001.LSTCALL,        
                         'LAST DB2  CALL = ',JWB001.LSTSERV)        
              (SKIP,A,A);        
         
         
          CALL DEBUG;        
          SIGNAL ERROR;        
    END;        
 /*-------------------------------------------------------------------*/        
      /* ERREUR PLI - SANS IOPCB, AVEC JWB001      */        
 /*********************************************************************/        
 /* TDMXXX !   DATE   ! DESCRIPTION DE LA MODIF                       */        
 /* ------ ! -------- ! ----------------------------------------------*/        
 /* TDMOHL ! 22042002 ! AJOUT INCLUDE PCBINIVA,FCTINIVA               */        
 /* TDMOHL ! 28042003 ! CHANGE INCLUDE FCTINIVA -> FCTINIVA           */        
 /* TDMOHL ! 15112004 ! AJOUT DECLARATION XEU100                      */        
 /*********************************************************************/        
 ERRORMSG: PROC(ERRORNUMBER,LANGAGECODE,ERRORMESSAGE) REORDER;        
 /***********************************/        
 /* RECHERCHE D'UN MESSAGE D'ERREUR */        
 /***********************************/        
         
 DCL ERRORNUMBER    CHAR(*),        
     LANGAGECODE    PIC '9',        
     ERRORMESSAGE   CHAR(*);        
         
 DCL XEU100 ENTRY OPTIONS(FETCHABLE);        
         
 /*---------------------------------------------------------- PCBINIT */        
 /*------------------------------------------------------ END PCBINIT */        
 /*-------------------------------------------------------- FCTINIVA */        
    DCL  CEETDLI ENTRY OPTIONS (ASM);        
    DCL  PLITDLI ENTRY;        
    DCL  GN    CHAR(4)               VALUE ('GN  ');        
    DCL  GU    CHAR(4)               VALUE ('GU  ');        
    DCL  GHU   CHAR(4)               VALUE ('GHU ');        
    DCL  GNP   CHAR(4)               VALUE ('GNP ');        
    DCL  GHN   CHAR(4)               VALUE ('GHN ');        
    DCL  GHNP  CHAR(4)               VALUE ('GHNP');        
    DCL  GCV   CHAR(4)               VALUE ('GCV ');        
    DCL  ISRT  CHAR(4)               VALUE ('ISRT');        
    DCL  DLET  CHAR(4)               VALUE ('DLET');        
    DCL  REPL  CHAR(4)               VALUE ('REPL');        
    DCL  CHNG  CHAR(4)               VALUE ('CHNG');        
    DCL  LOG   CHAR(4)               VALUE ('LOG ');        
    DCL  STAT  CHAR(4)               VALUE ('STAT');        
    DCL  ROLL  CHAR(4)               VALUE ('ROLL');        
    DCL  ROLB  CHAR(4)               VALUE ('ROLB');        
    DCL  PURG  CHAR(4)               VALUE ('PURG');        
    DCL  CMD   CHAR(4)               VALUE ('CMD ');        
    DCL  GCMD  CHAR(4)               VALUE ('GCMD');        
    DCL  CHKP  CHAR(4)               VALUE ('CHKP');        
    DCL  XRST  CHAR(4)               VALUE ('XRST');        
    DCL  DEQ   CHAR(4)               VALUE ('DEQ ');        
    DCL  ONE   FIXED BIN (31)        VALUE (0001B);        
    DCL  TWO   FIXED BIN (31)        VALUE (0010B);        
    DCL  THREE FIXED BIN (31)        VALUE (0011B);        
    DCL  FOUR  FIXED BIN (31)        VALUE (0100B);        
    DCL  FIVE  FIXED BIN (31)        VALUE (0101B);        
    DCL  SIX   FIXED BIN (31)        VALUE (0110B);        
    DCL  SEVEN FIXED BIN (31)        VALUE (0111B);        
    DCL  EIGHT FIXED BIN (31)        VALUE (1000B);        
    DCL  NINE  FIXED BIN (31)        VALUE (1001B);        
 /*----------------------------------------------------- END FCTINIVA */        
         
 /*******************************************/        
 /* DB DES TABLES                           */        
 /*******************************************/        
 /*-------------------------------------------------------- DBPCBMSK */        
   DCL      DBTABPCB             PTR;        
    DCL  LKEY_TAB FIXED BINARY(31,0);        
         
    DCL  1  TAB           BASED(DBTABPCB) ,        
         
           2  DBDNAME              CHAR(8),        
           2  SEGLEVEL             CHAR(2),        
           2  STATUS               CHAR(2),        
           2  PROCOPT              CHAR(4),        
           2  RESERVED             CHAR(4),        
           2  SEGNAME              CHAR(8),        
           2  KEYLEN               FIXED BIN(31),        
           2  SENSEG               FIXED BIN(31),        
           2  KEYAREA              CHAR(LKEY_TAB REFER(TAB.KEYLEN));        
         
 /*---------------------------------------------------- END DBPCBMSK */        
 DBTABPCB = JWB001.DBTABLE.DBTABPCB;        
         
 /******************/        
 /* SEGMENT TABLE  */        
 /******************/        
 /* NRB - TDMOHL - GENERATION LE 22/05/2007 - 14:28        LGTH=00274 */        
 /*****************************************************/        
 /*  TABLE MAIN :                                     */        
 /*****************************************************/        
         
 DCL  1 TBGI_MAIN ,                         #############################################################        
                                            /*TB!  !DPH01   !PHTABLE  */        
                                            /*TB!  !DRH01   !RHTABLE  */        
                                            /*TB!  !DND01   !NDTAB    */        
                                            /*TB!  !DSM25   !C1TAB    */        
                                            /*TB!  !DDO03   !C1TAB    */        
                                            /*TB!  !DIB15   !C1TAB    */        
                                            /*TB!  !DCR01   !CRTABLE  */        
                                            /*TB!  !DLG01   !TABLE    */        
                                            /*TB!  !DCT01   !CTTABLE  */        
                                            /*TB!  !DC201   !C2TABLE  */        
                                            /*TB!  !DCI02   !CITAB    */        
                                            /*TB!  !DSMC0   !C1TAB    */        
                                            /*TB!  !DAV01   !AVTABLE  */        
                                            /*TB!  !DCD01   !CDTAB    */        
                                            /*TB!  !DCL01   !CLTABLE  */        
                                            /*TB!  !DCP11   !CPTAB    */        
                                            /*TB!  !DCO39   !COTAB    */        
                                            /*TB!  !DC101   !C1TAB    */        
                                            /*TB!  !DC102   !C1TAB    */        
                                            /*TB!  !DC103   !C1TAB    */        
                                            /*TB!  !DC301   !C3TABLE  */        
                                            /*TB!  !DDP01   !DPTAB    */        
                                            /*TB!  !DGA01   !GATABLE  */        
                                            /*TB!  !DGI01   !GITABLE  */        
                                            /*TB!  !DGZ02   !GZTABLE  */        
                                            /*TB!  !DLP03   !LPTABLE  */        
                                            /*TB!  !DNC02   !NCTABLE  */        
                                            /*TB!  !DPS01   !PSTABLE  */        
                                            /*TB!  !DP101   !P1TABLE  */        
                                            /*TB!  !DRD01   !RDTABLE  */        
                                            /*TB!  !DSP01   !SPTABLE  */        
                                            /*TB!  !DSW02   !SWTAB    */        
                                            /*TB!  !DXI01   !XITABLE  */        
                                            /*TB!  !DFP24   !FPTABLE  */        
       2 TBTXCOD  CHAR(4),                  ######################################################        
       2 TBTXA01  CHAR(20),                 #####################################################        
       2 TBTXL01  CHAR(250);                ####################################################        
         
         
    DCL 1 SSA_C1TAB,        
         2 FIL1         CHAR (8)       INIT ('C1TAB  '),        
         2 FIL2         CHAR (1)       INIT ('*'),        
         2 CC           CHAR (3)       INIT ('---'),        
         2 PAR          CHAR (1)       INIT ('('),        
         2 FIL3         CHAR (8)       INIT ('KC1TAB  '),        
         2 OPER         CHAR (2)       INIT ('= '),        
         2 VALUE        CHAR (24),        
         2 FIL4         CHAR (1)       INIT (')');        
         
 /* NRB - TDMVAN - Generation le 11/04/2000 - 09:20        Lgth=00274 */        
 /******************************************        
 *  SEGMENT TABLE                          *        
 *  MESSAGES D'ERREUR                      *        
 ******************************************/        
         
 DCL  1 TBGI_T004 ,                    #############################################################        
 /*K*/ 2 TBTXCOD  CHAR(4),             /*CD!  !CODE TABLE             */        
 /*K*/ 2 TBTXA01  CHAR(20),            /*CD!  !ARGUMENT DE LA TABLE   */        
       2 LTMEERR(3)  CHAR(66),         ##################################################        
       2 $FILLER$ CHAR(052);           ####################################################        
 /* NRB - TDMOHL - GENERATION LE 17/10/2006 - 09:33        LGTH=00274 */        
 /*-------------------------------------------------------------------*/        
 /*-- DICTIONNAIRE DES MESSAGES D'ERREUR                              */        
 /*-------------------------------------------------------------------*/        
 DCL  1 TBGI_W004 ,                  #############################################################        
                                     /*TB!  !DSM25   !C1TAB           */        
                                     /*TB!  !DCR01   !CRTABLE         */        
                                     /*TB!  !DPH01   !PHTABLE         */        
                                     /*TB!  !DDO03   !C1TAB           */        
                                     /*TB!  !DLG01   !TABLE           */        
                                     /*TB!  !DND01   !NDTAB           */        
                                     /*TB!  !DRH01   !RHTABLE         */        
                                     /*TB!  !DC201   !C2TABLE         */        
                                     /*TB!  !AEDBTAB1!TABLE           */        
                                     /*TB!  !DGZ02   !GZTABLE         */        
                                     /*TB!  !DC301   !C3TABLE         */        
                                     /*--!  !L'06 ERRORNUMBER         */        
 /*K*/ 2 TBTXCOD  CHAR(4),           /*CD!  !CODE TABLE               */        
 /*K*/ 2 TBTXA01  CHAR(20),          /*CD!  !CODE MSG = KKPPPNNNIL    */        
                                     /*--!  !KK  = PROJET             */        
                                     /*--!  !PPP = NO PROGRAMME       */        
                                     /*--!  !NNN = NO MESSAGE         */        
                                     /*--!  !I   = NO SCENARIO        */        
                                     /*--!  !L   = LANGUE (F/N/A/E)   */        
       2 LTMEERR  CHAR(79),          #####################################################        
       2 FILLER  CHAR(170),          #####################################################        
       2 CDEGARG  CHAR(1);           ######################################################        
         
 /*******************************************/        
 /* AUTRES DECLARATIONS                     */        
 /*******************************************/        
 DCL CLAUSE        CHAR(7);        
 DCL METAPCB_W     PTR;        
 DCL CDDFSEG_W     CHAR (8);        
 DCL CDTABLE_W     CHAR (4);        
 DCL CDLGTRN_W     PIC '9';        
 DCL (I,J,L,M,K)   FIXED BIN(31);        
         
 /* SAUVER L'ENVIRONNEMENT */        
         
 METAPCB_W = IEU001.METAPCB;        
 CDDFSEG_W = IEU001.CDDFSEG;        
 CDLGTRN_W = LANGAGECODE;        
         
 IEU001.METAPCB = JWB001.DBTABLE.METAPCB;        
 SSA_C1TAB.FIL1 = JWB001.DBTABLE.LTSGTAB;        
 SSA_C1TAB.FIL3 = 'K' !! SUBSTR(JWB001.DBTABLE.LTSGTAB,1,7);        
 IEU001.CDDFSEG = JWB001.DBTABLE.CDDFTAB;        
         
 ERRORMESSAGE = '';        
 IF ERRORNUMBER = '' THEN        
      ERRORNUMBER = 'UNSPECI';        
         
 DO WHILE (ERRORMESSAGE = '');        
 CDTABLE_W = SUBSTR(JWB001.DBTABLE.CDDFTAB,4,4);        
 IF CDTABLE_W = 'W004' THEN        
      DO;        
      SSA_C1TAB.VALUE = 'W004' !! SUBSTR(ERRORNUMBER,1,9)        
                               !! TRANSLATE(CDLGTRN_W,'FNAE','1234');        
      CALL XEU100(IEU001,FOUR,GU,TAB,TBGI_W004,SSA_C1TAB);        
      END;        
 ELSE DO;        
      SSA_C1TAB.VALUE = CDTABLE_W !! ERRORNUMBER;        
      CALL XEU100(IEU001,FOUR,GU,TAB,TBGI_T004,SSA_C1TAB);        
      END;        
         
 SELECT (IEU001.CDRTPGM);        
   WHEN('  ')        
     IF CDTABLE_W = 'W004' THEN        
          DO;        
          ERRORMESSAGE = TBGI_W004.LTMEERR;        
          IF ERRORMESSAGE = '' THEN        
               ERRORMESSAGE = ERRORNUMBER;        
          END;        
     ELSE DO;        
          IF CDLGTRN_W < 1 ! CDLGTRN_W > 3 THEN        
               ERRORMESSAGE = TBGI_T004.LTMEERR(1);        
          ELSE IF TBGI_T004.LTMEERR(CDLGTRN_W) = '' THEN        
                    ERRORMESSAGE = TBGI_T004.LTMEERR(1);        
               ELSE ERRORMESSAGE = TBGI_T004.LTMEERR(CDLGTRN_W);        
          IF ERRORMESSAGE = '' THEN        
               ERRORMESSAGE = ERRORNUMBER;        
          END;        
   WHEN ('DBAPGE')        
             DO;        
             IF CDTABLE_W = 'W004' THEN        
                  DO;        
                  IF CDLGTRN_W = 1 THEN        
                       ERRORMESSAGE = ERRORNUMBER;        
                  ELSE CDLGTRN_W = 1;        
                  END;        
             ELSE ERRORMESSAGE = ERRORNUMBER;        
             IEU001.CDRTPGM = ' ';        
             END;        
   OTHERWISE DO;        
             CALL ERR_DL1;        
             RETURN;        
             END;        
   END;        
 END;        
         
 /* RETABLIR L'ENVIRONNEMMENT */        
         
 IEU001.METAPCB = METAPCB_W;        
 IEU001.CDDFSEG = CDDFSEG_W;        
         
 L=LENGTH(ERRORMESSAGE);        
 M=L;        
 K=INDEX(ERRORMESSAGE,'#');        
 IF K^=0 & SUBSTR(ERRORMESSAGE,K+7)=''  THEN        
      DO;        
      CLAUSE=SUBSTR(ERRORMESSAGE,K,7);        
      J=INDEX(CLAUSE,' ');        
      IF J=0 & VERIFY(SUBSTR(ERRORMESSAGE,K+8,L-(K+8)),' ')=0 THEN        
           DO;        
           SPA.TBFCACT(2)='1'B;        
           SPA.LTOPCOM=SUBSTR(CLAUSE,2,2)!!'#' !!SUBSTR(CLAUSE,4);        
           SUBSTR(ERRORMESSAGE,K)='';        
           DO J=L TO 1 BY -1        
              WHILE(SUBSTR(ERRORMESSAGE,J,1)=' ');        
           END;        
           IF JWB001.CDEVCLI = '3' THEN        
                SUBSTR(ERRORMESSAGE,J+1)=' (F2:...)'!!HEX3F;        
           ELSE SUBSTR(ERRORMESSAGE,J+1)=' (F2:...)';        
           END;        
      END;        
 ELSE IF JWB001.CDEVCLI = '3' THEN        
           DO;        
           DO I=L BY -1 TO 1 WHILE(SUBSTR(ERRORMESSAGE,I,1) = ' ');        
              M=M-1;                                                            
           END;                                                                 
           SELECT(M);                                                           
             WHEN(0)ERRORMESSAGE=HEX403F;                                       
             WHEN(L);                                                           
             OTHER SUBSTR(ERRORMESSAGE,M+1)=HEX3F;                              
           END;                                                                 
           END;        
 $END ERRORMSG;        
                        /* RECHERCHE MESSAGE D'ERREUR DANS DB TABLES */        
 /*-----------------------------------------------*/        
         
 /*******************************        
 *     RACINE DU SCENARIO       *        
 *******************************/        
 /*        
 JWB001.CDTRACE=3;        
 */        
 IF SPA.CDPGTRN ='5' THEN        
  DO;        
   MINUS = MINUS500;        
  END;        
 ELSE        
  DO;        
   MINUS = MINUS274;        
  END;        
         
 IF JWB001.CDTRACE=9        
 THEN DO;        
   PUT SKIP EDIT('--------------------------')(A);        
   PUT SKIP EDIT('!RACINE/CDRTPGM:'!!JWB001.CDRTPGM,'!')(A);        
   PUT SKIP EDIT('!RACINE/BOACCES:',SCENARI.TBSCENA(2),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOVALID:',SCENARI.TBSCENA(4),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOUPDTE:',SCENARI.TBSCENA(7),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOSUITE:',SCENARI.TBSCENA(8),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOSWTCH:',SCENARI.TBSCENA(9),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOSCROL:',SCENARI.TBSCENA(5),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOERRAC:',SCENARI.TBSCENA(3),'        !')(A);        
         
   PUT SKIP EDIT('!RACINE/BOREPOS:',SCENARI.TBSCENA(6),'        !')(A);        
         
   PUT SKIP EDIT('--------------------------')(A);        
 END;        
         
 SELECT(JWB001.LTNMMTH);        
    WHEN('SCENA_INIT')   CALL F1;        
    WHEN('CTX_GET')      CALL F2;        
    WHEN('CTX_SAVE')     CALL F3;        
    WHEN('CTRL_ACCES')   CALL F4;        
    WHEN('PAGE_DFT')     CALL F5;        
    WHEN('PAGE_INIT')    CALL F6;        
    WHEN('PAGE_SCROLL')  CALL F7;        
    WHEN('PAGE_XML')     CALL F8;        
    WHEN('PAGE9_XML')    CALL F9;        
    WHEN('VALID_SYN')    CALL FA;        
    WHEN('VALID_CTX')    CALL FB;        
    WHEN('UPDATE_DB')    CALL FC;        
    WHEN('SWITCH_SC')    CALL FD;        
    WHEN('TEST_SCROLL')  CALL FE;        
    WHEN('CTX_CLEAR')    CALL FF;        
    WHEN('TEST_PF1 ')    CALL FG;        
    WHEN('TEST_BOUTON')  CALL FH;        
    OTHER        
       DO;        
       JWB001.CDRTPGM = 'A2016E' !! '01';        
       IF JWB001.CDTRACE >= 3 THEN        
         DO;        
           PUT SKIP LIST( '!!! NOM DE METHODE NON REPERTORIE !!!');        
           PUT SKIP LIST('CONTENU DE L''INTERFACE GA2016E:');        
           PUT SKIP EDIT('METHODE =',JWB001.LTNMMTH) (A,A);        
         END;        
       END;        
 END;        
         
 IF JWB001.CDTRACE=9        
 THEN DO;        
   PUT SKIP EDIT('------------------------------')(A);        
   PUT SKIP EDIT('!END RACINE/CDRTPGM:'!!JWB001.CDRTPGM,'!')(A);        
   PUT SKIP EDIT('!END RACINE/BOACCES:',SCENARI.TBSCENA(2),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOVALID:',SCENARI.TBSCENA(4),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOUPDTE:',SCENARI.TBSCENA(7),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOSUITE:',SCENARI.TBSCENA(8),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOSWTCH:',SCENARI.TBSCENA(9),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOSCROL:',SCENARI.TBSCENA(5),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOERRAC:',SCENARI.TBSCENA(3),'        !')(        
 A);        
   PUT SKIP EDIT('!END RACINE/BOREPOS:',SCENARI.TBSCENA(6),'        !')(        
 A);        
   PUT SKIP EDIT('------------------------------')(A);        
 END;        
 /*-----------------------------------------------*/        
         
 F1: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F1';        
         
     CALL PT;        
 /**********************************************        
 * VERIFIER L'EXISTENCE DU SCENARIO            *        
 * CHARGER LA ZONE DE COMMUNICATION 'WKSCENA'  *        
 **********************************************/        
 CDRTPGM_W = '';        
 ERREUR    = OFF;        
         
 IF JWB001.CDTRACE >= 3 THEN        
    PUT SKIP LIST('SPA.CDOPTRN =',SPA.CDOPTRN);        
         
 SCENARI.NUMIDLL(LEVEL) = STG(MIDE);    ########################################        
         
 SCENARI.TBSCENA(2) = ON;        
         
 SCENARI.TBSCENA(4) = ON;        
         
 SCENARI.TBSCENA(7) = OFF;        
         
 SCENARI.TBSCENA(8) = OFF;        
         
 SCENARI.TBSCENA(9) = OFF;        
         
 SCENARI.TBSCENA(5) = OFF;        
         
 SCENARI.TBSCENA(3) = OFF;        
         
 SCENARI.TBSCENA(6) = OFF;        
         
 SCENARI.TBSCENA(1) = ON;        
         
 SCENARI.TBSCENA(11) = OFF;        
         
         
 SELECT(MIDE.CDLGTRN);        
   WHEN('1','F') SPA.CDLGTRN = 1;        
   WHEN('2','N') SPA.CDLGTRN = 2;        
   OTHER;        
 END;        
 CALL $DATES_TIMES;        
         
     TRACE = 'GA2016E ===> ' !! 'END F1';        
         
     CALL PT;        
 $END F1;        
 /*-----------------------------------------------*/        
 F2: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F2';        
         
     CALL PT;        
 /***************************************************/        
 /* RECHARGER LA RUBRIQUE COLLECTEE PAR LA GUIDANCE */        
 /***************************************************/        
 /* PS : on revient avec la SPA de la transac appel{e ... */        
         
     TRACE = 'GA2016E ===> ' !! 'END F2';        
         
     CALL PT;        
 $END F2;        
 /*-----------------------------------------------*/        
 F3: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F3';        
         
     CALL PT;        
 /********************************************        
 * INVOQUER LA GUIDANCE                      *        
 ********************************************/        
     TRACE = 'GA2016E ===> ' !! 'END F3';        
         
     CALL PT;        
 $END F3;        
 /*-----------------------------------------------*/        
 F4: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F4';        
         
     CALL PT;        
 /********************************************        
 * CONTROLE D'ACCES AUX RESSOURCES           *        
 ********************************************/        
 SCENARI.TBSCENA(2)    = OFF;        
         
 ERREUR     = OFF;        
 CDRTPGM_W  = '';        
 IF JWB001.CDTRACE >= 3 THEN DO;        
 PUT SKIP LIST('SPAVAR.NOIDDEV =',SPAVAR.NOIDDEV);        
 PUT SKIP LIST('SPAVAR.IDENTI.CDRSAFF=',SPAVAR.IDENTI.CDRSAFF);        
 PUT SKIP LIST('SPAVAR.IDENTI.NOIDAFF=',SPAVAR.IDENTI.NOIDAFF);        
 PUT SKIP LIST('SPAVAR.IDENTI.LTNMAFF=',SPAVAR.IDENTI.LTNMAFF);        
 PUT SKIP LIST('SPAVAR.IDENTI.DANAIAF=',SPAVAR.IDENTI.DANAIAF);        
 PUT SKIP LIST('SPAVAR.IDENTI.CDSEXAF=',SPAVAR.IDENTI.CDSEXAF);        
 PUT SKIP LIST('SPAVAR.IDENTI.CDLGEAF=',SPAVAR.IDENTI.CDLGEAF);        
 PUT SKIP LIST('SPAVAR.IDENTI.LTRUEAF=',SPAVAR.IDENTI.LTRUEAF);        
 INTER_F4 = SPAVAR.IDENTI.NOHA1AF;        
 INTER_P4 = INTER_F4;        
 PUT SKIP LIST('SPAVAR.IDENTI.NOHA1AF=',INTER_C4);        
 PUT SKIP LIST('SPAVAR.IDENTI.NOHA2AF=',SPAVAR.IDENTI.NOHA2AF);        
 PUT SKIP LIST('SPAVAR.IDENTI.LTLOCAF=',SPAVAR.IDENTI.LTLOCAF);        
 PUT SKIP LIST('SPAVAR.IDENTI.CDCPOAF=',SPAVAR.IDENTI.CDCPOAF);        
 PUT SKIP LIST('SPAVAR.IDENTI.EMAILAF=',SPAVAR.IDENTI.EMAILAF);        
 PUT SKIP LIST('SPAVAR.DAVALID=',SPAVAR.DAVALID);        
         
 END;        
         
 IF SPA.CDOPTRN = 'A2CDV' THEN        
   DO;        
     STAT_W = TRANSLATE(SPA.CDLGTRN,'FNF','123') !! 'A201001';        
     CALL STATSITE2(STAT_W,15,1,'M');######################################        
   END;        
         
     TRACE = 'GA2016E ===> ' !! 'END F4';        
         
     CALL PT;        
 $END F4;        
 /*-----------------------------------------------*/        
 F5: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F5';        
         
     CALL PT;        
 /********************************************        
 * PAGEE : VALEURS PAR DEFAUT                *        
 ********************************************/        
 IF JWB001.RETOUR !        
    (JWB001.CDEVCLI ^='3' &  SPA.MSG_SPA = '1')  THEN        
      DO;        
      CALL F6;        
      PAGEE = MIDE, BY NAME;        
      END;        
 ELSE DO;        
      SUBSTR(PAGEETXT,09,STG(PAGEE) - 8) = ' ';        
      END;        
         
 PAGEE.LL        = STG(PAGEE);        
 PAGEE.LTSCTRN_A = LOW(2) !! SPA.CDATTRN !! LOW(4);        
         
     TRACE = 'GA2016E ===> ' !! 'END F5';        
         
     CALL PT;        
 $END F5;        
 /*-----------------------------------------------*/        
         
 F6: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F6';        
         
     CALL PT;        
 /********************************************        
 * PAGEE : ACCES DB ET CHARGEMENT PAGEE      *        
 ********************************************/        
 CDRTPGM_W = '';        
 ERREUR    = OFF;        
         
 /* Voir si on n'a pas d{j@ souscrit sur ce devis */        
 SPAVAR.AUTORSO = 'Y';###############################################        
         
 IF SPAVAR.CDBLOCK = 'Y'        
   THEN SPAVAR.AUTORSO = 'N';        
         
 IF SPA.CDOPTRN ^= 'A2DVI'        
   THEN CALL F6_1;        
   ELSE SPAVAR.AUTORSO = 'N';        
         
 IF ^ERREUR        
   THEN CALL F6_2;        
         
 IF ERREUR        
   THEN DO;        
          CALL ERRORMSG(CDRTPGM_W,SPA.CDLGTRN,PAGEE.LTMETRN);        
        END;        
         
     TRACE = 'GA2016E ===> ' !! 'END F6';        
         
     CALL PT;        
 $END F6;        
 /*-----------------------------------------------*/        
         
 F6_1: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F6_1';        
         
     CALL PT;        
 /***************************************************************        
 * PAGEE : LIRE DS137 Devis My Ethias et voir si d{j@ souscrit  *        
 ***************************************************************/        
 DCL CDIDINT_W             PIC '(09)9';        
 DCL 1 CDIDINT_R           DEF CDIDINT_W,        
      2 NOIDUSR            PIC '(07)9',        
      2 NOSQUSR            PIC '(02)9';        
         
 KS1010J.INPUT = '';        
         
 KS1010J.INPUT.TBEGCOD_I(01) = ON; #########################        
 KS1010J.INPUT.TBEGCOD_I(13) = ON; ###################        
         
 /* DONNEES MEMO */        
 KS1010J.INPUT.CDLGTRN = SPA.CDLGEAF;        
         
 /* DONNEES DEVIS */        
 KS1010J.DEVIS.NODVINT = SPAVAR.NOIDDEV; ######################        
 KS1010J.INPUT.NOIDAFF = SPAVAR.IDENTI.NOIDAFF; ########################        
 /*        
 JWB001.CDTRACE = 9;        
 */        
 JWB001.LSTCALL = 'FC0.1';        
 JWB001.LTNMMTH = 'VALID_DEVIS_NET     ';        
         
 /* put skip list('---- devis recherche :',SPAVAR.NOIDDEV);*/        
 CALL KS1010 (IEU001,JWB001,KS1010J);        
         
 SELECT(JWB001.CDRTPGM);        
   WHEN('')        
    DO;        
      IF KS1010J.OUTPUT.S1CLDEV_O.TBEGCOD(6) = ON        
        THEN SPAVAR.AUTORSO = 'N';        
    END;        
   WHEN('NOTFOUND');###############################        
   OTHER DO;        
          ERREUR = ON;        
          IF JWB001.CDTRACE >= 3 THEN        
          PUT SKIP LIST('Erreur VALID_DEVIS_NET',JWB001.CDRTPGM);        
          CDRTPGM_W = JWB001.CDRTPGM;        
         END;        
 END;        
         
     TRACE = 'GA2016E ===> ' !! 'END F6_1';        
         
     CALL PT;        
 $END F6_1;        
 /*-----------------------------------------------*/        
         
 F6_2: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F6_2';        
         
     CALL PT;        
 /********************************************        
 * PAGEE : ACCES DB ET CHARGEMENT PAGEE      *        
 ********************************************/        
 PAGEE.NOIDUSR = SPA.NOIDUSR;        
 PAGEE.NOSQUSR = SPA.NOSQUSR;        
 PAGEE.NOIDDEV = SPAVAR.DEVISAF;        
         
 PAGEE.LTNMAFF = SPAVAR.IDENTI.LTNMAFF;        
 PAGEE.DANAIAF = SPAVAR.IDENTI.DANAIAF;        
 PAGEE.LTRUEAF = SPAVAR.IDENTI.LTRUEAF;        
 INTER_F4 = SPAVAR.IDENTI.NOHA1AF;        
 INTER_Z4 = INTER_F4;        
 PAGEE.NOHA1AF = INTER_Z4;        
 PAGEE.NOHA2AF = SPAVAR.IDENTI.NOHA2AF;        
 PAGEE.CDCPOAF = SPAVAR.IDENTI.CDCPOAF;        
 PAGEE.LTLOCAF = SPAVAR.IDENTI.LTLOCAF;        
         
 PAGEE.LTMARQU = SUBSTR(SCENARIO_1.LTMARQU,1,30);        
 PAGEE.LTMODEL = SUBSTR(SCENARIO_1.LTMODEL,1,30);        
 INTER_F3 = SCENARIO_1.NBTYPKW;        
 INTER_Z3 = INTER_F3;        
 PAGEE.NUPUIVH = INTER_Z3;        
 INTER_F5 = SCENARIO_1.TYPCYLI;        
 INTER_Z5 = INTER_F5;        
 PAGEE.TYPCYLI = INTER_Z5;        
 INTER_P4      = SCENARIO_1.ANNCSTR;        
 PAGEE.ANNCSTR = INTER_C4;        
 INTER_P3 = SCENARIO_1.NBRTRAN;        
 INTER_Z3 = INTER_P3;        
 PAGEE.NBPRTAV = INTER_Z3;        
         
 PAGEE.LTCARBU = SUBSTR(SCENARIO_1.LTCARBU,1,15);        
         
 INTER_F15 = SCENARIO_5.VACATVH * 100;        
 INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
 PAGEE.VACATVH = INTER_C10;        
         
 IF SCENARIO_5.CDASTMC = 'Y'        
   THEN DO;        
          INTER_F15 = SCENARIO_1.TAXETMC * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEE.VATAXIM = INTER_C10;        
        END;        
   ELSE PAGEE.VATAXIM = '';        
         
 PAGEE.BOVHOCC = SCENARIO_5.BOVHOCC;        
 INTER_Z2 = SCENARIO_5.NBSINIS;        
 PAGEE.NBSINIS = INTER_Z2;        
         
 PAGEE.DAPERMI = SCENARIO_5.DAPERMI;        
 PAGEE.BOAUTCP = SCENARIO_5.BOAUTCP;        
 PAGEE.CDTYPRO = SCENARIO_5.CDTYPRO;        
 PAGEE.CDGEPRO = SCENARIO_5.CDGEPRO;        
 PAGEE.BOHOREC = SCENARIO_5.BOHOREC;        
 INTER_Z6 = SCENARIO_5.NBKMPAN;        
 PAGEE.NBKMPAN = INTER_Z6;        
         
 PAGEE.CDCDC26 = SCENARIO_5.CDCDC26;        
 PAGEE.CDUSAVH = SCENARIO_5.CDUSAVH;        
 PAGEE.CDPOSRM = SCENARIO_5.CDPOSRM;        
         
 IF SCENARIO_5.CDPOSRM = 'Y' THEN        
   DO;        
     PAGEE.LTMARRM = SCENARIO_7.LTMARRM;        
     PAGEE.ANCSTRM = SCENARIO_7.ANCSTRM;        
     INTER_F15 = SCENARIO_7.MTCATRM * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEE.MTCATRM = INTER_C10;        
     INTER_F15 = SCENARIO_7.MTACTRM * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEE.MTACTRM = INTER_C10;        
     INTER_Z5 = SCENARIO_7.NUPDSRM;        
     PAGEE.NUPDSRM = INTER_Z5;        
   END;        
 ELSE        
   DO;        
     PAGEE.LTMARRM = '';        
     PAGEE.ANCSTRM = '';        
     PAGEE.MTCATRM = '';        
     PAGEE.MTACTRM = '';        
     PAGEE.NUPDSRM = '';        
   END;        
         
 /* Afficher les garanties choisies et Calcul du total normal */        
 /*                                           et total promo  */        
 /* --------------------------------------------------------- */        
 PAGEE.CDGARCI = 'N';        
 PAGEE.MTGARCI = '';        
 PAGEE.MTRCPRO = '';        
         
 PAGEE.CDGACAS = 'N';        
 PAGEE.MTGACAS = '';        
 PAGEE.CDGACA1 = 'N';        
 PAGEE.MTGACA1 = '';        
 PAGEE.CDGAASS = 'N';        
 PAGEE.MTGAASS = '';        
 PAGEE.CDGAMOB = 'N';        
 PAGEE.MTGAMOB = '';        
 PAGEE.CDGAMO1 = 'N';        
 PAGEE.MTGAMO1 = '';        
         
 PAGEE.CDTYPOM = '';        
 PAGEE.CDNIVFR = '';        
 PAGEE.TB_LTFR(1).LTFRAGR = '    0';        
 PAGEE.TB_LTFR(2).LTFRAGR = '  450';        
 PAGEE.TB_LTFR(3).LTFRAGR = '  900';        
         
 PAGEE.TB_LTFR(1).LTFRNAG = '  450';        
 PAGEE.TB_LTFR(2).LTFRNAG = '  900';        
 PAGEE.TB_LTFR(3).LTFRNAG = ' 1350';        
         
 PAGEE.MTOMNIU = '';        
 PAGEE.MTOMPRO = '';        
         
 W_MTTOTAL = 0;        
 W_MTPROMO = 0;        
 W_MTBENEF = 0;        
         
 PAGEE.CDPROMO = SCENARIO_6.CDPROMO;        
         
 PAGEE.MTBENEF = '';        
 PAGEE.MTTOTAL = ''; ######################################        
 PAGEE.MTPROMO = ''; ######################################        
         
 IF SCENARIO_6.SELECT_GAR.CDSERCI = 'Y' THEN        
   DO;        
     PAGEE.CDGARCI = 'Y';        
     INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGARCI * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEE.MTGARCI = INTER_C10;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
         INTER_F15 = SCENARIO_6.RESULTAT_AUTO_PROMO.MTGARCI * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTRCPRO = INTER_C10;        
       END;        
     W_MTPROMO = W_MTPROMO + INTER_F15;        
   END;        
         
 IF SCENARIO_6.SELECT_GAR.CDSECAS = 'Y'        
   THEN DO;        
          PAGEE.CDGACAS = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACAS * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEE.MTGACAS = INTER_C10;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
          W_MTPROMO = W_MTPROMO + INTER_F15;        
        END;        
         
 IF SCENARIO_6.SELECT_GAR.CDSECA1 = 'Y'        
   THEN DO;        
          PAGEE.CDGACA1 = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGACA1 * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEE.MTGACA1 = INTER_C10;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
          W_MTPROMO = W_MTPROMO + INTER_F15;        
        END;        
         
 IF SCENARIO_6.SELECT_GAR.CDSEASS = 'Y'        
   THEN DO;        
          PAGEE.CDGAASS = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAASS * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEE.MTGAASS = INTER_C10;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
          W_MTPROMO = W_MTPROMO + INTER_F15;        
        END;        
         
 /*mobilite plus  tarif plein */        
 IF SCENARIO_6.SELECT_GAR.CDSEMOB = 'Y'        
   THEN DO;        
          PAGEE.CDGAMOB = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAMOB * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEE.MTGAMOB = INTER_C10;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
          W_MTPROMO = W_MTPROMO + INTER_F15;        
        END;        
         
 /*mobilite plus  tarif reduit*/        
 IF SCENARIO_6.SELECT_GAR.CDSEMO1 = 'Y'        
   THEN DO;        
          PAGEE.CDGAMO1 = 'Y';        
          INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAMO1 * 100;        
          INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
          PAGEE.MTGAMO1 = INTER_C10;        
          W_MTTOTAL = W_MTTOTAL + INTER_F15;        
          W_MTPROMO = W_MTPROMO + INTER_F15;        
        END;        
         
 PAGEE.CDTYPOM = SCENARIO_6.SELECT_GAR.CDTYPOM;        
         
 /* Une omnium ? */        
 SELECT(SCENARIO_6.SELECT_GAR.CDTYPOM);        
   WHEN('1') DO; ##########################        
     INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAOM1 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEE.MTOMNIU = INTER_C10;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
         INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM1 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTOMPRO = INTER_C10;        
       END;        
     W_MTPROMO = W_MTPROMO + INTER_F15;        
   END;        
   WHEN('2') DO; ###############################        
     INTER_F15 = SCENARIO_6.RESULTAT_AUTO.MTGAOM2 * 100;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEE.MTOMNIU = INTER_C10;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
         INTER_F15 =        
           SCENARIO_6.RESULTAT_AUTO_PROMO.MTGAOM2 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTOMPRO = INTER_C10;        
       END;        
     W_MTPROMO = W_MTPROMO + INTER_F15;        
   END;        
   WHEN('3') DO;        
     PAGEE.CDNIVFR = SCENARIO_6.SELECT_GAR.CDNIVFR;        
         
     SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
       WHEN('1') DO;        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM3 * 100;        
         END;        
       WHEN('2') DO;        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM3 * 100;        
         END;        
       WHEN('3') DO;        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM3 * 100;        
         END;        
       OTHER INTER_F15 = 0;        
     END;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEE.MTOMNIU = INTER_C10;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
       SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
         WHEN('1')        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM3 * 100;        
         WHEN('2')        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM3 * 100;        
         WHEN('3')        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM3 * 100;        
         OTHER INTER_F15 = 0;        
       END;        
       INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
       PAGEE.MTOMPRO = INTER_C10;        
       END;        
     W_MTPROMO = W_MTPROMO + INTER_F15;        
   END;        
   WHEN('4') DO;        
     PAGEE.CDNIVFR = SCENARIO_6.SELECT_GAR.CDNIVFR;        
         
     SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
       WHEN('1') DO;        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(1).MTGAOM4 * 100;        
         END;        
       WHEN('2') DO;        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(2).MTGAOM4 * 100;        
         END;        
       WHEN('3') DO;        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO.TB_OMNI(3).MTGAOM4 * 100;        
         END;        
       OTHER INTER_F15 = 0;        
     END;        
     INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
     PAGEE.MTOMNIU = INTER_C10;        
     W_MTTOTAL = W_MTTOTAL + INTER_F15;        
     IF SCENARIO_6.CDPROMO ^= '' THEN        
       DO;        
       SELECT(SCENARIO_6.SELECT_GAR.CDNIVFR);        
         WHEN('1')        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(1).MTGAOM4 * 100;        
         WHEN('2')        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(2).MTGAOM4 * 100;        
         WHEN('3')        
           INTER_F15 =        
             SCENARIO_6.RESULTAT_AUTO_PROMO.TB_OMNI(3).MTGAOM4 * 100;        
         OTHER INTER_F15 = 0;        
       END;        
       INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
       PAGEE.MTOMPRO = INTER_C10;        
       END;        
     W_MTPROMO = W_MTPROMO + INTER_F15;        
   END;        
   OTHER;        
 END;        
         
 PAGEE.CDRMRCI = 'N';        
 PAGEE.MTRMRCI = '';        
 PAGEE.CDRMVO1 = 'N';        
 PAGEE.MTRMVO1 = '';        
 PAGEE.CDRMIN1 = 'N';        
 PAGEE.MTRMIN1 = '';        
 PAGEE.CDRMBRI = 'N';        
 PAGEE.MTRMBRI = '';        
 PAGEE.CDRMDM3 = 'N';        
 PAGEE.MTRMDM3 = '';        
 PAGEE.CDRMDM4 = 'N';        
 PAGEE.MTRMDM4 = '';        
         
 IF SCENARIO_5.CDPOSRM = 'Y' THEN        
   DO;        
     IF SCENARIO_6.SELECT_GAR.CDRMRCI = 'Y' THEN        
       DO;        
         PAGEE.CDRMRCI = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMRCI * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTRMRCI = INTER_C10;        
         W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         W_MTPROMO = W_MTPROMO + INTER_F15;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMVO1 = 'Y' THEN        
       DO;        
         PAGEE.CDRMVO1 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMVO1 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTRMVO1 = INTER_C10;        
         W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         W_MTPROMO = W_MTPROMO + INTER_F15;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMIN1 = 'Y' THEN        
       DO;        
         PAGEE.CDRMIN1 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMIN1 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTRMIN1 = INTER_C10;        
         W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         W_MTPROMO = W_MTPROMO + INTER_F15;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMBRI = 'Y' THEN        
       DO;        
         PAGEE.CDRMBRI = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMBRI * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTRMBRI = INTER_C10;        
         W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         W_MTPROMO = W_MTPROMO + INTER_F15;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMDM3 = 'Y' THEN        
       DO;        
         PAGEE.CDRMDM3 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM3 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTRMDM3 = INTER_C10;        
         W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         W_MTPROMO = W_MTPROMO + INTER_F15;        
       END;        
     IF SCENARIO_6.SELECT_GAR.CDRMDM4 = 'Y' THEN        
       DO;        
         PAGEE.CDRMDM4 = 'Y';        
         INTER_F15 = SCENARIO_6.RESULTAT_REM.MTRMDM4 * 100;        
         INTER_C10 = F_MTFTC(INTER_F15,'$BBBZ07V02$',2,10);        
         PAGEE.MTRMDM4 = INTER_C10;        
         W_MTTOTAL = W_MTTOTAL + INTER_F15;        
         W_MTPROMO = W_MTPROMO + INTER_F15;        
       END;        
   END;        
 INTER_C10 = F_MTFTC(W_MTTOTAL,'$BBBZ07V02$',2,10);        
 PAGEE.MTTOTAL = INTER_C10;        
         
 IF SCENARIO_6.CDPROMO ^= ''        
   THEN INTER_C10 = F_MTFTC(W_MTPROMO,'$BBBZ07V02$',2,10);        
   ELSE INTER_C10 = '';        
 PAGEE.MTPROMO = INTER_C10;        
         
 IF SCENARIO_6.CDPROMO ^= '' THEN        
   DO;        
     W_MTBENEF = W_MTTOTAL - W_MTPROMO;        
     INTER_C10 = F_MTFTC(W_MTBENEF,'$BBBZ07V02$',2,10);        
   END;        
 ELSE INTER_C10 = '';        
 PAGEE.MTBENEF = INTER_C10;        
         
 PAGEE.AUTORSO = SPAVAR.AUTORSO;        
 PAGEE.DAVALID = SPAVAR.DAVALID;        
         
 IF SCENARIO_1.CDECOV2 = '1'        
   THEN PAGEE.CDVVERT = 'Y';        
   ELSE PAGEE.CDVVERT = ' ';        
         
     TRACE = 'GA2016E ===> ' !! 'END F6_2';        
         
     CALL PT;        
 $END F6_2;        
 /*-----------------------------------------------*/        
         
 F7: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F7';        
         
     CALL PT;        
 /********************************************        
 * PAGEE : SCROLLING                         *        
 ********************************************/        
     TRACE = 'GA2016E ===> ' !! 'END F7';        
         
     CALL PT;        
 $END F7;        
 /*-----------------------------------------------*/        
         
 F8: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F8';        
         
     CALL PT;        
 /********************************************        
 * PAGEE : PRESENTATION XML                  *        
 ********************************************/        
         
     TRACE = 'GA2016E ===> ' !! 'END F8';        
         
     CALL PT;        
 $END F8;        
 /*-----------------------------------------------*/        
         
 F9: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'F9';        
         
     CALL PT;        
 /********************************************        
 * PAGE9 : PRESENTATION XML                  *        
 ********************************************/        
         
     TRACE = 'GA2016E ===> ' !! 'END F9';        
         
     CALL PT;        
 $END F9;        
 /*-----------------------------------------------*/        
         
 FA: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FA';        
         
     CALL PT;        
 /********************************************        
 * VALIDATION SYNTAXIQUE                     *        
 ********************************************/        
 IF JWB001.CDTRACE >= 3 THEN DO;        
 PUT SKIP LIST('MIDE.CLE = ',MIDE.CLE);        
 PUT SKIP LIST('MIDE.CDTYPOP = ',MIDE.CDTYPOP);############################        
 END;        
         
 CALL FE;        
 IF SCENARI.TBSCENA(9) THEN RETURN;        
         
         
 ERREUR = OFF;        
 CDRTPGM_W = '';        
         
     TRACE = 'GA2016E ===> ' !! 'END FA';        
         
     CALL PT;        
 $END FA;        
         
 /*-----------------------------------------------*/        
 FB: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FB';        
         
     CALL PT;        
 /********************************************        
 * VALIDATION CONTEXTUELLE                   *        
 ********************************************/        
 ERREUR = OFF;        
 CDRTPGM_W = '';        
         
 CALL FE;        
 IF SCENARI.TBSCENA(9) THEN RETURN;        
         
         
 IF MIDE.CLE = 'S'        
  ! MIDE.CLE = 'R' THEN        
   DO;        
     SCENARI.TBSCENA(8) = ON; ###############################################        
         
     SCENARI.TBSCENA(9) = ON;        
         
   END;        
         
     TRACE = 'GA2016E ===> ' !! 'END FB';        
         
     CALL PT;        
 $END FB;        
 /*-----------------------------------------------*/        
 FC: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FC';        
         
     CALL PT;        
 /********************************************        
 * UPDATE DES DB                             *        
 ********************************************/        
     TRACE = 'GA2016E ===> ' !! 'END FC';        
         
     CALL PT;        
 $END FC;        
 /*-------------------------------------------------------------------*/        
 FD: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FD';        
         
     CALL PT;        
 /********************************************        
 * SWITCHING VERS UN AUTRE SCENARIO          *        
 ********************************************/        
 IF JWB001.CDTRACE >= 3 THEN DO;        
 PUT SKIP LIST('- MIDE.CLE       : ',MIDE.CLE     );        
 PUT SKIP LIST('- SPAVAR.CDTYPOP : ',SPAVAR.CDTYPOP);        
 PUT SKIP LIST('- SPA.CDOPTRN    : ',SPA.CDOPTRN);        
 END;        
         
 IF SCENARI.TBSCENA(3) THEN        
         
   DO;        
     SPA.CDOPTRN = 'IMENU';        
     JWB001.CDRTPGM  = 'DUMMY';        
     RETURN;        
   END;        
         
 IF MIDE.CLE = 'S' THEN        
   DO;        
     SPAVAR.CDTYPOP = 'S';        
     SCENARI.NOPGACT = '9';        
   END;        
 IF MIDE.CLE = 'R' THEN        
   DO;        
     SPAVAR.CDTYPOP = 'A';        
     SCENARI.NOPGACT = '6';        
   END;        
         
 JWB001.CDRTPGM  = 'DUMMY';        
         
     TRACE = 'GA2016E ===> ' !! 'END FD';        
         
     CALL PT;        
 $END FD;        
 /*-----------------------------------------------*/        
         
 FE: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FE';        
         
     CALL PT;        
 /********************************************        
 * TEST SI SCROLLING EST DEMANDE             *        
 ********************************************/        
 SCENARI.TBSCENA(9) = OFF;        
         
 SCENARI.TBSCENA(8) = OFF;        
         
         
         
     TRACE = 'GA2016E ===> ' !! 'END FE';        
         
     CALL PT;        
 $END FE;        
 /*-----------------------------------------------*/        
         
 FF: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FF';        
         
     CALL PT;        
 /********************************************        
 * TEST SI SCROLLING EST DEMANDE             *        
 ********************************************/        
     TRACE = 'GA2016E ===> ' !! 'END FF';        
         
     CALL PT;        
 $END FF;        
 /*-----------------------------------------------*/        
         
 FG: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FG';        
         
     CALL PT;        
 /******************************************************        
 * TEST DES TOUCHES EQUIVALENTES A PF1 EN CONFIRMATION *        
 ******************************************************/        
     TRACE = 'GA2016E ===> ' !! 'END FG';        
         
     CALL PT;        
 $END FG;        
 /*-----------------------------------------------*/        
 FH: PROC REORDER ;        
     TRACE = 'GA2016E ===> ' !! 'FH';        
         
     CALL PT;        
 /******************************************************        
 * TEST DES TOUCHES EQUIVALENTES A PF1 EN CONFIRMATION *        
 ******************************************************/        
         
 TRACE = 'GA2016E ===> ' !! 'END FH';        
         
 CALL PT;        
         
 $END FH;        
 /*-----------------------------------------------*/        
 /* --------------- */        
 /*     INCLUDE     */        
 /* --------------- */        
 /*------------------------------------------------------------------*/        
 F_MTFTC: PROC(MT_W,MS_W,DC_W,LN_W) RETURNS(CHAR(10));        
         TRACE = 'GA2016E ===> ' !! 'F_MTFTC';        
         
         CALL PT;        
 /*******************************        
 * FORMATAGE DU MONTANT         *        
 * RETURN : MONTANT FORMATE     *        
 *******************************/        
 DCL MT_W              FIXED(15);        
 DCL MS_W              CHAR(11);        
 DCL DC_W              PIC '9';        
 DCL LN_W              PIC '99';        
         
 KGI012J_RI = '';        
 KGI012J_RO = '';        
 KGI012J_RI.CDFMTMT     = 'MTIN_F15';        
 KGI012J_RI.CDDVTRN     = IEU001.CDDVTRN;        
 KGI012J_RI.CDLGTRN     = SPA.CDLGTRN;        
 KGI012J_RI.MTIN_F15 = MT_W;        
 KGI012J_RI.CDMSKOUT = MS_W;        
 KGI012J_RI.NBLENOUT = LN_W;        
 KGI012J_RI.NBDECIN  = DC_W;        
 JWB001.LTNMMTH = 'FORMATAGE';        
 JWB001.LSTCALL = 'FIX_TO_CH.1';        
         
 CALL KGI012(IEU001,JWB001,KGI012J);        
         
 SELECT(JWB001.CDRTPGM);        
   WHEN('') RETURN(SUBSTR(KGI012J_RO.LTMNT_C26, 1,LN_W));        
   OTHER    RETURN('');        
 END;        
         
 $END F_MTFTC;        
 /*------------------------------------------------------------------*/        
 STATSITE2: PROC (TYPEPR,CPTEUR,IND,CDMAJ);        
        TRACE='===> STATSITE2  <===';        
      CALL PT;        
 /***********************************************        
 *  Appel interface statistiques devis internet *        
 ***********************************************/        
 /*    compteur 1  = nbre de devis anonymes        
                2  = nbre de branchement vers l'identification        
                3  = nbre de nouveaux prospects        
                4  = nbre de prospects confirm{s        
                5  = nbre de devis identifi{s        
                6  = nbre de souscriptions avec CDR ok        
                7  = nbre de documents demand{s        
                8  = nbre de refus CDR        
                9  = nbre de contact CC        
                10 = nbre de contact email        
                11 = nbre de contact courrier        
                12 = nbre de sauvegarde devis en my ethias        
                15 = nbre de devis affich{s   en my ethias        
       TYPEPR = CHAR(8)        
            = F/N(1) !! KERNEL(2) !! PRODUIT (5)        
       IND = indice de l'{l{ment du tableau        
       CDMAJ =  'C' m{moriser compteur stat        
                'M' m{moriser ET appel  @ xsm532        
       CDMYET = 'Y' maj stat My Ethias        
 */        
 DCL TYPEPR     CHAR(*);        
 DCL 1 TYPE_R DEF TYPEPR,        
       2 CDLGTYP  CHAR(1),        
       2 CDPRTYP  CHAR(7);        
         
 DCL SITE     CHAR(10);        
 DCL CPTEUR   PIC'99';        
 DCL IND      FIXED BIN(15);        
 DCL CDMAJ    CHAR;        
 DCL CDMYET   CHAR;        
         
    JSM131.PARAM = '';        
    JSM131.ALTPCB = GA2016J.ALTPCB;        
    JSM131.CDSCTRN = '';        
    JSM131.CDEVTRN = IEU001_R.CDEVTRN;        
    JSM131.NBTYSTA = 1;        
    JSM131.CDTYSTA(JSM131.NBTYSTA) = 'MYSMA';                                   
    JSM131.MTVAINC(JSM131.NBTYSTA) = 1;        
    JSM131.DAOPGES(JSM131.NBTYSTA) = #DATE_SAAMMJJ;        
    IF CDLGTYP = 'F'        
       THEN JSM131.LTIDCLE(JSM131.NBTYSTA) = 'METHFR' !! CDPRTYP;        
       ELSE JSM131.LTIDCLE(JSM131.NBTYSTA) = 'METHNL' !! CDPRTYP;               
    JSM131.NOIDCPT(JSM131.NBTYSTA) = 15;##############################        
         
         
     CALL XSM532(JSM131);        
     IF JSM131.CDRTPGM ^='' THEN        
     DO;        
        IF JWB001.CDTRACE >= 3 THEN        
        DO;        
        PUT SKIP DATA(JSM131);        
        PUT SKIP DATA(JSM131.RETURN_CODE.CDRTPGM);        
        PUT SKIP DATA(JSM131.RETURN_CODE.LASTDLI);        
        END;        
        RETURN;        
     END;        
 $END STATSITE2;        
         
 /* ------------------------------------------------------------------*/        
 $$END GA2016E;        
